{"title":"狄魔高根的补丁(1)","date":"2023-03-30T17:02:33.000Z","date_formatted":{"ll":"Mar 30, 2023","L":"03/30/2023","MM-DD":"03-30"},"link":"2023/demogorgon_patch_1","comments":true,"tags":["AO3","NetHack","同人","翻译"],"updated":"2024-06-23T07:44:17.039Z","content":"<p>原作：greyknight</p>\n<p>译：Silencess</p>\n<p><strong>摘要：</strong></p>\n<p>本在地铁上发现一张神秘的软盘，而它打开了一个陌生的新世界。</p>\n<p><strong>作者寄语：</strong></p>\n<p>致<a href=\"https://archiveofourown.org/users/Synoddiane/gifts\" target=\"_blank\">Synoddiane</a>。</p>\n<p>我一般不会这么吓人的！但一个关于狄魔高根的故事确实值得这样处理。</p>\n<p>本是在地铁上捡到那张改变他人生的软盘的。当时他刚从女朋友家里回来，好不容易才赶上当晚的末班车，车厢里除了他只有寥寥几人。刚一坐下，他发现自己的鞋带松了，于是弯腰去系。他的余光瞥见了什么东西：一块方形塑料片掉在邻座下面，大约有五英寸长宽。他把这玩意勾出来，重新坐正开始好好检查。</p>\n<p>那是一张古旧的软盘，他很多年没见过这种型号的软盘了。软盘上贴了张发黄的标签，上面记着手写的描述，字体略显老派，有点像德文黑体。泛棕的墨水记着这样一行字： <em>“NetHack: 狄魔高根的补丁”</em> 。本的注意立刻被吸引了。NetHack是他本人时不时会玩的一款电脑游戏；很显然，这张软盘里就装着一个什么人自制的、这款游戏的版本补丁。根据这个标题，他猜测这版补丁扩展了狄魔高根这一角色的内容：狄魔高根是这游戏里较为出名的致命敌人之一，是一名强大的恶魔王子。他环视整节车厢；把这东西落下的人很可能已经下车了。他想着是不是应该将它交给失物招领处，好让失主能寻回这东西。但也许他也可以先保留一段时间，把里面的文件复制一份？之后他仍然可以再去失物招领处交还这件物品，而且这样一来他就有机会试试这个补丁到底改了什么内容了。</p>\n<p>他把软盘滑进口袋里，带着罪恶感环顾四周。反正也没有人在看他这边。他想着，自己得去什么地方才能找到一台能读这种古董软盘的机子呢。 <em>也许刘易斯能想到办法</em> ，他对自己说。</p>\n<hr>\n<p>直到第二天晚上，他才终于见到了刘易斯。介绍了自己捡到这卷设备的经过之后，他问刘易斯能不能帮帮忙。</p>\n<p>“这玩意太古老了！”刘易斯感叹道，“我认真的，我这儿连读3.5英寸盘的软驱都没有，更别说这么大的老东西了。”</p>\n<p>“呃，行吧……那你还认识什么够宅的家伙会有这种东西吗？”</p>\n<p>“哈？我看你就是我认识的最宅的家伙了。不过……诶，我还真想到个在这事上也许能帮到我们的人。”</p>\n<p>“不错！你需要我把这张盘给你之类的吗？”</p>\n<p>“确实，最好把它拿上。我们得先搞清楚这张盘是什么格式的，然后才能帮你找到能读取它的机器。”</p>\n<p>“嗯，是这样。我猜肯定得是什么特别古老的操作系统吧？说不定现在都没人用的那种。”</p>\n<p>“对的，像是Windows ME之类的。说不定我明天就能给你消息。”</p>\n<p>那天晚上，本还坐下来翻了几个网站，看看能不能找到点和这版补丁内容相关的线索。他找到几个跟狄魔高根相关的补丁，但没有一个是叫这名字的。这倒不是什么很难想象的事：有很多单人开发的NetHack补丁可能现在还躺在开发者的电脑里，根本没机会上传到“比利厄斯补丁数据库”或者互联网上的其他任何地方呢。显然，都藏在这么一张本身就是旧日遗物的软盘里了，也不会有什么人考虑优先把它送到现代世界来的。他也只是想知道这个补丁到底是基于游戏本体的什么版本。NetHack是个历史悠久的游戏，而这张盘里的内容也很有可能和它本身一样古老。</p>\n<p>他在IRC和USENET上问了问其他玩家，可仍然没找到任何线索。大概只能选择更艰难的那条路了：等他们解密了这张软盘，然后自己找出答案。他打开几个包含游戏剧透信息的站点，开始按时间顺序查询这游戏漫长一生中的诸多重大变化。要是他捡到的是某些特别古老的版本的话，他至少应该知道自己在和什么东西打交道。而假如这补丁基于的版本和他最熟悉的那个版本大相径庭的话……好吧，众所周知NetHack并不是个容错率很高的游戏。</p>\n<hr>\n<p>几天之后，本坐在自己的房间里，看着一大坨该进博物馆的奇怪发黄塑料玩意。刘易斯的朋友从他的古董收藏里翻出来了这台东西，它正是能运行那种软盘的设备。这台来自旧时代的电脑有一个陌生的品牌——一张模糊不清的“阿尔哈兹雷德科技”标签。他耸耸肩，按照机器送来时演示的那样启动了它。尽管经历了好一番利诱和宣誓——如果这台破旧的老机器有什么三长两短，他将遭受严厉的惩罚——但他最终还是成功达成了协议，把机器借到了手。</p>\n<p>在这台巨兽推进它长长的启动流程时，他在自己的电脑上调出了他的剧透笔记。启动一完成，他立刻将那张“狄魔高根的补丁”软盘插入了这台设备。参照一张记有所有机器指令的纸条，他敲下对应的命令，屏住呼吸，然后按下了回车。</p>\n<p>“<span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>NetHack: 狄魔高根的补丁</span>”，标题栏显示着这么一行字，并没有提到版本号。本快速翻阅了角色职业列表。常规的选项都在这里：盗贼、巫师、医生、骑士、游侠、游客……但还有一个新增的选项。怀着好奇，本选择了“符号学家”作为自己的职业。很快，他已经读完了常规的开局介绍文本，并与他所控制的中立男性人类符号学家一起进入了命运地牢。开局分配的宠物是一只小猫，本没什么犹豫便将其命名为“雷”。接着他开始检视自己的物品栏。 <em>太棒了！</em> 他想， <em>符号学家开局就带着一支魔笔！</em> 这是很有用的工具，可以让他有能力写出魔法卷轴和魔法书。</p>\n<p>当晚剩下的时间里，他小心翼翼地探索着地牢，随时警惕着这个补丁可能加入的、令人不快的意外情况。开局自带的魔法书之魔法飞弹在消灭哥布林和其他袭击他的地牢住民时非常有用，很快他便清理了好几个楼层，还攒下了一小组留作后用的道具。他的小猫，雷，也在奋不顾身的战斗中很快成长为可以独当一面的勇士。</p>\n<p>事实上，在玩了好几天以后，本才对将要发生的事情有了点最基本的了解。那时他刚刚到达神谕的居所，并惊奇地发现所有通常矗立在那里的半人马雕像已经全部被砸成了碎石。当然，他自己本来也打算看看这些雕像里面有什么，因为雕像经常会藏有魔法书，但这件事超出了他的预料。他无可奈何地向前走去，进入了本层的主厅。在那片喷泉之间，只躺着一个孤独的百分号（%）：那是神谕的尸体。</p>\n<p>一瞬间他便进入了戒备状态。这只可能是一个“骨档”文件：这层的状态在某个前任角色死亡时被存储在磁盘里，而他现在被随机选中来见证这位玩家的选择所带来的后果。是那个角色砸碎了雕像，杀死了神谕，现在可能正躺在附近什么地方的一处坟墓中。并且，理所应当地，那杀死了他的什么人——或者什么东西——也是他要面临的问题。</p>\n<p>实际上，这一层静得有点令人毛骨悚然了。自他从上一层下来之后，他还没有见过任何一个随机生成的怪物。提起万分小心，本谨慎地摸过这里的每一个角落，探明了地图上的每一片未知的地块。终于，他找到了自己预想中的那块墓碑。阅读碑上的铭文，他知道这地下埋葬着一具腐朽的尸体，它属于罗宾，另一位符号学家。“<span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>被狄魔高根的不悦杀死</span>”。嗯……这听起来很不祥。不过，至少在这格地面上放着的东西是不错的。本贪婪地按下逗号键（,），几乎想都没想便将其拾起。</p>\n<p><span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>m - 仪式刀名为神魔克星</span></p>\n<p>当然，墓碑上关于“老D”的只言片语令他的警戒心还要更进一步了。他几乎是踮着脚尖挪到了向下的楼梯处，目光不断移向每个进入视野的方格。感觉简直像过了一年之后，他终于到达了下楼的楼梯间，可以逃离这一层了。他意识到，在这整整一层里，他还连一个怪物都没有见过；甚至连“罗宾”的鬼魂都没露过一次面。只有他的宠物猫，雷，随他穿过这片德尔斐神庙的残垣断壁。</p>\n<p>两层之后，在途经一个显然空无一物的房间时，本被吓了一跳。“<span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>你踩上了奥术符文!  – 更多–</span>”游戏这样显示。后半部分代表他误入的这个陷阱会带来进一步的后果。他在脑中迅速过了一遍原版NetHack中所有可能的陷阱。通常游戏中不存在“奥术符文”这个东西；很显然这是补丁的一部分。他试探着按下空格，打算看看后续的文本。“<span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>你感觉充满了力量!  – 更多–</span>”数据实际上已经更新，游戏显示他的魔法能量满了。结果并不是坏陷阱嘛！他再次按下空格。“<span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>你感觉好像少了什么东西.</span>”嗯……不太明白这是什么意思。也许当他拿来某种东西的时候这种陷阱会有不同的表现？但是要带什么，带了又会发生什么呢？他在笔记上记下这里，然后继续赶路。那个有陷阱的格子现在显示为一个插入符号（^），和通常一样代表这里有陷阱。奥术符文是紫色的，他注意到这点。</p>\n<p>他打开一扇门，突然惊恐地倒退一步，所有关于这种奇怪陷阱的想法瞬间挥之一空——一个蓝色的小写e飘进了房间。是浮眼！他无声地祈祷了一下，感谢至少没有其他怪物也加入这场聚会。只有浮眼的话还好处理；要是和别的怪物一起来的话，它的麻痹凝视就相当危险了。幸好，本已经获得了游戏中最令人惊讶的有用工具之一：眼罩。</p>\n<p>将雷留在房间外，他避开移动缓慢的浮眼，关上房间里的所有门以防不速之客的打扰。接着，他戴上那块保护性的布料，将角色与全世界的视线隔断。在一片黑暗中，他挥动武器击向浮眼最后出现的位置。由于魔法麻痹凝视已经被他阻挡在外，那漂浮着的圆球无力作出任何反抗，很快便被他杀死了。然后，本飞快地摘下眼罩，以防有其他什么东西前来偷袭。幸而房间仍是空的……或者说几乎是空的，因为浮眼还留下了可食用的尸体！</p>\n<p>本激动地低呼一声，快速移动到标着尸体符号的格子上开始进食——浮眼的尸体可是种有魔力的美味。自然，他刚刚吃完这一餐，游戏立刻提示道他“感觉奇怪的精神敏锐”。他再次戴上眼罩，这次他的“目盲”状态强化了某种心灵感应的视角，使他足以看清整层的所有怪物。 <em>妙啊！</em> 他想着， <em>这么前期就获得了心灵感应！多棒的发现！</em></p>\n<p>然而他的兴奋并不长久，因为一道黑色光环这时缠绕上了他手中的神魔克星。哦，怎么又这样！他不满地嘟囔道。在原版游戏中，名为神魔克星的这把武器有许多实用效果，而其中最为知名的是它那抵御诅咒的能力；可在这个补丁里，它却似乎一直在招引诅咒。这已经是他捡起它之后第三次莫名其妙被诅咒了。现在它又牢牢地粘在他的手上了，他只有找到下一张解除诅咒卷轴才能把它松开。 <em>现在我算是知道那支魔笔是干嘛用的了，</em> 他在心里嘀咕着， <em>用来写一万张解诅咒卷轴！</em></p>\n<p>是时候保存退出去睡觉了，他这样决定。那天夜里他做了个怪梦，梦见自己被困在一片ASCII字符构成的迷宫中，字母们徘徊在线条风的长廊间，猎捕着他。一大波大写Z和W追逐着他，如浪潮般涌入走廊中。突然间，他看见地面上落着一个小括号（(），正要伸手去捡，脊背却传来幽灵的冰冷气息。他迅速转身，举起自己刚入手的新武器——然后在这一瞬间苏醒了过来。</p>\n<p>本汗流浃背、心跳加速，努力平缓自己的呼吸。只是个愚蠢的噩梦，只是最近玩这游戏玩太多了，他这样想着，想要挥手抹去额前的汗水。然而，当他抬起手臂时，有什么冰冷的、金属质的闪光晃了他的眼睛。他连忙去摸眼镜，不敢相信自己看到的一切，但那副情形即使他戴上眼镜也没有消失、不容置疑。这绝不可能发生，可面前这把波浪形边缘的匕首也不可能有第二个名字——它那雕琢着复杂花纹的淡蓝色刀柄令人隐约瞥见另一个几何学和神秘符文的陌生世界。</p>\n<p><span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>被诅咒的+2 神魔克星（拿在手上）</span></p>\n<hr>\n","prev":{"title":"使用SIMH模拟器安装4.2 BSD（以Win11为例）","link":"2023/win10_4.2_BSD"},"next":{"title":"ChatGPT提示的艺术：制作清晰有效咒语","link":"2023/ChatGPT-receipt"},"plink":"http://www.ephesus.top/2023/demogorgon_patch_1/","reward":true,"reading_time":"3780 words in 25 min"}