{
	"data": [
		{
			"id": "$CLUE_0",
			"noteType": "MEMO",
			"contents": "Dear Dr. Kennedy.\nRegarding your questions about the water needs of our new vegetable species, I must tell you that most can store water inside their leaves for a long time. This allows them to survive without the need of watering them. However, some species didn’t have such successful splicing and require water canals to grow. Said species are the ones dubbed by the test subjects as “red rice” and “sweet stick”.\nI’ll be happy to answer any other inquiries.\nYours,\nDr. Glass.\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_1",
			"noteType": "MEMO",
			"contents": "TO ALL EMPLOYEES\nThe swamp is strictly off-limits.\nSpecimen #569698-58, commonly known as “meat vines” has been found growing around the swamp.\nIf any employee finds one of the specimens outside the swamp containment zone and is trapped by it, the current instructions are to use salt on its skin.\nAny information on who took embryos of the specimen before the incineration was made; will be greatly rewarded.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_2",
			"noteType": "MEMO",
			"contents": "Hi fellow hunter!\nIt’s fun that the company allows us to hunt on these grounds during our leisure time, isn’t it?\nDo you know what’s even better? Making the most out of it!\nBy now you must have noticed that animals here are all escaped or freed specimens. And most vegetation has also been modified by Genco. Therefore, I’ve decided to start leaving notes in hunting abodes to help fellow hunters make the most of their time!\nToday’s tip: Drop a “Knock Nut” to attract any rodent. They make great bait, and a good bite if you haven’t been able to hunt lately! (The knock nut tastes great as stuffing for those rodents you may attract too).\nMake sure to look out for my notes!\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_3",
			"noteType": "MEMO",
			"contents": "TO ALL EMPLOYEES\nThe main vault at the center of the woods is off-limits.\nDue to recent disturbances, the surrounding area has been declared a hazard.\nGenco will hold no responsibility if any employee ignores this warning.\nIf you see a fellow employee going in the direction of the main vault, report it to your supervisor. Their life is at risk.",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_4",
			"noteType": "LETTER",
			"contents": "The note is incomplete and written hurriedly on a scrap of paper.\n…find you, so I’m leaving this note.\n…offered money not to talk about the things inside the main vault…\n…threatened my family!...\n…rumors say they have fed us trackers…\n…’s family is missing and he’s inside an asylum due to “psychosis”, it’s better to shut up, and take care of yourself!\n\nThere’s more written on the note, but you can’t make out anything else.",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_5",
			"noteType": "MEMO",
			"contents": "Hi fellow hunter!\nDid you know you can catch animals and release them? \nOne would think that’s common knowledge but some people…\nWhatever… You need to get next to the animal and… Catch it! Most animals move fast so don’t rush and take your time to plan your movements. Also! Watch out! Some animals may be aggressive.\nRemember you can always lay traps and lure animals.\nWhen you catch an animal you’ve never seen, remember to take notes of it in your journal.\n\nMake sure to look out for my notes!\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_6",
			"noteType": "LETTER",
			"contents": "Oct 25, 1920\nHello Sallie,\nI also enjoyed our escapade to the woods. It’s so nice we can bring family to work.\nWho would have known that Kadine could be used for such purposes? Not only did I fill full, but I also felt I could go on for hours!\nA shame they may be toxic if you eat too many as all berries here. Can you imagine if we could distill their juice or make pills out of them?\nSee you next Friday on my leave,\nGeorge.\nPs. Could you make me those chicken thighs I love?\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_7",
			"noteType": "LETTER",
			"contents": "Jan 1, 1941\nHarold,\nAs you requested, here’s a more informal report of what was found inside the mountains, or as you put it “a report in plain English”.\nThe mountains near Genco property seem to be hollow.\nInside them, we’ve found a whole ecosystem completely alien to everything known to man.\nSome stones seem to emit ultraviolet light, the same kind used by plants to “feed” as you would say it. \nRegards,\nMichelle.",
			"weight": 5,
			"documentTier": 3
		},
		{
			"id": "$CLUE_8",
			"noteType": "LETTER",
			"contents": "Mar 1, 1944\nHarold,\nAs per your request, here’s another informal report of incident HK-987\nInside the mountains, we’ve found an abundance of Mutalite and strange pale creatures from the depths. They seem aggressive but extremely resistant to disease and harm.\nRegards,\nMichelle.",
			"weight": 5,
			"documentTier": 3
		},
		{
			"id": "$CLUE_9",
			"noteType": "LETTER",
			"contents": "Mar 2, 1944\nDear Dr. Michelle,\nPlease destroy this document after you read it.\nYou are to procure several specimens of these “deep creatures” and bring them to the main vault.\n\nYours,\nJohn Shelby. CEO",
			"weight": 5,
			"documentTier": 3
		},
		{
			"id": "$CLUE_10",
			"noteType": "LETTER",
			"contents": "Dec 29, 1920\nDear Mr. Shelby,\nI want to inform you we have found a pink crystal we’ve dubbed “Mutalite”. Its properties are not yet completely understood, but it seems to be radioactive and shows a lot of potential for use in biological experiments.\nIt may hold the key to what you’re looking for.\nWith respect,\nHarold Smith.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_11",
			"noteType": "LETTER",
			"contents": "Apr 20, 1921\nDear Mr. Shelby,\nWe have confirmed that after vaporization, Mutalite may act as a virus, altering the genome of any lifeform touched by it thanks to it being capable of mimicking proteins when made into nanostructures analog to them. It’s also soluble in water.\nYours,\nHarold Smith.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_12",
			"noteType": "LETTER",
			"contents": "Apr 30, 1921\nHarold, \nI understand that Mr. Shelby wants this research to go as fast as it can, but your orders to ignore so many safety precautions with a substance we don’t yet understand is concerning. Allow me to remind you that Mutalite being soluble in water and having similar density means it could join the water cycle, we don’t know yet!\nRegards, \nMichelle.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_13",
			"noteType": "LETTER",
			"contents": "Jun 24, 1921\nSallie, thanks to international collaboration and… Cutting corners; we’ve made the impossible!\nWe are creators of life!\nI won’t bore you with the details, but thanks to nuclear power and Mutalite, we have created life from inanimate materials!\nWe made a little fish capable of living outside of water (but close to it).\nI’ve dubbed it “Pugsh”. Its bulging eyes remind me of Pugs.\nIt produces glue that could (and should!) be commercialized.\nI love you,\nGeorge",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_14",
			"noteType": "MEMO",
			"contents": "TO ALL EMPLOYEES.\nAs many of you have noted, last night’s rain was infused with Mutalite.\nOur weather team confirms it’s going to be recurrent for a couple of months and then end.\nThey also have confirmed it’s going to happen every year from now on. \nEmployees are advised to remain indoors and use hazmat suits to go to work during this season since Mutalite is highly mutagenic.\nGenco reminds their employees that they are under an NDA, and under no circumstances should any employee talk about this or any work-related incident to anyone who hasn’t at least a level 2 card.",
			"weight": 5,
			"documentTier": 3
		},
		{
			"id": "$CLUE_15",
			"noteType": "LETTER",
			"contents": "This seems to be the first page of a letter.\n\nAug 20, 1943\nDear son,\nI’m sorry.\nToo late have I understood how precious you were to me.\nToo late did I understand that you offering your life to preserve mine didn’t mean I had the right to take it. I should have refused, I should have died. The events done on Apr 1 should have never happened.\nThe process seems to be a success, but we have no idea of the long-term effects. Maybe your consciousness is still here, and you can read this letter through my eyes… That is to say, your eyes.\nMy consciousness was successfully transferred to your young body, but who is to say I actually didn’t die and this all is just the passing hallucinations of your own body, trying to cope with knowledge that isn’t yours? Who am I? Who are you? It’s all very ",
			"weight": 5,
			"documentTier": 3
		},
		{
			"id": "$CLUE_16",
			"noteType": "LETTER",
			"contents": "This seems to be a continuation of a letter.\n\n...confusing. Maybe in a couple of years, this body will awake and this brain will think all this to be a nightmare, and that who died was your father… I hope so…\nFor now, it seems the body of your old frail father died, and its consciousness was transferred to this, your young body. My body?\nIt has just been a couple of months… And all my obsession with finding eternal life seems so stupid! All the joys in life mean nothing with you gone.\nI always thought love was for the weak, and I was so pragmatic… But it turns out I loved you!\n\nHopefully, you’ll return… Hopefully, someday I’ll fade.\n\nWith love,\n\nYour father.\n\nJohn Shelby senior.",
			"weight": 5,
			"documentTier": 3
		},
		{
			"id": "$CLUE_17",
			"noteType": "MEMO",
			"contents": "The deep ones are sentient and sapient! We have NO RIGHT to purge them.\nThey didn’t ask to be created.\nEveryone has to sneak and free at least one. They are not aggressive as management wants us to believe! They are just afraid, calm them and help them! \nFree them into the caves and hollow mountains!\nRead and pass this message along!",
			"weight": 5,
			"documentTier": 3
		},
		{
			"id": "$CLUE_18",
			"noteType": "MEMO",
			"contents": "Dec 1, 1949\nAll employees are to remain at least 4 miles away from the main vault. This includes level 3 employees.\nThere has been an accidental explosion and the zone surrounding it is extremely hazardous.\nDue to the open nature of the facilities, flags have been placed around the zone.\nIf you see white flags, you should not cross them or be careful not to venture further. White flags are 10 miles away from the vault.\nIf you see red flags, you’ve crossed the point of no return.",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_19",
			"noteType": "LETTER",
			"contents": "Aug 17, 1950\nIn my hubris, I thought I deserved to live forever.\nIn my hubris, I thought I deserved control over many.\nDue to my hubris, I lost you, my son.\nMaybe I should feel remorse for leaving so many fathers without their sons. You’d tell me I’m being selfish, and you’d be right. I don’t feel remorse for anything but losing you.\nThis is my goodbye until… I know not how long. \nI had a secret project. “The perfect man”, I’d call it to my close ones. In reality, I wanted the perfect soldier. \nOf course, it backfired.\nThey took the vault, and since your remains are hidden here, I had to take it back.\nWith fire and steel, I took it, but Genco will be no more.\nFarewell, my son. \nI’m sealing the vault.\nJohn Shelby senior.\n",
			"weight": 5,
			"documentTier": 3
		},
		{
			"id": "$CLUE_20",
			"noteType": "LETTER",
			"contents": "Feb 15, 1946\nSallie, this is hard to write, it's hard to believe.\nI’ve worked at Genco almost all my life. Our children have met Mr. Shelby and everything we have we owe to Genco and Mr. Shelby. But the rumors here…\nThey say we’ve been experimenting on unwilling humans inside the main vault. They say Genco is enslaving the resulting… creatures? People?\nAfter the rumors started, many level 3 employees that worked inside the main vault disappeared. I would say they were fired or quit, but I’m not so sure anymore.\nThere are guards of Shelby’s private army around the facilities and we’re constantly reminded we signed an NDA to work here.\nI don’t know what to do.\nWith love,\nGeorge.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_21",
			"noteType": "MEMO",
			"contents": "DATE REDACTED\nDear REDACTED\nOur latest experiments have shown that Mutalite may store electrical information. That is to say when near something that emits electricity, Mutalite “remembers” the voltage and amperage that coursed, for how long it flowed, etc. When stimulated with energy, it forces it to flow through it as if it were a circuit, including resistor behavior and many other incredible conducts. It is theorized that it could also force two circuits to act in the same way.\nThis could mean programable circuits and the end of factory-made ones if we manage to make them smaller, and the ability to transmit knowledge instantly between people if this works in organic circuits like those of the neurons.\nYours,\nREDACTED\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_22",
			"noteType": "TAPE",
			"contents": "KKZZZZZZ\nWELCOME TO GENCO!\nTODAY, LIFE IS MADE BETTER!\nBUT BEFORE YOU SPLICE THOSE GENES OR BEGIN REVOLUTIONIZING HUMAN LIFE AS WE KNOW IT, YOU MUST LEARN ABOUT…\n::EMPLOYEE CARDS AND CLEARANCE LEVELS::\nPLEASE TAKE A LOOK AT YOUR EMPLOYEE CARD. DON’T LOSE IT! IT SERVES AS A KEY TO ENTERING MOST BUILDINGS AND SERVICES AT OUR GENCO FACILITIES! NOTE THE RED NUMBER AT THE TOP RIGHT CORNER. THAT’S YOUR CLEARANCE LEVEL!\nLEVEL 1 GIVES ACCESS TO THE PUBLIC FACILITIES. THESE CLEARANCE CARDS ARE FOR VISITORS ONLY. IF YOU ARE SEEING THIS VIDEO AND YOUR CARD IS A LEVEL 1 CARD, PLEASE ASK A SUPERVISOR FOR HELP!\nLEVEL 2 PROVIDES ACCESS TO MOST WORKING FACILITIES.\nLEVEL 3 PROVIDES ACCESS TO DANGEROUS FACILITIES LIKE THE VAULT. THESE FACILITIES HAVE RESTRICTED ACCESS BECAUSE THE EXPERIMENTS CONDUCTED HERE ARE BZZZZZZ\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_23",
			"noteType": "TAPE",
			"contents": "KKZZZZZZ\nTODAY, LIFE IS MADE BETTER!\nWE AT GENCO BELIEVE LIFE IS BEAUTIFUL, BUT CAN ALWAYS BE BETTER!\nTHAT’S WHY WE WORK TIRELESSLY TO BRING YOU NEW AND BETTER PRODUCTS!\nWHY BUY CHICKEN AT HIGH PRICES TO GET A GREASY, HARD, AND AWFUL TASTE IN YOUR MOUTH, WHEN YOU CAN BUY OUR CHEAK THIGHS? GUARANTEED TO BE ALWAYS TENDER, LEAN, BIG, TASTY, AND THE BEST PART… AT A SUPER LOW PRICE!\nASK FOR GENCO PRODUCTS AT YOUR LOCAL MART!\nBZZZZZZ\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_24",
			"noteType": "TAPE",
			"contents": "KKZZZZZZ\nWoman: Jan 18, 1945. Special recording for Mr. John Shelby. The recording has already started Harold.\nMan: Good, good. Em… So… Why don’t you explain it?\nWoman: Of course… We have successfully spliced the genome of “deep creatures” with those of humans. The resulting creature is…\nMan: CALLED THE DEEP ONES! Clever name huh? The subjects haven’t awakened yet, but we expect them to be strong and resistant to all kinds of diseases, including cancer!\nWoman: Yes sir… A clever name. Can I turn the recorder off now? Mr. Shelby has been informed.\nMan: Yes bu… \nBZZZZZZ\nThe recording is cut abruptly.",
			"weight": 5,
			"documentTier": 3
		},
		{
			"id": "$CLUE_25",
			"noteType": "TAPE",
			"contents": "KKZZZZZZ\nTo the person that finds this: DO NOT, I repeat, DO NOT get near the main vault. Genco’s higher-ups will have us believe the zone is contaminated… It’s contaminated all right! By Shelby’s private army! Strange creatures took control of the vault and now…\nRATATATATATATATA\nBZZZZZZ\nThe recording is cut abruptly.",
			"weight": 5,
			"documentTier": 3
		},
		{
			"id": "$CLUE_26",
			"noteType": "TAPE",
			"contents": "KKZZZZZZ\n*As the tape starts, you can see what appears to be a Clamatopi inside a glass box with stitches around its head, moving in circles without stopping*\nExperiment 158, week 3.\nSubject K266 has recuperated physically from the procedure, but shows signs of cognitive degradation. While previous weeks were a complete success, apparently showing learning and the absorption of knowledge of subject  K265; this week, subject K266 has shown signs of degradation. It started self-harming and now it appears to be in an almost vegetative state, doing the same movements and not responding to stimuli.\nMore experimentation is needed. A focus on finding a way to store information in Mutalite in a remote manner is advised. The traumatic experience of having a crystal inserted in one's gray matter while conscious is surely affecting the result of the experiment.\nWith this, experiment 158 is concluded. Subject K266 will be euthanized after finishing this recording.\nBZZZZZZ\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_27",
			"noteType": "ARTICLE",
			"contents": "December 14, 1954\nThe once-beloved company Genco has officially filed for bankruptcy today.\nAfter years of litigations, rumors of unethical experiments, and fines for allegedly violating regulations on the handling of biological specimens and management of nuclear waste.\nThe CEO John Shelby, the son of the company’s founder with the same name, speaks on page 9.\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_28",
			"noteType": "ARTICLE",
			"contents": "August 8, 1921\nNEW AND IMPROVED PUGSH GLUE!\nIt sticks to steel, paper, and even fabric!\nMade of quality animal materials by American hands.\nA gallon for only 99c!\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_29",
			"noteType": "ARTICLE",
			"contents": "July 15, 1930\nAmidst the current and terrible recession, our country’s most privileged must find the means to help society. This is what Genco’s founder and soon-to-be ex-CEO; John Shelby has done today with the creation of the Genco scholarship for excellency. This scholarship is available for any young man that wants to study science and engineering and is all-encompassing. It has the added benefit of guaranteeing a job at Genco with a high GPA. More information on page 7.\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_30",
			"noteType": "ARTICLE",
			"contents": "Feb 20, 1946\nA tragic incident has Baltimore in shock.\nSallie Rosewater, mother of 4 and loving wife was found dead by her own hand this Monday.\nHer friends are shocked, and describe Sallie as a happy woman and a devoted wife.\nAn anonymous source, however, claims she had been suffering from depression for several months after her husband, George Rosewater was demoted at his workplace; the technological giant Genco.\nMore information on page 10.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_31",
			"noteType": "ARTICLE",
			"contents": "Feb 28, 1946\nA family in shatters! \nLittle more than a week ago we reported the death of beloved community member Sallie Rosewater. Her death was too much for her husband to bear, who started displaying signs of psychosis and hallucinations at his workplace and had to be restrained and forcibly admitted to an asylum. His oldest son has taken charge of his home and is now caretaker of George’s youngest; a little 9-year-old girl.\nWill this family catch a break? \nMore details on page 14.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_32",
			"noteType": "ARTICLE",
			"contents": "May 8, 1924\nDuring a press conference, Genco announced they are working on a way to safely search for people trapped under debris and rubble. This marvel will be able to reach places that rescuers and dogs are unable to get to while getting rid of beams and other materials that may be harming the trapped people, maybe even freeing them in the process. Genco representatives claim that this thing they have dubbed “Clamatopi”, may even have military uses.\nAs of today, Genco is still developing Clamatopi.\nMore details on page 3.\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_33",
			"noteType": "ARTICLE",
			"contents": "Feb 16, 1925\nGenco has stirred up controversy after it was found out their “Clamatopi” may become pests due to their high reproduction rates and can experience emotions so complex, they may take revenge on handlers that mistreat them.\nThe religious group “People against biological experimentation”, also known as PABE, has started asking for regulations from the federal government. \nA PABE representative talks on page 10.",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_34",
			"noteType": "ARTICLE",
			"contents": "Jul 10, 1930\nAfter five years of protests from groups like PABE, and some scandals due to Genco’s experiments on animal life, a bill has finally passed, laying regulations on biological experimentation and even specifically on human experimentation; something never done before.\nGenco’s CEO has protested, claiming “Genco has proved its commitment to the betterment of society with its products and the creation of many jobs since its inception. This bill only hinders Genco’s efforts and may hurt the economy even more, after last year's crash.”\nJohn Shelby speaks about the alleged “obstruction of progress” on page 3.\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_35",
			"noteType": "ARTICLE",
			"contents": "Jul 1, 1922\nINSTAFERM!\nNever has it been easier to ferment anything in your own house!\nFrom cheese to yogurt, enjoy your favorite fermented products made with your own hands.\nLadies! Your hubby will surely praise you!\nWARNING: Do not mix the pill with juice or sweetened water and then put it in a jug inside the cupboard for twenty days, because then it would turn into an alcoholic beverage.\nMADE BY GENCO.\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_36",
			"noteType": "ARTICLE",
			"contents": "Dec 1, 1936\nGenco is in the eye of the storm again after several denounces of regulations violations have been filed.\n“All our experiments are ethical and being done outside our national soil with the utmost respect for the law”. Claimed John Shelby, Genco’s CEO.\nThis only threw fuel to the flame, reigniting the rumors about secret laboratories outside of America, hidden from the public eye and the banks.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_37",
			"noteType": "ARTICLE",
			"contents": "Jul 13, 1947\nDespite the rumors about the financial hurdles of Genco due to low sales, the company keeps announcing new projects and research. This time, the company has announced a new hope for blind patients. Directed to veterans of the war, Genco promises a total restoration of sight with their “self-powered” implants.\nMore information on page 4.\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_38",
			"noteType": "ARTICLE",
			"contents": "Mar 1, 1948\nFinancial worries strike Genco again. Genco has been sued by a group of veterans that used their “self-powered” eye implants released last year. Allegedly, the implants were nuclear-powered, and this was never disclosed to the patients, who now suffer from cancer.\nMore information on page 8.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_39",
			"noteType": "LETTER",
			"contents": "NO DATE\nAnd what good would it do to disclose what we do here in a letter?\nDo you think they don’t read our mail?  Even if we managed to send a letter or come up with a code that wouldn’t seem suspicious, they have people everywhere! Even government officials in several countries!\nI mean, this place doesn’t even appear on any map! Yes, the letter would get to its destination; if not, people would grow restless... but it wouldn't do any good.\nThere are even rumors of people being “retired” forcefully by Genco. Our only option is being a “good employee”. Let others worry... Let others try and send letters.\nUNSIGNED",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_40",
			"noteType": "MEMO",
			"contents": "Nov 15, 1949\nTo whomever it may concern,\nIt’s my duty to report that employee #4585-B has talked to me and several other employees about arming the escaped humanoids.\nYours,\nA good employee.\n",
			"weight": 5,
			"documentTier": 3
		},
		{
			"id": "$CLUE_41",
			"noteType": "LETTER",
			"contents": "Jan 1, 1940\nI know many if not all these letters will be held until I retire or die… But I still feel the need to write to you…\nJulie, from now on, call me “Major General” Patrick Monroe.\nIt’s high time private corporations joined the war effort in a more direct way.\nNot only will Genco technology provide our country with a very needed edge, but it being a private corporation will allow our country to deny participation and responsibility for any action that may seem “wrong” to the international community.\nThis may be a dirty job, but I’m proud to serve.\nI hope to see you soon.",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_42",
			"noteType": "LETTER",
			"contents": "Jan 18, 1945\nI knew that our job was going to be dirty. I knew it was needed. But kidnapping children for experimentation is where I draw the line. After all my protests I was demoted to lieutenant colonel.\nThey called it an “opportunity”. They tried to paint it as something extremely positive: I’d be responsible for commanding the forces that would watch over the scientists doing the experimentation and make sure they treat the “subjects” well… they are monsters… And I’m not talking about the subjects.\nI love you Julie… I hope this letter finds you someday… I’m trying to be a good man.\nLove, Patrick.\n",
			"weight": 5,
			"documentTier": 3
		},
		{
			"id": "$CLUE_43",
			"noteType": "MEMO",
			"contents": "Burn this after you read it.\nIf you truly want to protect the ‘others’, like-minded individuals will meet at midnight near the swamp.\nIf detained, say that you are supposed to give a message to Captain Patrick Monroe.\nBe strong.\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_44",
			"noteType": "MEMO",
			"contents": "You may have heard how I was demoted again, and how my family is under watch due to safety concerns…\nYou may have heard It was due to erratic comments and the spread of ‘lies and misinformation’ on my part.\nAnd yet… You must have heard they didn’t fire me. You may have heard that was because even after all my failings, I’m too big of an asset, or maybe you were told I’m just being taken care of with an office job.\nAll lies. \nThey fear me.\nThey fear us.\nBut most importantly… They fear them and their retaliation…\nIf you are tired of being afraid… Seek us.\nThe Captain.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_45",
			"noteType": "MEMO",
			"contents": "Mar 5, 1941\nCongratulations on your promotion!\nAll the mysticism surrounding the vault is actually… Well-founded.\nJust walk in a straight line toward your workstation and you’ll be fine.\nAs a tip: Try and ignore any screams you hear, and never ask questions to people in hazmat suits.\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_46",
			"noteType": "MEMO",
			"contents": "Aug 10, 1941\nAll subjects are to be kept dormant inside the vault.\nNO EXCEPTIONS.\nIf a subject awakens inside its vat, terminate it. Fire does wonders.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_47",
			"noteType": "LETTER",
			"contents": "Mar 1, 1944\nTo Major General Monroe,\nThe initial exploration of the “hollow mountain” took most of the lives of the soldiers of my platoon.\nDeep inside the cavern systems, we found pale creatures with huge claws and fangs. They appeared to be blind, not responding to our flashlights. They, however, appear to have highly developed senses of smell, hearing and seem to be able to perceive vibrations through the rock.\nThe creatures are extremely agile, strong, and smart. They attacked us using surrounding tactics and understood we depended on our eyes to see them.\nWe managed to capture one.\nYours,\nLieutenant Joseph Connor.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_48",
			"noteType": "MEMO",
			"contents": "Lieutenant Connor was assigned another platoon… After having his wiped…\nThey want us to capture more of those deep creatures. Maybe they plan to use them to make super soldiers? That would explain the orders to transfer war prisoners into the vault.\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_49",
			"noteType": "LETTER",
			"contents": "Jan 18, 1945\nDear Mr Shelby,\nIt’s my pleasure to inform you that we’ve successfully spliced humans with deep creatures.\nNovices here are calling them “The deep ones”. It certainly is a boon to the world they decided to pursue science and not creative writing…\nThe resulting creatures are being sedated and contained in vats while we try and modify their minds using Mutalite; this is essential since they appear to be extremely violent.\nYours,\nDr. Sarah Riley\n",
			"weight": 5,
			"documentTier": 2
		},
		{
			"id": "$CLUE_50",
			"noteType": "LETTER",
			"contents": "Jun 27, 1942\nDear Father,\nNews of your illness took me by surprise.\nFor years, I thought your silence was due to your obsession with work. You telling me it was because you wanted me to live a carefree life is both surprising and appalling.\nYou have provided me with everything any person might ever need or want. If there is even a small chance of me helping you live… Count me in.\nI’ve already made arrangements to reach you.\nLove,\nJohn Shelby the son.\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_51",
			"noteType": "LETTER",
			"contents": "Jun 28, 1942\nDr. Riley,\nMy son is coming soon.\nHe should be a perfect fit for the procedure.\nHis body is young and his mind malleable.\nI have made sure to give him the best accommodations and maintain his mind at ease as you suggested.\nI have also arranged for keys to his place to reach you so you can connect the machines during the night to prepare his mind.\nI will be in touch.\nJohn Shelby senior.\n",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "$CLUE_52",
			"noteType": "LETTER",
			"contents": "Feb 7, 1946\nRespected chief of operations,\nI'm passing to you the information about the employees that are to be processed based on their breaching of nondisclosure agreements, as discussed previously:\n* Mark Faldborg\n* J.D. Emerson\n* Armaan Khan\n* John A. Blue\n* Earnest Williams\n* Shaun Jackson\n* Erik Yuzwa\n* Ramon Manoverde\nThis is in addition to the three subjects discussed in the roundtable (apollo, fish, swim), I hope they have been already checked.",
			"weight": 5,
			"documentTier": 1
		},
		{
			"id": "NOTE_1",
			"noteType": "LETTER",
			"app": "NOTE",
			"contents": "A paper note. It reads: It's never too late to start over.",
			"weight": 5,
			"documentTier": 99
		},
		{
			"id": "NOTE_2",
			"noteType": "LETTER",
			"app": "NOTE",
			"contents": "A paper note. It reads: What might be the end of the story for someone, might just be a bright beginning for others.",
			"weight": 5,
			"documentTier": 99
		},
		{
			"id": "BOOK_SPECIES",
			"noteType": "BOOK",
			"app": "BLUE_BOOK",
			"name": "Book of the Species",
			"description": "A beautifully illustrated thick blue hardcover book",
			"contents": "This book contains the list of the species to be found in the woods, you can use this as a list to try to discover all of them.",
			"weight": 150,
			"documentTier": 99
		},
		{
			"id": "GENCO_MANIFEST",
			"noteType": "LETTER",
			"contents": "The note is heavily damaged by weather, here's what you can make out of it:\n…an underground facility, the \"central\" station, somewhere...\n…the forest, long nights there but I really...\n…my dream of doing something worthwhile...\n…a \"Full Moon\" card, finally acquired, is the only way to unlock...\n\nThere’s more written on the note, but you can’t make out anything else.",
			"weight": 5,
			"documentTier": 99
		},
		{
			"id": "MAP_GUIDE",
			"noteType": "LETTER",
			"contents": "Mark, following your request I'm sending you a map of the research stations within Sector 3 of Genco Emerald Woods campus; the stations are marked with Genco icons, yours is in the middle of the map. Please don't miss it again.",
			"weight": 5,
			"documentTier": 99
		}
	]
}