{"title":"写在蒂尔之书中的又一场悲哀的死亡","date":"2022-04-10T23:56:02.000Z","date_formatted":{"ll":"Apr 10, 2022","L":"04/10/2022","MM-DD":"04-10"},"link":"2022/another_yasd","comments":true,"tags":["AO3","NetHack","同人","翻译"],"updated":"2025-12-02T14:25:46.847Z","content":"<p>原作：Kastaka</p>\n<p>译：Silencess</p>\n<p><strong>作者寄语：</strong></p>\n<p>致soundingsea。</p>\n<p>杰丝敏大步流星地踏上地牢入口氤氲潮气的石阶，身边陪着她的只有她可靠的小猫伊墨儿。她的身侧挂着母亲的佩剑；她的臂上戴着父亲准备的圆盾——那是他为她的旅程从矮人手上买来的。她身上还剩了把餐刀，但所有的光源和生火工具都已经毁在先前一场渡河事故中了。</p>\n<p>地牢的洞穴闪烁着诱人而奇特的光芒。一切都是那么轻而易举。杀死狗头人。杀死壁虎。杀死蝙蝠。搜索暗门。她饥饿地盯着她唯一的口粮——长途跋涉已经几乎让她的补给消耗殆尽了——可她还是改吃了那条壁虎和一种奇奇怪怪、看起来有害的地衣。伊墨儿独自打倒了一头郊狼，因此它毫无争议地享用了它的战利品。</p>\n<p>披甲的地精撩动着她的物欲，但她坚决克制了穿上那件地精盔甲的想法，唯恐那上面其实带有她所听闻的那些肮脏诅咒。她坚实可靠的盾牌尚能做好保护的工作。她也确信，自己更愿意把随意丢弃在地上的青玉戒指（旁边还有一大堆金币——那又是什么情况？）卖个好价钱，而不是冒险戴上它、迎接未知的馈赠或危险。除了这些以外，她还在地牢里听到过守卫的行进声和不知何人的数钱声，尽管在好一番搜寻后，这些声音仍然捉摸不定。</p>\n<p>在她差点刺穿一位霍比特人之前，她还没意识到这一切可能比她以为的更加复杂。她刚刚打开了一扇门，里面是个矮小的人形身影，她举剑就刺……</p>\n<p>“你干嘛呢？”霍比特人说，看起来有些恼怒。</p>\n<p>“噢。”她惊愕地回应，慌忙停下战斗姿态，“呃。抱歉打扰您了，霍比特人先生。”</p>\n<p>“你也确实该觉得抱歉。”那霍比特人抱怨着，“你们这些疯狂的冒险家，总是攥着凶器一路横冲直撞，下到这里来妨碍我们地下民族的正常生意。”</p>\n<p>“啊……”她说，“呃。你听说过岩德护符吗？”</p>\n<p>“哦，你也在做那个该死的愚蠢任务，是不是？”他回道，“又是带着小猫跑到这儿来的，我懂了。很遗憾，我实话跟你说吧小姐，你大概已经活不久了。在这地方我遇到过很多人，绝大多数都带着那种自负和青春的活力东奔西走，他们没一个能走多远的；只有那些回到这里安家立业的人才有希望，丫头。我劝你还是赶紧从地牢里逃出去吧，趁你还有机会。”</p>\n<p>“还有其他人在寻找护符？”她问，简直不敢相信自己的耳朵。</p>\n<p>“哦废话，”霍比特人说，“这种人一大群。不过我怀疑你一个都遇不上。都是独来独往的家伙，从来没见过哪里会同时出现两个。当然，死了的就更少了。”</p>\n<p>她还想问其他问题，但他很不耐烦地打断了她。</p>\n<p>“听着，我真是谢谢你没直接把我戳个窟窿，但我也有自己的生活要对付，明白？”</p>\n<p>“您还能告诉我什么事吗？”她绝望地发问，“任何能帮我完成任务的事都行？”</p>\n<p>“别喝泉水。”他撂下一句话，随后径直转身离开。</p>\n<p>她回想起之前楼层遇到的泉水，心在自责中一点点往下沉。泉水上层尝起来有些污浊，确实，但是第二口水还挺振奋人心的啊。长途跋涉了这么久，她真的需要清澈宜人的流水，需要洗掉嘴里那些尸体的味道。</p>\n<p>那次偶遇之后，她有一段时间几乎感觉自己像个英雄，一路踢开房门，还收集了一大把兽人匕首。但当她遭遇了某种僵尸时，令人眩晕的饥饿终究逼迫她咽下了最后一块口粮。现在地衣和黏液对她的口腹已经无能为力了。她狼吞虎咽地吃下两具丘陵兽人的尸体、差点噎住，随后才意识到自己刚刚把一块巨石推撞在一扇门上（也许是另一块巨石上），没办法把它移开了。她想哭。这会是她胜利进军的终点吗？就只是被岩石卡住，永远不可能完成任务？</p>\n<p>她试着从其他分支下楼，又路过了刚才那位霍比特人，但他只是怜悯地看着她。她幻想着冲上去摇晃他、逼问他从哪里来的食物，甚至做一顿烤霍比特腿来犒劳自己；但她守序的天性在脑海中大喊，于是她只是对他礼貌地点了下头。她烦躁地跳着脚等小猫靠近身边。等伊墨儿终于慢悠悠地晃过来，她立即从楼梯上冲下去，不敢与霍比特人悲哀的眼神对视。</p>\n<p>下面好黑。她摸着墙壁小心翼翼地选着前进的路，有水从很高的地方落在了她的头顶。侏儒们借着影子朝她投掷有害的药水合剂。她咽下它们中的一员，努力不去思考它有多么像人。伊墨儿叼回一串项链，她弯下腰摸了摸这可怜的小家伙。“我希望我有东西能喂你，”她轻叹，“可我没有。我连自己都喂不饱了。我还得背着这么多武器，我都不知道它们会不会有什么用处，也许有些其实只是垃圾。它们快把我压垮了。”</p>\n<p>她看到一个侏儒掉进了陷坑里，但它挡住了她的去路，因此她没办法留它听天由命。吞食尸体现在已经成了日常。她杀死一头小马，把它生吞活剥，模模糊糊地想着也许她本可以拥有一匹战马，要是她手中有一点胡萝卜的话。虽然即使真有胡萝卜也早该在路上被她吃掉了，何况现在还以为一个人能在这种深处保持文明开化的话实在过于好笑。她搞丢了伊墨儿，然后又遇到了一只小野猫，露着满嘴尖牙朝她哈气。有一瞬间她差点把它当成了她那忠诚的伙伴，还以为伊墨儿终于被那一路追踪他们至此的狰狞饥饿彻底野化了。但当她结果了这只小猫之后她又找到了伊墨儿，它看起来瘦骨嶙峋，却比之前还要健康。</p>\n<p>接着便是一场旷世大战，对手是个头超大的老鼠和蝙蝠群。当她终于擦掉眼中的鲜血、喘匀呼吸之后，她发现自己的小猫不再像小猫了，更像是一只独立自主的家猫。可怜的伊墨儿，要成长得这么快才行。</p>\n<p>不久之后，一个矮人穿过了她前进的路线。她对他呼喊，希冀着在这片漆黑的地方找到一个盟友。毕竟，矮人们以对蒂尔的侍奉闻名，不是吗？</p>\n<p>“你好，善良的矮人！”她喊。矮人也转过身来问候她。可令她万分惊恐的是，伊墨儿突然向这位绅士猛扑过去，开始激烈地攻击他，利爪在黑暗中闪着寒光。</p>\n<p>“伊墨儿，不！”她失声高叫，“坏孩子！快回来！”</p>\n<p>但伊墨儿完全没有理会她的呼号，依然极其狂燥顽固地吼叫着，杰丝敏只能无助地退开。她在绝望中误入了一个箭矢陷阱，而她甚至没怎么留意这件事。伊墨儿是被饥饿逼疯了吗，还是说她的猫猫朋友看出那个矮人其实是显而易见的敌人、而不是潜在的盟友了呢？他们俩究竟谁会赢呢？</p>\n<p>至少第二个问题很快就有了答案。伊墨儿从黑暗中窜了出来，志得意满地把那矮人曾经穿着的斗篷丢在杰丝敏脚下。杰丝敏麻木地拾起那件斗篷，走回那片黑暗去寻找矮人的遗体。他的尸体，唉，已经被撕成碎片、完全没用了，但他那双铁鞋还是完好无损的，而且——奇迹中的奇迹——他还带着一把鹤嘴锄。现在她可以回去弥补她的错误了，在之前的冒险中关于岩石的那个错误。</p>\n<p>“你真不应该这么做的，伊墨儿。”她责骂道，但猫猫早已经转头踏入那片黑暗，继续寻找下一个猎物去了。</p>\n<hr>\n<p>文中的绝大多数译名取自小鱼儿行者（SunnyYuer）的NetHack-cn repo（参见<a href=\"https://github.com/SunnyYuer/NetHack-cn%EF%BC%89\" target=\"_blank\">https://github.com/SunnyYuer/NetHack-cn）</a> ，包括标题里的“写在蒂尔之书中”。除了猫猫（猫猫！）。</p>\n<p>感谢原作者Kastaka的授权。很难想象这是一篇关于NetHack的同人，但一切都非常合情合理、真实而残酷。我玩女武神的时候觉得基本是挥舞咖喱棒+银剑一路杀到星界无敌手，能从这样一个角度去重新看待战争的故事，确实也很受触动。有幸翻译，希望大家能喜欢这篇作品。</p>\n<p>继续感谢NetHack群的大家陪伴我飞升xd</p>\n<p>继续感谢Arlene Libitina姐的激励，这篇翻起来非常顺畅！</p>\n<p>特别感谢Facebook人工智能研究所的机器学习专家何恺明老师，是他提出了残差网络让我痛苦不堪因此才来做这个翻译（</p>\n<p>也非常感谢看到这里的你。</p>\n","prev":{"title":"ChatGPT提示的艺术：制作清晰有效咒语","link":"2023/ChatGPT-receipt"},"next":{"title":"“仅仅因为它写着‘READ ME’并不意味着你必须这么做”","link":"2022/just_readme"},"plink":"http://www.ephesus.top/2022/another_yasd/","reward":true,"reading_time":"2517 words in 17 min"}