{"title":"某魔。","date":"2024-06-24T19:24:33.000Z","date_formatted":{"ll":"Jun 24, 2024","L":"06/24/2024","MM-DD":"06-24"},"link":"2024/foocubus","comments":true,"tags":["AO3","NetHack","同人","翻译"],"updated":"2025-12-03T04:39:06.449Z","content":"<p>原作：Tilly</p>\n<p>译：Silencess</p>\n<p><strong>摘要：</strong></p>\n<p>我还以为无性别踢水槽应该会随机召唤一个魅魔/梦魔呢！</p>\n<p><strong>作者寄语：</strong></p>\n<p>这个故事献给单数人称代词&quot;they&quot;，这个经常（不正确地）遭受抨击的中性性别友好代词。</p>\n<p>店主这个周过得不怎么样。那件关于骑士、战马、冲击魔杖和<em>一片狼藉</em> （战马体型很大，如果你不小心打错地方的话容易碎得到处都是；要是它们能像它们的骑士那样穿上盔甲就好收拾多了！）的事故成了压垮Ta的最后一根稻草。因此Ta决定出去散散步，理清思绪，顺便重新考虑一下自己的职业选择问题。</p>\n<p>也许Ta不该踢那个水槽的。生气的时候踢一脚瓷制品能听到舒心的哐啷声，况且Ta开业的第一桶金就是靠卖掉水槽里捡到的戒指换来的。不过在经历了几次裸体事件以后，Ta也知道了这么做会有些其他的偶然后果。</p>\n<p>现在其中一个“后果”拍了拍Ta的肩。</p>\n<p>“呃——咳嗯。”</p>\n<p>店主转过身，完全明白自己刚刚召唤出来一个恶魔（一个大恶魔，虽然Ta无法理解这个“大”是谁定义的，考虑到这一分类下既包括一些Ta让一只手都能轻松打败的家伙，也包括朱比烈斯之类有可爱名字的恐怖异界怪物），还带着一些恶魔应该清洗的盘子。呃，一个盘子，这位恶魔以一种性感而不耐烦的姿势把它拿在左手上。</p>\n<p>“我真没时间搞这个。”店主也不耐烦起来。Ta庆幸自己穿了很多衣服（踢水槽之前连袜子也要穿三层，Ta的父母总是这样说），还带了几根冲击魔杖，因为这些本性难移的……的。店主眨了眨眼睛，一次，又一次，然后晃了晃脑袋。Ta的眼睛还是没看到这位恶魔的关键部位，于是游移开来盯着Ta的脸。和那个盘子。和墙。</p>\n<p>“不好意思。你是魅魔还是梦魔来着？”</p>\n<p>恶魔低头看了看自己，然后以类似的方式眨了眨眼：“废话。不对，看这个情况似乎也不是废话。我好像是个某魔。”</p>\n<p>“那只是地牢手册为了避免使用太多‘魅魔或梦魔’而使用的简称吧。”店主说，“而且话说回来，某魔的对立面应该是什么？”</p>\n<p>“你说呢？”某魔说道，看起来显然很恼火，“要一个不知道该和什么东西做爱的恶魔以性爱为食是不是有点强人所难了。反正这大概都是你的错，你的相关叙事里连一个性别化的代词都没有，却跑过来召唤东西。”</p>\n<p>店主无视了对作者的抨击（Ta知道在故事中这么做对Ta的生命健康有好处），尝试思考：“也许是<span style=\"display: inline-block; position: relative;\"><span style=\"position: absolute; top: -0.7em; left: 0; font-size: 0.4em;\">马赛克</span><span style=\"display: inline-block;\">■</span></span>？你看，某啊，■啊……我觉得■听起来有点菲勒斯暗示，可能意味着你——”</p>\n<p>“只有十二岁小男孩才会这么想，”某魔揉了揉眼睛，把那个Ta有义务清洁的盘子在两手间抛来抛去，不知为何仍然很性感。可能是一种习惯性力量。“在我看来某和■基本就是同一个东西。它们都是占位符变量。”</p>\n<p>“我想你说得对。好了，既然你是个和平的召唤物的话，我得回去理货了。”</p>\n<p>“更像是个<em>无聊</em> 的召唤物。”</p>\n<p>“你想来帮忙吗？”店主问，虽然Ta注意到某魔已经跟着Ta走了，这大概是个毫无意义的问题，“我这些年收集了一些非常奇怪的东西。你可能可以找到一些……呃。好吧，一些至少可能能用来说服其他人去……”</p>\n<p>“哦，那没什么特别的。我认识一位专门收集假阳具的魅魔，从一个冒险者那里拿到过一个大概有这么长的——”说到这里，Ta比划了一个让店主同情得皱紧眉头的长度，“——而且一直声称它增加了自己的魅力。”</p>\n<p>“那增加了吗？”</p>\n<p>“没有。”</p>\n<p>Ta们回来不到三小时（并讲了一大堆店主绝对不会在日常家书中和父母提起的故事）之后，有人踢开了门。每次你尝试张贴“库存清点中，暂停营业”的标志，总会有人闯进来。他们通常都是低级别的冒险者，最后还会给你的库存里添一些物品，所以门也不算白白损失了。</p>\n<p>但这次这个看起来显然很有能力，而且身上显然覆着龙身上的碎片制成的东西。店主有预感，这次的情况可能真是最糟糕的那种。</p>\n<p>“你就没看见我们已经关门了吗？”Ta还是问了一句，并试图看清那个护符是不是反射的。见鬼，它还真是。也许只要Ta蹲下得足——够快……但冒险者发现Ta现在还有个帮手，看起来似乎在犹豫究竟是杀了Ta们拿经验还是做完全不同的事情。</p>\n<p>“话说，你到底是魅魔还是梦魔？”</p>\n<p>某魔从一堆标着“看起来像装甲而且大概不是拟形怪”的物品中抬起头，给了冒险者一个最最不性感的冷冷的眼神。</p>\n<p>“某魔。某。意思是未知。意思是，除非你能解释一下‘某’的对立面到底是什么并给我找个对应的人，否则滚开。”</p>\n<p>冒险者在那站了一会，发出一些类似“嗯”和“呃”的声音，然后试探着问道：“那这……是不是说明我没法在这里提升属性了？”</p>\n<p>“取决于，”某魔说，“你感兴趣的是不是鸡——”</p>\n<p>Ta拿着像是橡皮鸡的东西迅速扇在这位过度武装的冒险者裸露在外的脸上，发出一声轻微的、肉质的耳光声，然后冒险者发出了一声更响的、类似石头碎裂的声音。</p>\n<p>“——蛇尸体。啊哦，看来不是。”</p>\n<p>店主看了看这具正在迅速石化的身体，注意到一些肯定是次元袋的袋子，把心里的“最糟糕”改成“最棒的”。某魔把手上的“前鸡蛇”扔回“不应触碰的东西”堆里（它马上黏在一个巨型拟形怪上了），然后坐在装甲堆的皮甲部分上开始看戏。</p>\n<p>“我觉得，”Ta说，店主开始往Ta那里扔东西，“这位冒险者绝对会想要‘鉴明你的全部物品’的。”</p>\n<hr>\n<p>译者注：原文为foocubus，是NetHack对魅魔（succubus）和梦魔（incubus）的统称。Foo-和bar-都是英语中的占位词，意义相当于中文的“某某”、日文中的○○。</p>\n","prev":{"title":"实用又迷人","link":"2024/practice_and_atmospheric"},"next":{"title":"狄魔高根的补丁(4)","link":"2024/demogorgon_patch_4"},"plink":"http://www.ephesus.top/2024/foocubus/","reward":true,"reading_time":"1761 words in 12 min"}