{"title":"衰退之中","date":"2024-06-27T14:50:29.000Z","date_formatted":{"ll":"Jun 27, 2024","L":"06/27/2024","MM-DD":"06-27"},"link":"2024/in_decline","comments":true,"tags":["AO3","同人","矮人小队","矮人要塞","翻译"],"updated":"2025-12-03T05:03:39.880Z","content":"<p>原作：<a href=\"https://archiveofourown.org/users/heartbeatstumbles/pseuds/heartbeatstumbles\" target=\"_blank\">heartbeatstumbles</a></p>\n<p>译：Silencess</p>\n<p>（矮人小队，第三话。上篇：<a href=\"/2024/lunch_in_the_library/\">图书馆里的午餐</a>）</p>\n<p><strong>摘要：</strong></p>\n<p>正义之浪如今是个宜居的地方，但它只是其昔日辉煌的苍白倒影。</p>\n<p><strong>作者寄语：</strong></p>\n<p>致<a href=\"https://archiveofourown.org/users/Pepperdoken/gifts\" target=\"_blank\">Pepperdoken</a>。</p>\n<p>纵观矮人要塞的历史，我的最爱之一要数我们可以在善良地区找到人鱼，有人发现人鱼的骨头可以卖出天价的那个时候。就像任何一个拥有远大抱负、丧失道德底线的矮人要塞玩家一样，他们立刻到论坛上发帖寻求帮助，寻找建立和运营美人鱼屠杀农场的方法。 (<a href=\"http://www.bay12forums.com/smf/index.php?topic=25967.0\" target=\"_blank\">http://www.bay12forums.com/smf/index.php?topic=25967.0</a>) Toady估计是被论坛上关于是否要繁殖人鱼、如何把人鱼儿童在空气中憋死的帖子吓到了，因此把人鱼骨头的价值改成了0。（多半还有些人保留了自己的人鱼农场，用来出产无价值的装饰品或单纯是挑战自己）。在随后的大规模更新中，拥有“可学习”标签的智慧生物被修改为无法屠宰了。</p>\n<p>美人鱼农场的兴起与消亡非常短暂，但在它还可用的那段时间，我们听到了许多有趣的故事，比如说有人在尝试进行美人鱼屠杀时意外排干了他们的海洋。（<a href=\"https://www.reddit.com/r/dwarffortress/comments/5slesn/the_ocean_is_gone_because_i_wanted_to_catch_some/%EF%BC%89\" target=\"_blank\">https://www.reddit.com/r/dwarffortress/comments/5slesn/the_ocean_is_gone_because_i_wanted_to_catch_some/）</a></p>\n<p>为了纪念矮人要塞历史上这段短暂的时间，我写了这篇同人，用可以自圆其说的原因解释了人鱼农场的消亡。请原谅我可能犯下的错误，因为我自己从来没运营过人鱼农场。我所有的海洋生物群落最终全部化作无休止的洪水，因此我根本没尝试过任何复杂的谋杀计划。我所知晓的一切成功运营海上要塞的知识都来自其他人的游戏和讨论。</p>\n<hr>\n<p>正义之浪如今是个宜居的地方，但它只是其昔日辉煌的苍白倒影。过去海滨机器那令人安心的嗡嗡声已经消失了。水泵已被废弃，操作它们的矮人已经调去了新的岗位：有的人如今在抽取岩浆，其他人则加入了搬运工小队。那些水闸也关上了，永远不再开启。屠夫作坊里堆满了捕猎队带回的鲸鱼尸体。</p>\n<p>奥伯·科佐斯站在闸门前，深吸一口潮湿而咸涩的空气。感官的记忆勾起了关于另一段时光的思绪，如此陌生，令人满怀激情却又心生恐惧。创造力和自动化已经被时代抛在一边，让位给新兴的鱼叉炮。人们声称这是道德对利润的胜利，但整个行业之所以陷于停滞，仅仅是因为矮人的贪婪摧毁了利润罢了。</p>\n<p>第一个发现人鱼骨价值的矮人简直堪比发现了精金。单一枚杰作级的人鱼骨图腾就价值6000☼，这还不包括其他那些骨骼，更不用说那些利润略低但仍有赚头的皮革、以及尸体中提炼出的肥皂。医务室里的肥皂堆积成山，矮人民兵们有些也装备上了人鱼皮制的箭囊和酒袋。遥想当年，王座大厅陈列的图腾数之不尽，彰示着要塞无与伦比的财富。兽人为了掠走其中部分而兵临城下，他们的尸体被抛进汪洋大海。但这与正义浪潮的滔天罪行相比只是最微不足道的一点污染。</p>\n<p>繁荣带来了衰退。这些骨骼只是因其稀有而承载价值，因为从前没有人想过猎杀或畜养美人鱼，直到那一具死尸被冲上岸边。当人鱼们被整族整族捕获或歼灭，当自由人鱼的目击事件从稀有到不可能，当成堆的骨头塞爆了每一间储藏区——只有到那时，世界才会呼喊“够了”。精灵没有向正义之浪宣战，其他文明的国王和女王也没有予他们谴责。兽人人贩子仍然日复一日掠夺他们的孩子，但并没有超出以往的限度。并没有人为此对其实施制裁。除非货源断供，行商们仍会收购他们可怖劳动的产物。只是这劳动成果如今已一文不值。</p>\n<p>奥伯向海天交界之处久久凝望，海水在他面前无尽地延伸。有时候，他几乎可以想象到水花在眼前飞溅，人鱼的尾鳍在太阳下闪着光，但那只是奔逸的思绪唤出的旧日掠影。养殖池中仅剩的美人鱼此前便重获了自由，但他们早已饱受饥饿和疾病的折磨；即使幸运地挺了过来，人鱼们也早就离开了。</p>\n<p>最后，奥伯看够了回忆，转身向要塞主楼走去。他步入城中，对失落的荣耀没有丝毫遗憾。有些事情就应该被遗忘。</p>\n","prev":{"title":"Elin | 北提里斯成神手札","link":"2025/Elin"},"next":{"title":"图书馆里的午餐","link":"2024/lunch_in_the_library"},"plink":"http://www.ephesus.top/2024/in_decline/","reward":true,"reading_time":"1326 words in 9 min"}