{"title":"记一场ToMENet中的死亡","date":"2024-06-19T12:08:26.000Z","date_formatted":{"ll":"Jun 19, 2024","L":"06/19/2024","MM-DD":"06-19"},"author":"H_Hedgehog","link":"2024/BoMENet-arc","comments":true,"tags":["hxh","roguelike","tomenet","实况"],"updated":"2024-06-19T14:28:06.106Z","content":"<p>投稿：H_Hedgehog</p>\n<p><em>注意看，这名玩家叫做刺猬，他目前被困在了一款游戏中，而且仅有三次死亡的机会……</em></p>\n<p>本次涉及到的游戏为ToMENet，不少玩家可能会对其“精神续作”ToME4（马基埃亚尔的传说）较为熟悉，尽管两者最初由同一作者创建，但内部分道扬镳后，它们都有了自己的开发团队，相似之处也只剩下个名字罢了。</p>\n<p>ToMENet最主要，也是最为罕见的特点在于它是多人联机的在线Roguelike，玩家需要下载好客户端并连接至在线服务器以进行游戏；虽然底层框架仍是回合制，但为了多人游戏，回合处理是自动且迅速的，某种意义上已经算即时制游戏了，或许将它的类型归至MMO RPG更合适。</p>\n<p>既然是在线联机，那自然也有一些别的真人玩家，对，整个情况差不多就是著名动漫《刀剑神域》里的SAO事件，不过由于这是我们自己架设的私服，大家互相认识，关系也都比较好，起码不用担心恶意PK和抢夺装备的问题。</p>\n<p><img src=\"files/tomenet/Bree.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>故事背景以J.R.R.的中土世界为基础，游戏中所有城镇与大多数地牢都源自于此，而玩家的最终目标是摧毁堕落之神米尔寇，祂更广为人知的名字叫黑暗之主，魔苟斯（Morgoth）。</p>\n<p>依照传统Roguelike的惯例，字符画面相当简洁抽象，@表示一名玩家，那些方框前的数字表示不同种类的商店入口，+号则表示功能性建筑的大门，像是“马松屋（Mathom-house）”博物馆；在LotR的设定里“马松”是一种夏尔地区的方言，霍比特人用它指代没有用处但又舍不得丢弃的物品，玩家可以通过往马松屋里捐赠些烂得出奇的诅咒装备，或是已被识别的负面道具，让其他未能鉴定的角色过目后避开危险。</p>\n<p>玩家出生的新手村是位于夏尔东部的布理镇（Bree），商店布局大体上继承于各种band系的前辈游戏，交易则需要在对应的类型中进行，没法把冒险中捡来的长枪短剑卖给魔法店，也别指望在药水店里蹲到出售的法术手稿；镇里还有一家酒馆，多半便是著名的跃马客栈，作为大伙的主要碰头区域，如果不担心小毛贼的话可以跟同伴一起存些常用的探险物资于此。</p>\n<p><img src=\"files/tomenet/inn.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>角色创建方面自由度相当之高，除了老掉牙的龙裔、高等精灵、霍比特人之类，甚至还能选择恩特（Ent）和迈雅（Maia）这些十分具有特色的种族，虽然靠后稀有的种族通常更加强力，但对应的代价也更为沉重；以迈雅为例，他们拥有卓越的初始属性和红外视觉，能够感应善良与邪恶生物，看穿隐形并存在隐匿加成，永远从商店中享受最佳优惠，不需要世俗食物维持生命；50级后还将获得漂浮能力、霜电光环、AC加成以及绝大多数抗性等等，更为重要的除了迈雅以外没有人能够使用星界法术。</p>\n<p>代价则是高达400%的经验惩罚，其他种族可能三四十级了迈雅还在二十多级晃悠，此前还必须完成一项试炼，杀死黑暗仆从以选择开悟，或者杀死持烛者（Candlebearer）踏上腐败之路，但消灭两者或未能击杀任何一方都将导致无处容身，角色会在抵达二十级时被直接抹杀；除此之外，能使用星界法术几乎让迈雅与法系职业绑定，可升级缓慢无法快速点出各学派的强力技能，而没有魔法盾的法师又极为脆弱，前中期死亡率极高。</p>\n<p><img src=\"files/tomenet/create_pc.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>至于职业我曾在上个角色玩过一阵子Mimic（模仿者），算是作为“封测组”的经验吧，该职业允许玩家变成他们杀死过的敌人，且能使用对应形态的所有技能，比如变成寒冰巨魔获得力量补正以增加BpR（每回合近战攻击次数）且免疫冰霜伤害，变成红龙使用火焰吐息和飞行能力，智力足够甚至可以在变形后随意使用法师类敌人的魔法，还无需法典。</p>\n<p>麻烦的地方在于不是所有怪物都具有人形肢体，玩家变形后很容易损失装备槽，毕竟你没法指望一条蠕虫什么的能穿戴盔甲并挥舞长剑；另外模仿者需要杀死足够的敌人才能学习对应形态，具体数量等同于对方等级，特殊boss与精英怪无法被模仿，这意味着能变形的目标都必然比当前角色弱，实在是有些鸡肋。</p>\n<p>哦，还有一件事，千万别在陆地上变形成大白鲨之类的海洋生物，否则就会和某个倒霉的德鲁伊一样，没人想把变成鱼干的同伴抬到神庙去复活。</p>\n<p><img src=\"files/tomenet/dryfish.jpg\" alt=\"当事人健在\" loading=\"lazy\" class=\"φbp\"></p>\n<p>一番苦思冥想，为了生存能力我还是按惯例车了一只平平无奇的矮子战士，坚韧但行动略为缓慢，免疫失明，在挖掘和使用斧头上存在加成；考虑到后来的主要工作是叮叮当当地凿石头，或许叫矮人矿工更为准确。</p>\n<p>角色创建完就被扔到了酒馆里，身上揣着几百金币和些最为简陋的装备，可惜不会有古怪巫师来你家门口做奇怪的记号，还硬要拉着你踏上冒险之旅，因为玩家压根就是个买不起房的穷鬼；沿着林间小道离开镇上，周边一带几乎全是房区，除了西面不知道为什么有座该死的火山，开荒时期无数萌新曾误入并被烫死在了里面。</p>\n<p><img src=\"files/tomenet/volcano_house.png\" alt=\"配图其实是白城旁边的房子\" loading=\"lazy\" class=\"φbp\"></p>\n<p>房产的平均价格并非让人望而却步，十余格的小房子只需要几万金币就能置办下来，初期玩家咬咬牙也能负担得起，然而房屋的主要作用仅是储存物品，以阻止内部掉落物被系统刷新后消失，是否要将宝贵的积蓄投入到这上面而不是用来提升实力，相当值得斟酌。</p>\n<p>得益于中洲优秀的社会福利制度，每片房区中都有免费供所有人使用的公共房间，通常还比那些廉价的小房子大，再次凸显了购房的华而不实；不过它们的访问权限不可更改，储存贵重物品的安全性得不到保障，也无法被设置成玩家店铺用于摆摊，就只有全员都是熟人的情况下能大大咧咧地当作仓库用了。</p>\n<p>在酒馆爆满后我们往这些公房里扔了许多暂时用不上，又不舍得卖的珍贵马松，介于里面总是乱糟糟的一团，大伙后来干脆形象地将其简称为了“公厕”。</p>\n<p><img src=\"files/tomenet/toilet.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>既然已经出门转了一圈，那说不定已经有牺牲者掉湖里或者火山熔岩里了，脆皮法师可能在街上挂个机都会被小混混袭击致死，眼下不得不面对本游戏最为严峻的问题——<strong>永久死亡</strong>。</p>\n<p>正常模式下一名角色只有三次灵体出窍的机会，且没有任何手段增加，人物生命值归零后会掉落身上携带的物品，变成没有形体但是能够穿墙的鬼魂，此时可以选择放弃所有装备飘到神庙复活，也可以选择在原地等待他人救援；需要注意，一旦鬼魂再被杀死，下场将与三次复活机会用完的情况一样：<strong>永远的从这个世界上消逝</strong>，虽然屏幕前的玩家不会被烧毁大脑，但将失去至今积攒的一切，无论是苦练的等级，还是精挑细选的武器盔甲，乃至名下的财富和房产，全部都将在死亡后化作虚无。</p>\n<p>纵使允许再建角色重新开始，服务器后来也被他们改成了99命，但死亡应当有其本身的意义，所以我决定玩完最后的这名3命角色就结束这款游戏。</p>\n<p><img src=\"files/tomenet/rip.png\" alt=\"茅场晶彦竟是我自己\" loading=\"lazy\" class=\"φbp\"></p>\n<p>前往真正的地城之前，通常都建议先去镇子外面的训练塔先提升一下等级，在训练塔中生命值归零不会死亡，而是被治疗好再踢出塔楼，代价为损失部分经验和金币；尽管安全，但训练塔一共只有三层，最强的敌人无非是农夫马戈特（幼年弗罗多经常去他田里偷蘑菇）养的几条大狗，稍微升两级经验就不够看了，龟缩其中也不是长久之计。</p>\n<p>古冢岗（Barrow-downs）是离布理镇最近的地下区域，虽然叫这名字，但里面以普通敌人为主，浅层见不到什么妖魔鬼怪，是多数玩家的初期探索地点；所处深度以英尺表示，每下去一层会降低50ft，而该区域的最终boss尸妖王（Wight-King）则在-1750ft守候。</p>\n<p>出发时记得检查是否买好了口粮，火把和灯油有没有备齐，有闲钱最好携带一些保命措施，比如瞬移卷轴和轻伤药水；探索过程倒没有什么好提的，对于近战职业而言，由于即时进行的自动战斗，整个操作还被简化了不少，但对于需要手动施法的各种术士来说，就相当考验手速……以及网络延迟。</p>\n<p>没错，这毕竟还是款在线网游，网络问题是永远绕不开的一道坎，遇上传输波动轻则卡顿，重则断线失联；某些惊险时刻反应过来后，哪怕慢上一次按键输入都有可能导致生命危险，要是掉线再等人登录回来，角色早就一命归西了。</p>\n<p><img src=\"files/tomenet/lag.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>也是band系的传统设定，ToMENet采用了刷新式地城，已存在的楼层如果没有玩家就会自动消失，再有人进入则重新生成，这样保证了同一地点就算被反复探索，也一直能有怪物和宝藏可供掠夺；不过玩家的鬼魂无法捡起物品，一旦离开死亡地点，掉落的装备和财物将全部消失，高等级角色陨落倒是会让那层暂不刷新，问题在于复活后不光等级降低，还只能使用备用装备，想在时限内报仇并取回遗物相当困难。</p>\n<p>绝大多数时候摇人帮忙是更为可靠的办法，我们将其称为“创伤小组”，主要任务便是替人收尸，标准救援流程为带张复活卷轴下去，杀光全部敌人清场，再把死者从阴间拽回来；万一预算不够或者情况紧急，没法复活鬼魂就帮人收拾些最为值钱的物品背到地表，但危险程度要是过于离谱，那么创伤小组也无能为力，因为救助人员很可能折在半路上。</p>\n<p>在我正式决定开始permadeath前，有过两次印象深刻的团灭经历，一次是我被奇形怪状的法师爆杀后，言静姐姐跑来帮我捡尸，那时大伙貌似都比较穷，还用不起返程卷轴，只能一层层走回去，结果在倒数第二层不知怎么的碰到一大群杂种兽人（Snaga），虽然我靠灵体穿墙提前发现并给出了预警，但最终没起到什么作用，也许是盔甲太沉，静姐的法师背不动，总之牺牲人数+1。</p>\n<p>随后赶来的ham干脆利落地解决了那群杂碎，刚嘲讽完对面，没想到还有个精英怪，转眼间被反杀，牺牲人数再+1，这个故事告诉我们，在确定周围绝对安全之前，千万别放松警惕去打字聊天或者截图留念；后面又陆陆续续地来了几位群友，但除了一只没找到路的翡翠鸟幸存，其他顺利抵达现场的创伤小组全员覆没。</p>\n<p><img src=\"files/tomenet/cant_beat_me.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/alldown.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>另外一次团灭是在古冢岗的-300ft，有几位组团下去的群友感受到了special feeling，该信息通常表示本层存在精英怪携带神器；事发之初我并不在场，不过根据复盘来看他们应该是发现了宝库（vault），这是种特殊的建筑结构，里面一般会有不少怪物和好东西，chacha阅读了侦测卷轴，他们肯定被其中的财富所诱惑，然后凿开了宝库墙壁，也同时打开了通向死亡的大门。</p>\n<p>后来发生了什么没有详细记载，只知道包括创伤小组在内，没有任何活人返回地面，尸体的死状都惨不忍睹，未能成功回收哪怕一件遗物；经统计，本次一共五名成员阵亡，作为事故元凶的那件神器披风，不光因为等级要求无法捡起以查看具体信息，还让我们倒贴了另外一件宝物，真是好奇心害死猹。</p>\n<p><img src=\"files/tomenet/cant_pick.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/5down.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>已经提到了就解释下神器（Artifact）的定义，简单来讲是一类非常强大的装备，通常独一无二有自己的名称，不过并非专指跟神明或神话故事有关的东西，只要足够强，来源是什么都无所谓；ToMENet的神器分为两种，一种由高级词条叠加后随机生成，比如混沌之锤，防御者板甲，还有一种是开发团队根据LotR世界观预先设计的真神器（true-artifact），像是统御众戒的至尊戒。</p>\n<p>它们的词条和各项加成都碾压同级的good和excellent装备，但两者的主要区别在于同一真神器只能存在一件，而随机神器理论上能同时随机出两件相同或差不多的，虽然概率多半比买彩票中头奖还小；举个例子，假如有人得到了安督利尔，那么在这把剑消失之前，其他人不管刷怪开宝库有多么卖力，都不可能掉出第二把圣剑。</p>\n<p>好坏参半的是，无论真神器还是随机神器，都会<strong>过期</strong>，每件神器的大致使用期限为现实中的三十多天，就算物主没有死外面或者把东西卖给系统商人，时间一到神器也会自己消失得无影无踪；算是防止高阶装备通货膨胀，以及有效阻止囤积的手段，不过角色死亡速度通常比装备过期速度快就是了。</p>\n<p>顺带一提，游戏里真有彩票卷轴，极小概率读完后暴富，我们开出过最高的是六等奖500金币，没中奖就只有一张吐舌头的废纸:-P</p>\n<p><img src=\"files/tomenet/the_ring.png\" alt=\"My Precious！\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/lottery_scroll.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>刚进入地城寻宝的那些日子，大家基本上都是有啥捡啥，再多再烂的垃圾也要统统扛回镇里卖掉，白板装备只能卖个几十金币，基础伤害稍微好点的重型武器也常常只能卖个两百出头；药水和卷轴还好说，即便不认得，卖给商店一次就能自动识别并在下次遇到时认出，但其他物品需要鉴定，要么找法师队友蹭鉴定术，要么得去购买一次性的卷轴或者昂贵的鉴定法杖，这让本就不多的收入更是大打折扣。</p>\n<p>法师要攒钱买各种法术手稿，战士也得凑齐自己的重甲，这些东西动辄上千金币，还没算强化费用，那时候为了节俭，走夜路连油灯都舍不得买，举着个廉价火把满地牢找灯捡；但当我们在店门口蹲97一张的打折卷轴时，翡翠鸟捡到了一双靴子，尽管不属于神器，这双靴子却能够卖出足足12330金币的高价。</p>\n<p>12k，也就是一万多金币，该数额在前期足够武装出三四名重装战士，或者让法师学会好几种新法术，再添点存款甚至能买栋小房子；这对纠结于吃生命体征维持餐还是买食物口粮更省钱的我们来说，完全是跨越阶级的一记重击，持靴人翡翠鸟瞬间成为中洲首富，俯视芸芸众生，仿佛成了天上的皇帝XD</p>\n<p><img src=\"files/tomenet/10k_boot.png\" alt=\"My Precious！\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/bootchat.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>当事人后来并没有把靴子卖掉，因为它不但提供毒素抗性还能让使用者完全免疫麻痹，这些都是相当实用且不常见的词条，另外不知道是不是果蝠身体的特质，这靴子还为吸血鬼翡翠鸟增加了巨额AC（盔甲等级，可视作物理防御值，在本游戏中数值越高越好）。</p>\n<p>果蝠身体是开局可选择的特质之一，角色将无法使用任何武器，但是近战攻击能够造成hp吸收的效果，自带飞行能力并获得大量移速加成，专门查了一下发现果蝠不能穿鞋子和手套，那可能是人形+武术等技能给予轻甲的AC加成；虽然听起来很适合搭配吸血鬼种族使用，然而吸血鬼可以在20级时主动变成缺点更少的蝙蝠，实际略为吃亏。</p>\n<p>吸血鬼自然是惧怕阳光和神圣，擅长黑暗系魔法，能够夜视并抵抗邪术，食物方面虽然不用吸血，但必须靠不断击杀活物来维持自身存在；十分有趣的一点在于吸血鬼和地狱骑士无视多数负面词条，作为死者显然不会受到幽魂装备的生命汲取，甚至还能<strong>逆转</strong>一些Heavily cursed的诅咒装备，从而让其成为正面效果，考虑到吸血鬼免疫黑息，他们甚至能毫无顾虑的使用魔古尔（Morgul）的戒灵武器。</p>\n<p>理论上吸血鬼暴露在日光之下就会被烧成渣，但是我们在这里隆重介绍一款产品：ToMENet裹尸布™，有了它，您可以享受到360°全方位无死角防护，保护脆弱的肌肤不受烈日侵害，最先进的自适应缠绕功能保证无论是人形生物还是娇小果蝠都能完美贴合，丝毫不影响您迅捷灵巧的动作，还在犹豫什么？立刻前往最近的神庙或者黑市订购吧，只要您的长相没有恶心到店主（堕落迈雅也可以用自己的古神之姿把老板吓到给你折扣），不到1000金币即可拿下这条破布！</p>\n<p>下面请欣赏非常好笑的吸血鬼笑话一则👇</p>\n<p><img src=\"files/tomenet/bat.png\" alt=\"吸血鬼的鬼\" loading=\"lazy\" class=\"φbp\"></p>\n<p>新裹尸布用上的比预料中快，除了埋头往地底钻，自然也有人对广阔的中土世界感兴趣，最早是冒险者ham穿越森林希望绕西面的火山一圈再回来，没想到在离镇子一步之遥的山边被巨人敲了一闷棍，当场死亡。</p>\n<p>而在后来，可怜的翡翠鸟希望一路向西南方向飞行，穿过海洋以抵达坐标原点，起初顺顺利利还能在水面上捕鱼玩，结果飞到半路被巨型乌贼喷射的酸液融化成了渣，渔夫秒变落汤蝙蝠，还好附近有座孤岛，灵魂龟缩在岛中央避免了魂飞魄散的下场；ham的新果蝠角色飞去营救，结果刚到目标地点就被两口喷死，但这次不是因为酸液，而是乌贼释放了强劲闪电，一发伤害高达175，作为参考，我这样一名health点满的二十几级重装战士也才400出头的血量。</p>\n<p>巨型乌贼的这几口酸电喷吐根本不是我们这个阶段能硬抗的，如果假设ham受到的伤害经过抗性减免，那原先的数据只会更加离谱；我当时由于没有飞行能力，仅能在后方帮忙跑腿买个裹尸布，移动时猛冲过头给翡翠鸟从屋檐下挤出来差点被阳光烧成灰，罪过罪过。</p>\n<p><img src=\"files/tomenet/poor_halcyon.png\" alt=\"潮湿的远征\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/poor_ham.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>俩果蝠复活之后觉得忍一时越想越气，退一步越想越亏，收拾了点新的“陪葬品”又重新上路要再找大鱿鱼一决高下，结果显而易见，复活后临时准备的道具根本不是对手，两只果蝠彻底葬身大海，再也没回来；装备太烂是一方面，最大的问题在于敌人等级太高，巨型乌贼整整41级，生命骰150d10，吐息计算为hp/3，那么预期伤害在250左右，非常纯粹的数值碾压。</p>\n<p>十来级的果蝠这么干，完全是电子虫找通关战争（能把Nethack杀穿的狠角色）打架，言静姐姐：“战争上限才30级”。</p>\n<p><img src=\"files/tomenet/loan.png\" alt=\"灾年来了还得找吸血鬼贷款\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/die_twice.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>外面的世界很危险，但我从开始permadeath起就十分谨慎，显示深度的数字会用颜色表明当前区域的经验倍率，白色是正常，黄色是降低，灰色则是怪物等级太低无法获取任何经验，某种意义上也可以当作危险指示器来使用；我主要在白色与黄色区域的交界处进行采矿作业，下楼时感受到special feeling尚可找楼层头目放手一搏，但如果是challenge或者dangerous around那就只有立马离开保命。</p>\n<p>某些极为罕见的特殊装备可以显示隐藏的矿脉，但考虑到宝物侦测卷轴才二十多金币一张，探矿成本几乎能忽略，反倒得注意ToMENet中的卷轴都相当沉，背多了很容易超重，一张卷轴足有半磅，疑似高档羊皮纸配了卷轴筒；挖矿，或者说挖金币的核心要点在于叠加倍率，隐藏矿脉比裸露矿脉更值钱，每十级digging技能都有机会产生额外的金币掉落，而运气属性可以增加掉落金币的数额，最后也是最重要一点，深度越危险，矿物就越值钱。</p>\n<p>挖掘速度是次要的，但能够大为节省时间，这方面主要取决于工具，镐头铲子什么的本质上算武器的一种，伤害和命中的强化等级都将影响挖掘速度，其次是物品重量，重型挖掘道具的效率自然比小铁锹强（感谢chacha送的pick of digging）。</p>\n<p>相较于找boss杀再捡宝贝去卖，挖矿的安全系数要高很多，毕竟活着才是最重要的，具体收入也不会落后太远，中期一镐下去爆四五千都是很稀松平常的事，另外金币不占背包空间和负重，跟再背些装备回去补贴家用并不冲突。</p>\n<p><img src=\"files/tomenet/digdig.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>高贵的符文法师甚至挖岩石墙都有小概率得到符文，除了施法自用以外，这东西的售价接近10k一枚，相当值钱；玩家也可能碰到些奇怪的大块金属和零部件，我曾经在古冢岗挖出过大块的铜（超级沉），后来又在魔多挖出过机械腿，这些东西可以制作某种十分有趣的造物——魔像。</p>\n<p>构造一尊魔像需要一块大型特殊材料，两条机械腿，几张命令卷轴和魔像创造卷轴，魔像胳膊是可选的，最多允许添加四条，但不加的话魔像无法攻击敌人；另外还可以在物品上刻写{@G}，让它们融入材料，并根据适合的词条为魔像提供特质。</p>\n<p>魔像的强度主要取决于材料类型，最高级的精金魔像足有210点AC，10d150的生命骰，基础伤害将和胳膊的强化等级相乘再算得实际输出，总之也低不到哪去；所需卷轴很容易在黑市买到，但大块材料与四肢就很难获取了，我个人要求不高，只想要个硅胶魔像放家里自用罢了（并不存在）。</p>\n<p><img src=\"files/tomenet/silicone.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>回顾了一下初期冒险，最为惨重的经济损失跟咕噜有关，事情发生于果蝠惨案前，翡翠鸟捡到靴子的不久后；咕噜，原名Smeagol，正是跟巴金斯玩猜谜游戏顺便送至尊戒的那位，在本游戏中以精英怪的形式出现，尽管能将障碍物视若无物，它倒没有清空我的钱包顺便再偷几件装备走，事实恰恰相反，刚从树丛中现身就被我几斧头当场砍死，掉落了一枚戒指和一条非常不起眼的长鞭。</p>\n<p>小心翼翼地收好戒指，返程路上大家都在猜测它会不会是至尊魔戒，我一边鬼叫着“my precious!”一边处理着包中的其他垃圾，顺手把那条没鉴定的长鞭以20金币的价格卖了，下一秒我在商店里看到了它后面跟着的一长串售价，足足五位数，53k，五万三千金币。</p>\n<p>时间在那一瞬间仿佛停止了流逝，我整个人呆若木鸡，周围的一切事物都变得陌生遥远起来，我口干舌燥汗流浃背，心脏几乎停拍，反反复复数着那个数字，希望是太缺钱导致自己眼花，可不容争辩的事实如山一般压得让人喘不过气，沉默良久，认清现实的我当场发出了尖锐的爆鸣：</p>\n<p>五万三千金币的鞭子啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊啊————</p>\n<p><img src=\"files/tomenet/whip.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>我成功刷新了chacha以20金币卖出保护披风的记录，荣登中洲第一大冤种的宝座，彻底失心疯了，自那以后逢人就傻笑着问对方有没有见过自己53k的鞭子；至于那枚戒指，不过是个很常见也很便宜的潜行戒指而已，给隐身饰品提鞋都不配。</p>\n<p>出售后显示的物品真名为Chaotic Whip of the Thunderlords，混沌的雷霆主宰之鞭，并且使用等级高达29级；当时我由于红温太久，被店主踢出店导致没有截到详细的物品描述，找了张群友的后期装备截图作为代替，但图中的雷霆主宰匕首只要求17级，还少了一项Chaotic前缀，该前缀通常能提供chaos和confusion的抗性，跟这比起来那条鞭子约莫着只好不坏。</p>\n<p><img src=\"files/tomenet/example_dagger.jpg\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>最惨重的损失回忆完了，接下来自然该提一下赚得盆满钵满的那趟，当时我只打算非常普通的回地下挖挖矿，选择的层数并不深，应该在750ft左右，意想不到的是刚返程完毕就收到了special feeling的提示，然而没等我评估风险，一名boss从旁边直接突我脸上了，好像还带着个精英跟班。</p>\n<p>结果我赢得莫名其妙，因为boss罗宾汉（Robin Hood）是弓箭手，贴脸冲上来跟重装战士肉搏完全是嫌死得不够快，射箭和放置陷阱等技能统统没有见到，三两下被我砍翻了，另外那只叫Borshin的精英怪好像是坨血肉混合物，也就多撑了几回合，之后当场变成了肉酱，想细细地给它切成臊子都没机会。</p>\n<p>罗宾汉掉了把长弓，后来经鉴定是一件真神器，名为巴德之弓，对，就是长湖镇那位射杀史矛革的河谷之王，真好奇汉丁顿伯爵怎么会有他的长弓；虽然我非常缺少远程攻击手段，也很想用这把对龙宝具射爆那群喜欢瞬移的魔法师，但身上的重甲严重影响射击精度，而且职业与种族让这名角色的箭术潜力极其之差，甚至还不如丢回旋镖有天赋，它并不适合由我使用，考虑到队里当时也没射手，最终还是打算将其卖掉。</p>\n<p>要是装备上的话倒能增加些敏捷和幸运，另外还能让使用者免疫麻痹，可当时我已经有麻痹免疫的防具了，敏捷对战士的重要程度也没那么高，而幸运？加上两点的回报可能还不如卖了弓的零头，尽管委托了魅力点得比较高的静姐帮忙，但这把弓的拾取等级太高，其他人没一个能捡起来；最终我这名魅力10的矮子，在戴上了一件CHR +3的护符后，将巴德之弓卖出了近90k金币的售价，托它的福，我才发现店主会随机更换并且带有种族歧视，同族之间的优惠程度是最高的，如果两族关系不好，玩家的回收金额会被大幅克扣。</p>\n<p>没想到的是精灵和矮人的关系还挺好，精灵给出的报价比人类都要高出四千多金币，或许这是第一纪元吧，矮人还没杀害辛葛抢走带有宝钻的项链。</p>\n<p><img src=\"files/tomenet/richbow.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/dungeon_sell.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>随着不断深入，宝藏增多的同时，怪物也在变得更加致命，各种攻击手段层出不穷，毒素、麻痹、失明、混乱、恐惧、幻觉等等，还有各式各样的元素和魔法伤害，此时抗性（Resistance）就成了很重要的一类保命属性。</p>\n<p>最为头疼的是法师玩家们，他们的法典很容易很容易被火焰烧毁，同时非常怕水怕酸，独特的心灵工匠（Mindcrafter）倒是不用纸质法典，但他们的法术晶体受到电击也会损坏，而失去施法媒介的法师无异于待宰羔羊，另外高阶魔法非常昂贵，已添加的手稿不能从法典上撕下来，万一整本书被烧了那大致等于倾家荡产。</p>\n<p>元素伤害在拥有抗性后变为1/3，拥有双重抗性则会变为1/9，但物品仍然有概率被元素摧毁，装备与装备之间的抗性不能叠加，双重抗性通常需要饮用药水或者激活某些特殊道具，但这些效果大多只是暂时的，还可能遇上消耗品用完和道具失窃的情况；想要稳定持久且保护物品不被破坏，那就必须获得对应元素的免疫（Immune），最简单的方法是变形成有免疫特质的怪物，比如骷髅和僵尸免疫剧毒，地狱猎犬免疫火焰之类的，不具备相关能力的角色可以找模仿者为其制作变形戒指，当然，防具能带有极为罕见的免疫词条自然是最好的。</p>\n<p><img src=\"files/tomenet/dmg_book.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/fool_wiz.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>在缺乏免疫和抗性的情况下自救也是一门学问，致命伤治疗药水能够治愈混乱、失明、以及大多数割伤，似乎还能够缓解短暂眩晕但无法解除麻痹，也许是因为不可行动状态下没办法喝药，十分合理。</p>\n<p>中毒与麻痹是萌新冒险者的主要死因，如果不幸被毒虫咬伤或者触发了涂有毒液的陷阱，那么需要服下化解毒素药水或者精灵口粮兰巴斯，不知道精灵是改进了配方还是在里面下了药，ToMENet中的兰巴斯ProMaxUltraPlus版能够解除非常多状态，祛除疾病、中毒、以及幻觉统统不在话下，当然也能消除饥饿，但这东西带有圣洁属性，对吸血鬼等种族来说跟生吞火炭没啥区别。</p>\n<p>在备齐基础抗性的中期，主要威胁来自混乱与幻觉，混乱将让角色失去控制，表现为分不清移动方向并朝空气胡乱攻击，导致单方面疯狂挨打，雪上加霜的是混乱状态下不可阅读卷轴，这将让角色失去传送或回城的能力，很容易被活活揍死而毫无逃跑机会；虽然治疗药水可以解除混乱，但请保证之后能立即脱身，否则可能像某个忘记携带节育卷轴的冒险者，刚喝完药又混乱，被几百条繁殖出虫子硬控到死。</p>\n<p>幻觉的致命性稍低一些，视野中的所有生物会不断变幻外形，从鼠人到戒灵，从泰坦到青蛙，一切都在闪烁扭曲，幸好外观是虚假的，不会改变怪物本体仍然是坨几刀就死的致幻地衣，问题是你也有可能把巨龙看成蠕虫而忽略，把队友看成水怪然后一发火球术给人炸上天；幻觉的持续时间非常长，而且抗性和善后手段极难获得，我几乎就没见过抵抗幻觉的装备，不像隔壁混乱，只要花几万就能轻松买到抗性戒指，再加几万还能买到同时抵抗chaos和混乱的戒指。</p>\n<p><img src=\"files/tomenet/resistance.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>兰巴斯虽然能消除幻觉，但它难以获取，普通商店没有这种精灵食物出售，想要批发估摸着得前往精灵国度，神秘的罗斯洛立安；除此之外也存在一些代替方案，比如让牧师给中幻觉的队友来发祷告，又或者吃上一朵神奇的蘑菇。</p>\n<p>蘑菇大体上是把双刃剑，没有鉴定的情况下乱吃可能会中毒失明，但如果能分辨好坏，那么它可以被视作重量和药效都轻一些的药水；有一种Cure Paranoia的蘑菇可以治愈恐惧和幻觉，还有种叫做Unmagic的蘑菇会移除一切现有状态，尽管是万能药但它也将同时消除正面增益，类似于完全净化自身。</p>\n<p>城镇附近的田里说不定会有蘑菇能摘，地城里也不时能采到一些野生蘑菇，但更为稳妥的方案是寻找随机在特殊楼层中出现的蘑菇商店，等待货物刷新顺便托队友送点钱就能轻松购入大量所需品种；比较有意思的是致幻菇，虽然会引起幻觉，但它也能回复一定的魔法值，这可比几千金币一瓶的魔力药水便宜太多了，大啖蘑菇几十朵，饭后再来口解除幻觉，完美（然而会扣珍贵的理智）。</p>\n<p><img src=\"files/tomenet/mushroom.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>被某些敌人或法术击中将损失经验和能力值，主要威胁在于战斗时的猝不及防，好在玩家不会永久失去它们，可以去神庙处蹲出售的对应药剂，大约几百金币一瓶，经验掉了就喝等级恢复药水，STR掉了就喝力量恢复药水，诸如此类。</p>\n<p>部分像是那兹古尔（Nazgul）之类的高阶不死者，能够腐朽玩家的非神器级近战武器，另外要是没有Slay Undead or Evil的词条，那将无法对其造成任何伤害；最为恐怖的一点是它们能让角色感染“黑息”，这是一种缓慢消耗经验和属性值的负面状态，它不光无法随时间流逝而自然消散，还会在玩家间互相传染，持续蔓延，必须服用罕见的Sprig of Athelas（阿塞拉斯的嫩枝）才能治疗，刚铎人们将其称之为王叶草，正是阿拉贡拿去救人的那种。</p>\n<p>曾遇到过一次非常惊险的情况，当时好像是带着两位群友的新号下去练级，德鲁伊靠毒雾攻击，结果遇上了一大群无视毒素的不死族，当事人冲上去就是揍，结果被一顿乱啃，撤回来之后还感染了疾病，我和另外一名法师清完敌人只能眼睁睁的看着他血量狂掉，想丢药但来不及，好在后面剩一丝血苟住了。</p>\n<p>德鲁伊恢复完刚上楼梯，法师和我在水边又遇到了一大群魔鬼鱼还是什么来着，远距离疯狂吸收经验，并且给我们叠上了混乱和幻觉，场面一度十分惊险，幸亏没有非常强大的高伤害怪物在附近，我们有足够的时间处理并后撤，最终成功相继返回了地表，一看经验条，被活生生从16级吸到了7级。</p>\n<p><img src=\"files/tomenet/drive_booze.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>后期还有更多更恶心的攻击类型，像是Chaos，Nether，Plasma，Life Drain，Disenchantment……以及Nexus，这玩意轻则将人驱逐出地城，背包里塞满垃圾，重则永久交换玩家的两种属性值，战士当场虚弱，法师当场降智，唯一的解决办法只有再去挨打尝试换回来。</p>\n<p>随后的一次冒险就没那么好运了，德鲁伊离队休整，我和言静姐姐准备再返古冢岗，倒也怪我，忘记解释清不要直接返回，否则没有退路非常容易陷入危险；可打完字扭头回来人已经直接阅读了返程卷轴，在地城上方这样会做会直接前往曾经抵达过的最深层，想要回到指定层数必须在卷轴上刻写{@R}，然后使用/rec指令。</p>\n<p>我赶忙查看玩家信息，指定层数阅读了卷轴，接着暗暗祈祷能在意外之前赶上并且传送位置不要相距太远，不过愿望只实现了一半，我抵达时确实在静姐的法师附近，但她已经被一名帕拉丁残忍咒杀，更让人如坠冰窟的是，通知栏中紧接着弹出了鬼魂被杀的消息，这意味着不可复活的彻底死亡。</p>\n<p>本来灵体出窍后可以立马疯狂上楼逃命，但是显然也会让原先那层被刷新掉，所以静姐为了保护装备并未离开本层，结果碰上了同样能穿墙的幽灵战士，不幸牺牲。</p>\n<p><img src=\"files/tomenet/sad.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>解决那名帕拉丁只需要几斧头，但生命在指尖逝去的绝望与无能为力却是久久不能忘怀的。</p>\n<p>Vault：“nice night, expect for the ending”</p>\n<p>Hedgehog: “got the staff?”</p>\n<p>Vault: “is beginner’s kit too, no need”</p>\n<p>Vault: “id call it a day, won’t play it till all exams done”</p>\n<p>Hedgehog: “hope cya, but i may die before（”</p>\n<p><img src=\"files/tomenet/cya.png\" alt=\"Will we see the sun tomorrow?\" loading=\"lazy\" class=\"φbp\"></p>\n<p>死亡flag立完了，这种凄美的月下道别，感觉我不死上个几次都对不起剧情发展，但当天悲伤过度的我并没有再次返回深处，之后更是将谨慎与稳妥作为了探索的第一准则，仔细地管理着身上的所有保命道具。</p>\n<p>创伤小组那边依旧业务繁忙，从拯救大兵ham发现自己忘记带灯，再到全员出动前往-1350ft勇战三头恶龙，这应该是规模最大的一次行动，所有冒险者几乎倾巢而出，前仆后继地空降填线，最终以折损数名30级中坚玩家为代价，惨痛地取得了胜利；我也在现场，可惜是负责事后打扫战场的那批人，错过了见证史诗级大战的机会。</p>\n<p><img src=\"files/tomenet/got_lamp.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/need_light.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>本次收获颇为丰富，光是真神器就有整整三件，其中最为突出的又非埃兰迪尔之星莫属，这是一颗能够用于照明的精灵宝石，为北方王国阿尔诺的王权象征；遗憾之处在于它并不是瓦尔坦封圣的那几颗精灵宝钻之一，不然可能会珍贵过头了点，我起初还把它和凯兰崔尔的水晶瓶（精灵女王送弗罗多的手电筒）搞混了，后来去查才分清星光瓶里储存的是埃雅仁迪尔之星的光芒。</p>\n<p>这颗宝石可以提供失明抗性，免疫恐惧，看穿隐形，抵抗生命汲取，甚至能增加玩家的行动速度；此外它将产生半径为5的光照且永远不需要添加燃料，该照明范围是我们常用油灯的2.5倍，然而还没完，每隔几十回合便可将它激活，当作魔法地图显示周边一大片区域的详细情况，简直就是一双没消耗的天眼。</p>\n<p>不知道算不算乐极生悲，由于任何神器都不能放置在酒馆或家中，所以那场战斗的核心战利品都必须由活人随身保管，另外考虑到拾取等级限制，能拿起来的也就那么几人，没法随便找个小号存着；结果……揣着所有神器的那只仓鼠信心爆棚，一路高歌猛进，随后不负众望地暴毙在了-1750ft，古冢岗底层。</p>\n<p><img src=\"files/tomenet/Elendil.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/victory.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>大伙自然是又组织了几场声势浩大的救援活动，奈何位置实在太深太危险，主力队伍又于上一场恶战中元气大伤，除了有个倒霉蛋死在-1600ft送了人头之外，我们暂时未能取得任何进展，几位新冒险者甚至因为陷阱剑和其他玩意在浅层死了又死。</p>\n<p>三龙之战尚未开始的前夕我正在忙于收拾行李，准备将初始城镇周边调查一圈，虽然每座据点都是提前设计好的，不过城镇分布与整个地理环境由随机生成决定，探索世界仍是不可或缺的一环；最先发现的是古代森林，这属于地表无建筑的的野外地城，但由于服务器管理员作弊开全图剧透，这里实际上已经被几名群友简单探索过了，没有什么意义。</p>\n<p>初次远行时走得步履维艰，主要问题出在各种障碍物上，缺少漂浮道具也不会飞就无法穿越森林，得手动一棵棵地伐树取道；即便会飞也不能翻过高山，一定要拥有攀爬工具或者点够Climbing技能，否则只能绕远路，深水区没学游泳技能也可硬闯，但角色在溺水状态下会飞速扣血，想要跨越大型水体，飞行依然是不容忽视一道门槛。</p>\n<p><img src=\"files/tomenet/cross_sea.png\" alt=\"夜间的海面能见度极差，潜藏着无数危险\" loading=\"lazy\" class=\"φbp\"></p>\n<p>硬趟浑水的时候我曾出现过无法移动的情况，不清楚是网络卡顿还是按键失灵，当时角色的hp疯狂下降，身上大量药剂和卷轴也因为浸水而不断损坏；幸亏提前设置的道具快捷键仍然能用，我玩命地把治疗药水往嘴里灌，第一反应是盔甲超重得脱，但想着之前既然能走进来这么远，那应该不是这方面的问题；况且我一旦停止给药，卸个装备的功夫估计够淹死两遍。</p>\n<p>事发仓促，结束的也挺唐突，在我差点要对自己使用传送法杖的刹那，角色忽然又能行动了，我赶紧冲上岸边然后使劲咳嗽（肺部活动为当事人脑补）；大难不死，心有余悸，刺激程度不亚于腐败湖粪坑蝶泳，说来离奇，在水里快淹死的时候居然可以喝药续命。</p>\n<p><img src=\"files/tomenet/drown.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/water_or_potion.png\" alt=\"在水里快淹死可以喝药续命\" loading=\"lazy\"></p>\n<p>之后托群友花整整两万四千金币，代购到了漂浮戒指，但海洋仍然是我这名矮子的噩梦，这里不光充斥着大片大片的食人鱼，还有剧毒的箱水母，残暴凶猛的杀人鲸和大白鲨，能远距离发射穿甲水弹的枪鱼（Gunfish），更流传着喷吐闪电的克拉肯传说。</p>\n<p>即使在岸边也能冒出一大群水鬼，那架势如同潮水涌出，随时准备吞没路过的无辜冒险者；虽然危险万分，为了绘制地图而在深夜飞越大洋，依旧犹如家常便饭，但正因如此，见到能够歇脚的小岛时才会发自内心的感到欢欣与喜悦。</p>\n<p><img src=\"files/tomenet/GGG.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>要让我回忆最惊心动魄的一次出海经历，那毫无疑问是在探索镇子西北方向的那趟，给我造成了严重的精神损伤（物理层面上），几乎真的患上了海洋恐惧症，对比之下，前阵子差点淹死简直是小儿科。</p>\n<p>当时我正沿着海岸线徐徐前进，碰巧发现了不少水族战士，于是利用他们无法踏上陆地的特性，轻松在岸边大杀特杀，可当我边战斗边检查满地掉落物的时候，没注意到几只海马魔法师混在其他怪物里凑了过来；角色进入射程的一瞬间，铺天盖地的元素箭矢就飞了过来，伤害最高的可以一发带走我将近三分之一的hp，还附赠眩晕和摧毁物品的效果，我立刻启动外置血条，开始猛喝速度与治疗药水，然后拼尽全力将敌人斩于斧下。</p>\n<p>虽然是魔法师，但从手感上讲，这些海马的生命值惊人的高，丝毫不逊色于陆地上某些老练的战士，另外不知道是法术列表中空缺，还是因为其战斗风格本就倾向于近身作战，它们没有使用传送或闪现拉开距离，反倒冲上来贴脸施法，甚至还会咬人；得亏是群近战法师，在消耗了许多药剂后，我惊险地获得了胜利，毕竟肉搏方面爷才是专家，它们要采取风筝战术，那说不定我真得落荒而逃。</p>\n<p>正当我洋洋得意，甚至打算截个图吐槽一下走路上被海马揍了的时候，一股诡异的灵能直冲我的意识袭来，大脑仿佛要爆炸了一般，认知被扭曲还导致眼前出现了幻觉；虽然来不及弄清具体情况，可意识到理智降低后，我毫不犹豫地使用了传送法杖脱战，然后光速逃离了那片区域，直到确认周围安全，才惊出一身冷汗。</p>\n<p><img src=\"files/tomenet/seahorse.png\" alt=\"生死关头居然有空截图，艺高人胆大\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/fuck_wiz.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>从战斗记录来看，我是遭到了邪教徒的精神攻击，虽然hp没有丝毫减少，可理智值（Sanity）已经下滑至危险程度，两发心灵冲击将其蒸发了约40%，如果说生命值耗尽等于肉体毁坏，那么彻底丧失理智则是灵魂层面上被完全抹去。</p>\n<p>无论角色是3命还是99命，一旦SN归零，都将不可复活的彻底死去，而更恐怖的一点在于理智值不会自然恢复，虽然有药水能够增加，但理智药剂极为罕见，任何商店都没法订货和买到，只能依靠地城拾取或是用空瓶从喷泉舀水，瓶子会随机装满一种药水，而其中就有小概率roll到理智药剂。</p>\n<p>理智状况最初以非常模糊的形式进行描述，在health技能足够高后才可以显示出百分比，但具体数值取决于感知（WIS）属性，同样是100%，人类牧师的理智值肯定比巨魔战士要高得多，面对不可名状之物时也会更加坚韧。</p>\n<p><img src=\"files/tomenet/flashback.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/sanity.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>不存在任何道具能够抵御精神污染，哪怕神器也不例外，但有一些办法可以降低传入的精神伤害：</p>\n<p>首先是变形成不死者，僵尸骷髅什么的由于没有脑子，可以拥有T1级别（数字越小越弱）的心灵防护，其次是吸血鬼种族，防护等级为T2，而如果想要拥有效果最好的T3级减伤，那得选择心灵工匠职业并将角色练到Level 40，而其他职业需要花费宝贵的技能点数将Hereticism和Traumaturgy两项技能同时加到45级，部分近战职业没有这方面的技能树，尚未开始努力就已遗憾离场。</p>\n<p>另外玩家要是因为hp过低而死，那么变成鬼魂状态时会自带T3级别的心灵防护，危急关头又还有复活次数，说不定自杀还真是个解决办法，如果来得及的话……</p>\n<p><img src=\"files/tomenet/T123.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>不过事已至此，木已成舟，除了想办法恢复理智之外也没什么可做的，哦，或许可以痛批一下中土邪教组织猖獗的问题，这帮疯子还完全不传教，想加入都没机会，正常人没跑掉的全给送去见了他们的真主。</p>\n<p>外出是不敢再出远门了，地城深处似乎有听说过邪教成员出没的传闻，同样不敢继续深入，我整个人草木皆兵，大部分时间都缩在角落里痴呆地流口水，感受着脑海中闪回的记忆场景，眼前不断冒出各种幻象。</p>\n<p>当然，被迫宅在镇上算是个等待商店刷新的好机会，虽然大部分商人售卖的都是基础物品，但偶尔会出现些物美价廉的高级货，比如带’*'的强力卷轴，就算运气差，趁打折期间批发点常用的消耗物资也总是有用的；攒下一定积蓄后，黑市就成了我们的主要消费场所，听名字便知道价格宰人，但里面能买到真正好用，且对于同级玩家来说难以获取的装备，不像其他商店的“占位符”，开局凑合穿一下就换掉了。</p>\n<p><img src=\"files/tomenet/black_market.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>黑市中比较值的一笔交易是我花40k左右的金币买到了反射护符，忘记有无折扣，当时的花销水平完全支撑得起，而且反射词条极其稀有，尽管不如隔壁Nethack那样几乎无视所有远程魔法，它多少可以够弹开一些射弹和元素箭矢，而且光面板提供15点AC就相当于一枚优质的保护戒指，对我这种常常看着远程敌人无能狂怒的战士来讲，无比实用。</p>\n<p>非常血亏的交易则是初期花将近25k购入了一柄白板双头战斧，虽然基础伤害骰面很高，但由于太重，我那名矮人拿起时BpR降低，导致伤害还不如原来的旧斧头，如果转手卖给商店又回收不了多少资金，真是花钱买教训，我后来专门把它扔到杂物间当成了预防冲动消费的警钟。</p>\n<p>有些迷惑人的是，黑市里边经常会卖些很贵又没啥用的怪东西，比如各种皇冠，什么词条都没有，AC也差到几乎可以忽略，唯一的特性疑似是比较值钱，买这玩意或许只能满足一下使用者的role play或者换装需求，但这种游戏里角色就是个@符号，根本不会有人在乎你头上带了顶秘银皇冠还是摆着一缸金鱼。</p>\n<p><img src=\"files/tomenet/crown.png\" alt=\"特殊能力是卖得很贵的装饰品\" loading=\"lazy\" class=\"φbp\"></p>\n<p>在我因病休假逛黑市期间，可怜的仓鼠鬼魂还在古冢岗底层飘着，当事人后来用小号车了名巨魔战士，慢慢杀了下去，虽然最终成功抵达目的地，但角色实力不足以回收遗物，再次送命，底下躺着的神器倒又多了一件。</p>\n<p>人美心善的言静姐姐也新建了一名叫Doll的牧师，在训练塔里猛猛刷级，高等级的牧师和超能力者都有办法恢复其他玩家的理智，不过施法成功率极低，而且耗蓝奇高无比，估摸着只有在城镇等安全区域能够进行操作；另外不知道是不是在16级前夕死太多次，给静姐造成了心理创伤，之后很长一段时间都只能看到她蜗在训练塔，要不是等级高到一定程度就没经验了，估计可以练成十里坡剑神。</p>\n<p>如此执着于16级是因为我曾弄到过一根萨鲁曼密探的魔法长杖，鉴定之后没想到还是随机神器，自然就给了队伍中唯一的法师，可那玩意有使用等级需求，法师前期又十分脆弱，静姐就不断挣扎在需求线附近；倒不是我不想babysitting，而是ToMENet有组队限制，两名玩家的等级差距超过8级就无法在同一楼层中共享经验，除了复活之外也找不到能够永久降级的方法，痛苦万分。</p>\n<p>经历了漫长的练级，又戴上一堆增加属性的饰品，甚至靠拿法杖增加蓝量后，静姐的牧师终于达到了施放Faithful Focus的最低条件，此时她的主属性WIS为18/80，作为参考，我的力量也不过18/60；但即便这样，祷告的失败率依然高达91%以上，放一发就得耗尽魔力，需要更换回蓝饰品加速恢复，在不知道经历了多少次失败以后，中洲首例精神病治疗案例出现了！我的理智值从61%增加到76%，随着另外两次成功，SN终于重返100%，彻底归复常人！</p>\n<p>这样一来，就完全摆脱了幻觉与潜在的死亡风险，终于能再次踏上广阔的新天地了，多谢言静姐姐！</p>\n<p><img src=\"files/tomenet/restoreSN.png\" alt=\"首例精神病治疗案例\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/death16.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>恢复理智后无论瞧见什么都感到赏心悦目，从未如此觉得活着是种奢侈的享受，哪怕仅是坐在屋里，闲看一下游戏的天气和时间变化，都让人无比放松，安心，或许只有死亡的残酷才能凸显出生命的美好与可贵。</p>\n<p>以及，虽然铺张浪费，我在很早之前就购入了自己的两间房屋，一栋主体与一处杂物间，刚好挨在一起，花了35k左右的金币，大约是古冢岗1000ft两趟的收入；实际使用面积为20格，我非常想把中间的隔墙打通，可以再多两格空间并连通两室，遗憾的是城镇墙体无法挖掘，只好作罢。</p>\n<p>这些空间主要拿来储存较为重要，又必须分场合携带的道具，比如倾销垃圾用的魅力护符，挖矿时佩戴的幸运饰品，还有飞越森林海洋的漂浮戒指等等，另外我自己常用的几种卷轴和药水也都囤积了“至死量”——到死之前应该用不完。</p>\n<p>世界危机四伏，所有冒险者得把脑袋别在裤腰带上，过着刀头舐血的日子，刚刚还在嬉笑的同伴可能下一秒就会变成冰冷的尸体，这种严峻的环境下能有一处安全稳定，充满补给物资的容身之所，夫复何求；抛开各种复杂的访问权限，或是将房屋设置成店铺向其他玩家兜售物品，部分花里胡哨的装修小功能反而更加深得我心，像是能将有颜色的药水作为涂料，粉刷屋子外墙，不小心画错了还可以用清水洗掉痕迹，十分具有生活气息。</p>\n<p><img src=\"files/tomenet/my_house.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>如果势力庞大，发展到大后期需要公会馆和活动场地，当然也有更加奢华的选择，比如离城镇较远的超大型豪宅和带有护城河的城堡，虽然本质上仍是个大号方框，但它们的售价可以轻松突破千万级别，这么一看隔壁SAO血盟骑士团的总部塔才要10亿珂尔真是太便宜了。</p>\n<p>不过这方面就不得不提到一项令人头疼的问题，无论城堡还是小茅屋，其所有者一旦彻底死亡，房产与里面存储的全部物品都将直接蒸发，也不能写遗嘱什么的留给其他玩家。</p>\n<p>想避免这类情况有两种选择，第一，任命一名完全不离开安全区的法人角色，将资金交由他进行购置房产，再接着将房屋的访问权限设为队内共享，这样当事人出现意外也不会影响到固定资产；第二，则是组建玩家公会，然后再将房屋变更为公会财产，即便原主和公会长双双殒命，也不会导致公会解散或是资产消失，取得公会钥匙的成员将自动晋升为新任公会长；然而成本方面，创建公会需要一名30级以上的角色和整整2000k的费用，你没看错，需要花费整整两百万金币，仅仅为了注册，不过嘛，都想着买小城堡了，那这点钱应该不会放在眼里吧。</p>\n<p><img src=\"files/tomenet/castle.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>地城里有几率遇到丢钱陷阱，部分敌人也拥有盗窃能力，最离谱的是有些魔法能让你的金币造反，跳出钱包变成活化怪物然后狠狠地揍你，如果不想遭遇意外，那么还是不要腰缠万贯地冲进地城深处为好。</p>\n<p>虽然我个人很喜欢把货币扔在屋里，然后欣赏那种积玉堆金的景色，但要是不想每次都得回屋取钱，商人行会很乐意为您提供存款服务，<s>并在户主死亡后侵吞其所有财产</s>，不需要手续费，但也别想获得利息；另外有便捷的快递代发可供选择，能将物品或金钱寄给其他玩家，不过服务费不便宜，收货人则可以在任意一处行会站点取到包裹。</p>\n<p>ham曾经给我寄过一盏不用添加燃料的矮人灯，整个收货体验还是比较奇妙的，但必须前往商人行会的站点仍有些不方便，而且东西越珍贵收费越高；可如果队伍里有使用念力的高阶法师和超能力者，那么可以让收货方open mind，建立起精神联系后直接隔空传送物品；万一没带光源直接前往地下深处是件很危险的事，不仅看不到怪物与周遭地形，种族缺少夜视能力甚至无法在黑暗中阅读返回地面的卷轴，只得困在下方等待营救，这时要是能有人隔空递根火把可就帮大忙了。</p>\n<p><img src=\"files/tomenet/open_mind.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>之前的探索到也不全是白费功夫，地图的绘制上多少取得了一些进展，ToMENet的世界由区块组成，这些小区域互不干涉，但玩家可以穿过边界抵达相邻区块；即使角色正在被猎豹追杀，一旦跑到其他区域，哪怕怪物与你仅有一步之遥，它们也无法越过区域边界，只能望尘莫及，然而在隔壁会遭遇什么可就不好说……</p>\n<p>矮人30级时将获得翻越一切高山的能力，在此之前也不得不像其他人一样使用攀爬工具，或是在狭窄的岩石缝隙中穿行，而这正是最为惊险的地方；在跨越边界时无法看见对面的落脚点，如果对面是山体，那么角色会被“挤压”到最近的空旷处，可当玩家想回去时，游戏又没这么好心了，必须翻过那块山体才能回去；虽然通常可以绕路从其他连通边界的地方回去，但要是遇上死胡同或是怪物占道，那就必须读卷轴回城（希望包里还剩几张没用完），位于火山的话，那角色脚底下很可能有一池岩浆，在返程卷轴生效前多半会先被活活烧成渣。</p>\n<p><img src=\"files/tomenet/mountain.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>前文曾提到过，每个服务器的游戏世界都是随机创造的，所以也没法按照LotR的地图直奔邪黑塔，先简单介绍一下我们的周边环境：</p>\n<p>布理镇的北面是片难以穿越的林子，显示为绿色的#，越过树林则会见到海洋，我就是在那边的海岸线附近遭遇了邪教徒，镇子西侧生成了一座火山（萌新吞噬者），想不到用什么恶毒的语言来攻击这玩意，后续经探索，里面除了岩浆和乱石之外别无他物，并非恐怖的末日火山；自东北向西南有一条大河，或许正是著名的烈酒河，跨过河流可以见到古代森林与一大片沙漠，那里还有机率刮沙尘暴。</p>\n<p><img src=\"files/tomenet/explore.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>我们发现的首座其他城镇是“隐匿之城”——刚多林（Gondolin），至此可以确定游戏内的时间是在第一纪元了，当时我正在北部原野往东探索，走着走着突然发现了不少房屋与菜地，随即反应过来这是房区，那说明周围必定能够找到城镇，一番地毯式搜索后果然发现了刚多林，可惜我溜进来的位置是后门，否则从雄伟的城墙正门漫步至王之广场肯定更加震撼。</p>\n<p>刚多林里的商店全是基础类型，没有高级版的变体，不过数量上更多一些，食物店有整整3家，药水店也有2家，此外存在大量布理镇没有的服务点，像是草药治疗、变形恢复、物品研究、全背包鉴定……都相当实用；我们后面经常背一些神器来这里鉴别，因为某些进阶词条无法用普通的鉴定卷轴揭示，而*identify scroll*很难在基础卷轴店里见到，从黑市中花高价买又太过吃亏，到头来还是跑一趟刚多林实惠。</p>\n<p><img src=\"files/tomenet/Gondolin.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/Gondolin2.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>有些让人难以理解的是，跟刚多林配套的地城居然是魔多，大概想表达对抗关系吧，我起初看名字还猜索伦在下面等人，最次也得是炎魔之首或者格劳龙，后来查了才发现这地方居然没有固定的关底boss。</p>\n<p>可这不代表魔多是好捏的软柿子，光是下去的第一层就有35级的强度，要知道在击败魔苟斯前，玩家能达到的等级上限才50级；发现这地方之后有几名群友兴冲冲地来练级，打算变强再把古冢岗底下那几堆神器捞回来，结果不幸遭遇了克苏鲁神话中的外神，当场被秒杀，祂吐一口邪垢的伤害都有515，比我满血开狂暴还高；再后来还听说有人遭遇了近七十级的天使，完全不是一个层次的生物，简直让人怀疑人生。</p>\n<p><img src=\"files/tomenet/Yibb.png\" alt=\"伤害骰99d21，刚多林惊魂之夜\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/Yibb_wiki.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>埃兰迪尔之星和其余的几件神器，随着底层那只鬼魂的网络掉线，最终还是没能挽救回来；我之后去过-1750ft，虽然神器早八百年前就给刷新掉了，那一次的经历倒也算得上是创伤小组的光荣事迹。</p>\n<p>起因是ham忘记带灯又直接返回了古代森林的深处，如前文所述，这时要是有人用念力直接远程塞个光源就完事了，遗憾的是我们没人会这种操作，所以只能由创伤小组下去送灯送干粮。</p>\n<p>一路上遇到了三名头目：yeek king、东来者首领罗甘（Lorgan）、以及乌姆巴尔海盗的领袖之一，安加麦提（Angamaite of Umbar），这群人就算加上手底下的杂兵，对我来说也不是啥很难缠的对手，除了最后一位的名字把我吓得不轻，老眼昏花差点看成了乌顿（Udun）的安格玛巫王（Angmar），要不是没来得及跑就给对面砍死了，差点闹出大乌龙。</p>\n<p><img src=\"files/tomenet/forest_rescue.png\" alt=\"它会招惹不起的东西（叉腰\" loading=\"lazy\" class=\"φbp\"></p>\n<p>罗甘给我掉了个能放火球术的护手，清理一些很弱又追不上的东西非常非常好用，比如野生果蝠和法师学徒，这些怪物几乎没威胁，但极其喜欢在玩家周围瞎晃悠，果蝠完全不攻击但一直远距离跟着，法师则时不时放个魔法恶心一下人，你冲过去他又瞬移到旁边继续骚扰。</p>\n<p>玩家附近有敌怪就无法快速移动，只能缓慢地一格一格走，由于速度不够追不上，通常只能靠进入其他楼层或是穿越区块边界来甩掉这些玩意，超级浪费时间，光是想起来就血压高，千人血书请求灭绝果蝠（1/1000）。</p>\n<p>尊贵的远程职业吐口痰就能把他们弄死，但智力为⑨的战士只能干瞪眼，除非你愿意喝瓶几千金币的速度药水就为了砍一只野生果蝠；自从有了火球护手，再也没被乱七八糟的玩意烦过，虽然伤害不高，放完一发还得等cd，但它能无限使用而且没有智力门槛，更没有蓝耗和施法失败率，真是爱死这护手了，赐名“炎拳”。</p>\n<p><img src=\"files/tomenet/gauntlet.png\" alt=\"其实是火焰箭\" loading=\"lazy\" class=\"φbp\"></p>\n<p>好装备见多了也绝对不能放松警惕，去找ham的路上就遇见了几件烂到出奇的垃圾，比如这把魔古尔的Tomahawk（一种原始战斧），攻击和命中修正都是负数，拿上之后会让玩家感染恐怖的黑息，降低运气和最高生命上限，同时激怒周围的怪物，导致更加容易遭受围殴；不光如此，它属于严重诅咒的物品，必须用带&quot;*&quot;号的高级解咒卷轴才能从手中卸下，由于它还能重复诅咒自己，且在未解咒时无法丢弃，不小心捡起来的话又得斥巨资再到黑市买张卷轴。</p>\n<p>然而这玩意或许可以考虑给吸血鬼用来逆转，但还有一种无法攻击的Nothingness词缀，那是真正彻头彻尾的垃圾，吸血鬼都用不了，而且光放在包里就会妨碍玩家强化别的装备，让升级变成降级，所以出门在外一定要时刻记得鉴定。</p>\n<p><img src=\"files/tomenet/heavily_curse.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>扯远了，把重点转回ham这边，成功救援之后我们回镇上补给了一趟，然后决定顺带把森林打穿，本想着两个人应该很轻松，可返回原位后刷新的地形是一大片空地，四处都是敌人，更不妙的是我们并没有传送到一起，不得不各自为战。</p>\n<p>我当时旁边围着一群猎犬，其中还有只不断狂吠的精英怪，这叫声引来了附近一座vault里的巨量怪物，右面还有几队不知道啥品种的半兽人也赶了过来；光是这些也还好，我借助地形仅需同时面对四五名左右的敌人，盔甲较厚也吃不了多少伤害，甚至有空发消息呼叫增援，问题在于未知法师远距离降低了我的理智，杀出重围后理智值仅剩73%。</p>\n<p>几名远处的法师被ham杀掉后我以为危机解除，便不打算撤退，返回了右下角的vault准备收拾些战利品，在靠近时不知道哪里有株反魔真菌一直在释放干扰立场，由于我根本不用魔法，没有丝毫心灵负担地就找了过去；结果眼中突然天旋地转开始出现幻觉，原来之前攻击角色理智的不是什么普通法师，而是一名高等级的敌对心灵工匠，并且在我突围后他没有跟上来被消灭，意识到这一点我立即对自己使用了传送法杖逃命，但仍然吃了两发灵能冲击，理智值下滑至了危险的25%，整个人离踏进鬼门关只差半步。</p>\n<p><img src=\"files/tomenet/san25.png\" alt=\"almost die\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/san75.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>好在我们命不该绝，虽然一个精神残疾一个血药喝完，最终还是成功的撤了回来，多亏之前舀了大量理智药剂存在酒馆，我灌上几口又重回巅峰，否则还得等牧师睡醒；尽管出师不利，但两名活阎王显然不肯放弃，毕竟也没遇见什么较为离谱的怪物，直接带上了更多的补给道具就下去报仇。</p>\n<p>清点着包里的理智药剂，我干脆绑定了快捷键，大不了硬抗精神伤害也要上去把那帮杀千刀的心灵系术士给剁了；阅读返程卷轴，回到森林深处，使用魔法地图，喝速度药水开狂暴，大杀四方一气呵成，然后……然后就没了，我们把整个楼层全探索完了都未能找到下去的楼梯，也没有再刷新出会施放精神攻击的敌怪。</p>\n<p>仔细一查，发现这层已经是森林的最底部了，而我们一直以为在倒数第二层，白折腾半天，甚至还攒着不少打算到最后关头再用的消耗品，像是启蒙和抗性药水之类的，就这样，我们稀里糊涂地完成了古代森林的攻略。</p>\n<p><img src=\"files/tomenet/forest_done.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>并不过瘾的两名战狂准备回古冢岗一雪前耻，大致上是见到楼梯就下，直奔最底层，一路上顺风顺水，甚至没有精英怪和楼层头目拦路；可抵达-1750ft之后却受到了大群地狱猎犬的热烈欢迎，虽然它们的吐息喷我并不怎么疼，但背包里的各种药水却因为元素伤害而不断损坏，9瓶宝贵的理智药剂碎了5瓶，治疗和速度药水更是损失惨重，吓得我赶紧跑上楼把剩下的那4瓶塞给了队友。</p>\n<p>被底部一巴掌扇回来，我们还是决定在-1700ft逛逛得了，至少不用担心可能冒出来的尸妖王，一顿slash&amp;loot之后，我们发现了个闪光的字母E，ham先冲上去开怪，但不知道踩了陷阱还是直接被当场暴打，血量蹭蹭往下掉，几番周旋后药水还耗尽了；幸亏我们配合默契，他往旁边跑我往前面冲，成功把怪物拦在路口，那一瞬间简直泪流满面，我这名战士终于有前排站桩的机会了，之前经常是果蝠身体的队友飞太快，我在后面跟不上，或是对可怜的脆皮法师照顾不周，一个疏忽就只剩尸体。</p>\n<p>那个闪光字母是头火焰树人，也不知道它怎么没给自己烧干净，反正现在由我们送它上路，比较麻烦的地方在于攻击附加火焰属性，甚至站旁边都会被它的烈焰光环烧到，好在我有一件火抗披风，还可以激活能力提供双重抗性，打我跟挠痒痒似的；然而就像前文提到过，纵使双重抗性也无法阻止物品被破坏，我包里的药水劈里啪啦碎的像是放爆竹，卷轴也跟烧纸钱一样全成了灰。</p>\n<p><img src=\"files/tomenet/fire_ent.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>另外据受害人ham所述，这玩意还能降低玩家的属性，他几乎全属性全黄了，光是买各种对应的恢复药剂就得花几千金币，我的话比较幸运，之前的yeek king掉了件brigandine armour，提供各种属性维持，还加2点移动速度，我最后只损失了微乎其微的力量，完全无伤大雅。</p>\n<p>本来打完火焰树人就想让队友先回地表补给，结果我继续清怪的时候ham跟了一步，不小心踩到陷阱，刚恢复的血量又蹭蹭狂掉，果蝠身体虽然闪避高，速度也快，但hp上限不高，非常头疼于必定命中的陷阱；当时那叫一个惊险，我连忙回防让他赶紧recall，旁边源源不断有怪物涌来，还潜藏着成堆的陷阱，万幸，卷轴生效速度比死神的脚步快，ham成功撤退，不过这种你先走我殿后的感觉简直燃爆了。</p>\n<p>对准怪群大开Taunt拉仇恨！You shall not pass！</p>\n<p><img src=\"files/tomenet/1700ft.png\" alt=\"let me solo them\" loading=\"lazy\" class=\"φbp\"></p>\n<p>这种光荣事迹就应该记在创伤小组的历史上，配享群太庙；不过总的来讲，最终收获是：被陷阱扎到半死的蝙蝠一只，烤得外酥里嫩的矮子一名。</p>\n<p>地上那些垃圾我顶着陷阱收拾了一下，反正重甲可以肆无忌惮，除了几个戒指以外没啥能看的，火焰树人甚至什么都不掉，还真烧了个一干二净；当天的冒险之旅到返程完就结束了，我们后来一起下过魔多，那条魔像腿就是两个人在魔多的时候挖出来的，ham负责冲在前面开无双，我由于负重高就在后面捡垃圾顺便挖矿。</p>\n<p>在魔多也遇上过危急情况，不过是有惊无险的那种，当时我不小心踩到了活板门，然后直接掉到下方楼层的boss脸上，他叫乌法斯特（Ulfast），是东来者族长的儿子，不强，比较轻松的干掉了，印象中没有给好东西；但刚摔下楼又看到闪光头目的时候真冷汗下来了，毕竟来不及仔细看是谁，就结果而言，只在前两层溜达，felling又正常的话，应该不至于撞见古神什么的，深处就不好说了。</p>\n<p><img src=\"files/tomenet/trapdoor.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/bump.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>风险越大回报也就越大，魔多虽然不是啥好地方，但各种板甲龙皮甲随处可见，像Kolla这种高级袍子，哪怕是无前缀的基础款也自带一堆修正，卖掉能值50k金币；地板上甚至可以捡到野生的属性药水，喝下去永久增加角色的对应属性，放黑市里要卖近十万一瓶。</p>\n<p>实力足够的话，在这也能爽快练级，不死族和亡灵较少，经常能见到大群的半兽人与巨魔，砍翻一屏幕的o相当解压，德鲁伊和法师放毒更是一死死一片，由于第一层就足够危险，非常适合stair-dance，指的是在楼梯口不断上下刷新地形，挑选最近最稳妥的怪物进行清理，一旦感觉不对便可立马上楼回地表；但或许值得注意，我在这遇到过几乎整层都是岩浆的地形，即使能够飞行，在岩浆上方仍然会遭受伤害，多半需要有火焰免疫才能安全经过。</p>\n<p><img src=\"files/tomenet/lava_river.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/ooo.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>再后来的那些日子里，我主要都在为绘制地图而探索世界——</p>\n<p>旅途总体上是平淡乏味的，听着音乐穿过大片大片的旷野，飞越海洋，翻过高山，作为大自然的回报，旅行者也能欣赏到一些美景，像是林中小湖、沙漠绿洲、海洋中的灰森林岛屿等等，尤其在遭受过精神创伤后，这些美丽的事物格外令人治愈。</p>\n<p><img src=\"files/tomenet/lake.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/gray_forest.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>第二座被发现的城镇是LotR中著名的白城，但此时它还不叫米那斯提力斯，而叫米那斯阿诺尔（Minas Anor），有些混乱的是，ToMENet中已经出现了魔古尔武器等描述文本，而白城的姊妹城市米那斯伊希尔（Minas Ithil）实际上要在第三纪元才被索伦攻占，变成戒灵要塞，改名米那斯魔古尔（Minas Morgul），也许游戏里是什么平行时空吧，否则我们不可能在见到这些的同时看到刚多林，还有精灵矮人一家亲之类的。</p>\n<p>白城展现于世人面前的过程也历经艰辛，它被一座座火山和高峰环绕的严丝合缝，房区在火山外围，我第一趟费了好大劲，几次重度烫伤都没能穿过那些高耸的尖峰，直到30级获得种族攀岩能力才最终得以如愿。</p>\n<p>从正门进入，观赏完城内美景后，我去执政厅觐见了一下当时的国王，一看人名Aragorn Dunadan懵了，大步佬不应该没出生吗，怎么白城还没改名就已经登基了？后续查阅得知：Aragorn是辛达语，意为“可敬的国王”，由表示荣耀的前缀ara和“可敬的”gorn组成，Dunadan则可以指“杜内丹”这一人种，所以王座上坐着的大概率<strong>不会</strong>是我们熟知的阿拉松之子，阿拉贡。</p>\n<p>此处对应的地城是The Paths of the Dead，死者之路，里面几乎全是亡灵和不死族，据说还有那兹古尔，攻略起来应该会被各种负面状态烦得不轻，另外光是第一层就有40级的强度，我下楼梯瞅了一眼立马跑了，根本惹不起。</p>\n<p><img src=\"files/tomenet/Anor.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/Anor_map.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>抛开到处都有的基础商店，白城这最为特殊的是有一家高级黑市，里面出售各种顶级的武器盔甲，威力惊人的法杖，甚至还有不同学派的法术全本，这些东西随便弄到一件咱都得抱着傻笑一晚上；然而它们的售价却也那么高不可攀，统统都是六位数起步，随便一本法典都要近四十万的金币，把我卖了估计都没这么多钱。</p>\n<p>服务点方面基本和刚多林相同，不过这里有座赌场，应该是游戏中唯一的一座，里面除了摇灌铅骰子猜点数之外，居然还可以下围棋，不过这种围棋变体的棋盘只有9x9大小；对手的难度等级分为8档，尽管ToMENet由于开源的关系一直保持着更新，但棋艺方面肯定比不过近几年的机器学习，而且浏览到玩家手册上一份零几年的围棋入门视频时，我更加断定了这种猜想。</p>\n<p>群里非常热烈地讨论了要用哪家的ai模型，然后……然后大家就忘了这茬，可能是我们道德素质太好，不忍心把赌场刷破产，最后连ascii的下棋界面长啥样都没见着（其实是不小心忘了）。</p>\n<p><img src=\"files/tomenet/bridge.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/casino.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>人有悲欢离合，月有阴晴圆缺，再长的旅途也终将抵达尽头，我的故事到这里不得不告一段落了。</p>\n<p>那是在野外遇到的一大群Orge，虽然我个人更习惯将其译作“食人魔”，但这些家伙并不是比尔博在森林里遭遇的那三只食人妖，那三名怪物在《霍比特人》一书的原文中使用的是“Troll”一词，也就是我们现在常说的“巨魔”；纠结名称也不是很重要，只要分清我遇上的是Orge，老比尔博遇上的是Troll，而Ogre不会在阳光下变成石头就行。</p>\n<p><img src=\"files/tomenet/Troll.jpg\" alt=\"The Trolls\" loading=\"lazy\" class=\"φbp\"></p>\n<p>我低估了敌人的危险程度，也高估了自己的风险承受能力，对着这些食人魔就冲了上去，殊不知这却葬送了自己的后路，四面八方的攻击如潮水般涌来，血量急速下滑让我开始感觉不对劲，想后撤穿过地图边界离开，但背后早已被敌人包围得水泄不通。</p>\n<p>曾经无数次救过我的药水，在这次却成为了间接的死亡原因，因为在被包围的情况下，角色行动一轮，周围将存在整整8名敌人进行近战反击，更加不妙的是，这群食人魔还有大祭司远程施放魔法，以及前排偷窃戒指等装备的盗贼；致命伤治疗药水的回复量抵不上每轮损失的血量，根本无济于事，习惯性地不停喝药让我错失了最佳的逃跑时机，等我想起使用传送法杖时，hp早已岌岌可危。</p>\n<p>最后关头我记得有按过传送的快捷键，可不知道是网络延迟还是同时喝药导致操作冲突被吞，我最终未能脱困，不幸殒命当场。</p>\n<p><img src=\"files/tomenet/death_log.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>双拳难敌四手，更何况是十几名食人魔，由于即时制，事情从发生到结束不过短短十秒，很多东西没有反应过来，我便因为肉体损毁变成了鬼魂；虽然hp耗尽，但我这名3命角色还一次复活机会都没用过，故事本不该在此落幕，但游戏为了防止鬼魂被原先的敌人继续杀死，玩家死亡后会随机转移到同地图的其他位置，而我旁边不幸的出现了一头远古白龙。</p>\n<p>理解白色的字母D代表什么之后，我试图逃跑，但这条远古白龙的移动速度显然更快，何况它还能够喷吐超远距离的龙息，转眼间，我便再次失去了意识……</p>\n<p><img src=\"files/tomenet/ancient_dragon.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>“救命啊，训练塔里有好多老鼠”</p>\n<p>“来楼梯口蹲着揍老鼠”</p>\n<p>“啊？有什么怪把我的法术书烧了”</p>\n<p>“哪里有蠕虫啊——我这里一只都看不到”</p>\n<p>“二楼右下角的房间里有”</p>\n<p>“有人要这把剑吗，1d5”</p>\n<p>。。。。。。</p>\n<p>“四人小队，出发！”</p>\n<p>“楼梯在这里”</p>\n<p>“被麻痹了”</p>\n<p>“等一下队友过来”</p>\n<p>“我来啦”</p>\n<p>“&gt;&gt;”</p>\n<p><img src=\"files/tomenet/downdowndown.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>“法杖储能快没了，有没有人帮忙充一下”</p>\n<p>“我可以提供免费鉴定和充能”</p>\n<p>“把法杖彻底放干好像就不会爆”</p>\n<p>“下次试试”</p>\n<p>“（我也充爆过”</p>\n<p>“反正都不是什么值钱的杖”</p>\n<p>。。。。。。</p>\n<p>“ham ham，me dead”</p>\n<p>“u dead, dead where”</p>\n<p>“south of the volcanic hall”</p>\n<p>“aww”</p>\n<p>#dig#dig</p>\n<p>“found a vault，f**k wiz and volcano”</p>\n<p><img src=\"files/tomenet/u_dead.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>“大灯哥画个果蝠”</p>\n<p>#SuperBulb瞬间出图</p>\n<p>“传神”</p>\n<p>“有艺术的”</p>\n<p>“用4090生成37000张表情包”</p>\n<p>“大灯哥拿到了4090脚就离开了地后边忘了”</p>\n<p><img src=\"files/tomenet/around_volcano.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/STR_ham.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>“imsb”</p>\n<p>“忘记带灯了”</p>\n<p>“还有武器”</p>\n<p>“ahhhh”</p>\n<p>“巧了，我下来也是”</p>\n<p>“帮我点个灯”</p>\n<p><img src=\"files/tomenet/fogot_lamp.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>“怎么房区还能刷果蝠，这不得给烦死”</p>\n<p>“业主呢，都出来维一下权”</p>\n<p>“什么业主，物业”</p>\n<p>“78物业，我在房区杀过兽人小队”</p>\n<p>“bree治安不是很好”</p>\n<p>“房子都建水里了”</p>\n<p>“有人要变银色小老鼠吗”</p>\n<p><img src=\"files/tomenet/property.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>“捡到张召唤死灵的卷轴，能拿来刷经验吗？”</p>\n<p>“应该可以（”</p>\n<p>“召唤怪物卷轴也刷经验”</p>\n<p>“就是 死灵可能会抽经验”</p>\n<p>“我刚刚差点用召唤杖把自己弄死”</p>\n<p>“出的东西很恐怖”</p>\n<p>“最好在走廊读，或者墙角”</p>\n<p>“死灵没脑子应该没法师吧”</p>\n<p>“巫妖也是死灵”</p>\n<p>“草，对哦”</p>\n<p>#捏着传送法杖在村长旁边读了然后发现安全区不能召唤怪物</p>\n<p><img src=\"files/tomenet/terrorist.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>“v我50k”</p>\n<p>“等我把我的神器弓卖了就有了”</p>\n<p>“再去赚5k，hxh！”</p>\n<p>*Cap face</p>\n<p>*Whip*</p>\n<p>“唉，资本家”</p>\n<p>=。=</p>\n<p>“现在就给我去赚钱！”</p>\n<p>“v你5k先”</p>\n<p><img src=\"files/tomenet/vu5k.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>“喝酒伤身，明儿见”</p>\n<p>#You notice Shinie the bat trying to steal from you！</p>\n<p>#Shinie the bat is seized by the guards and thrown into jail！</p>\n<p>“opz”</p>\n<p>“哈哈哈哈哈嗝”</p>\n<p>“等你出狱v你100”</p>\n<p>。。。。。。</p>\n<p>#翡翠鸟光速出狱买了酒</p>\n<p>“喝，你为什么不喝”</p>\n<p>“都给你买了一瓶了！”</p>\n<p>“喝酒掉san”</p>\n<p>“san掉没了脑死亡变植物人”</p>\n<p>“那这个酒有什么用”</p>\n<p>“谁喝谁倒霉”</p>\n<p><img src=\"files/tomenet/jail.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>“happy”</p>\n<p>“i got slime mold juice”</p>\n<p>“want one？”</p>\n<p>“of course”</p>\n<p>“chicken nugget juice”</p>\n<p>“here”</p>\n<p>“that was a delicious slime mold”</p>\n<p>“thx，iden +1”</p>\n<p><img src=\"files/tomenet/juice.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/yummy.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>无数回忆掠过脑海，但一切都结束了，眼前仿佛出现了远古白龙的寒霜吐息，将我的灵魂灼烧殆尽。</p>\n<p>哦，没错，我为了绘制地图走得太深，魂飞魄散无法复活了，此处的危险程度相当于地牢的51级，太过贪婪招致自身灭亡，某种意义上也是很符合矮人精神的死法。</p>\n<p>死亡时得分为168065，等级由于被吸掉一级，变成灵体又降了两级，最终显示为31级；另外由于鬼魂状态，没能在记录文件中留下装备信息，略有些遗憾，名下绝大部分财产都因物主死亡而烟消云散，仅剩的少量遗物放在“公厕”里留给了队友，这也是我最后能尽的绵薄之力。</p>\n<p><img src=\"files/tomenet/killed_by.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/rank.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>在生命活动终止前，我传回了最后的几张图像，并将它们拼在了之前测绘的地图上，往后的空白就要靠队友们填充了。</p>\n<p>起先为了搞清世界的具体大小，我将东南西北方向都探索至了尽头，然后再开始逐渐填充四个象限，所以最终留下的地图像个十字墓碑，或许我的归宿在这时就早已注定。</p>\n<p><img src=\"files/tomenet/tomenet_map.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/tomenet/tomenet_map2.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>逝者已矣，生者如斯，这只是些关于不知名探索者的事迹，至于成功讨伐魔苟斯凯旋而归的故事，则是一段应当由其他生还者讲述的传奇伟业了。</p>\n<p><em>这里长眠着刺猬，它为了探索广阔的世界而牺牲</em></p>\n<p><em>不能与大家一起挑战米尔寇了很抱歉，但那具魔像的残骸希望你们能拼好</em></p>\n<p><em>愿后世旅人的路途不再充满迷雾</em></p>\n","next":{"title":"Avanor游记：从充满恶性bug的粪作中艰难通关","link":"2024/Avanor"},"plink":"http://www.ephesus.top/2024/BoMENet-arc/","reward":true,"reading_time":"22734 words in 152 min"}