{"title":"矮人问题解决中岩浆应用的不完全纲要","date":"2024-06-25T19:10:13.000Z","date_formatted":{"ll":"Jun 25, 2024","L":"06/25/2024","MM-DD":"06-25"},"link":"2024/magma","comments":true,"tags":["AO3","同人","矮人要塞","翻译"],"updated":"2025-12-03T04:49:29.075Z","content":"<p>原作：<a href=\"https://archiveofourown.org/users/tuesday/pseuds/tuesday\" target=\"_blank\">tuesday</a></p>\n<p>译：Silencess</p>\n<p><strong>摘要：</strong></p>\n<p>一本收录了《文明：或其反面》、《“你接受了折磨”》等备受推崇的作品以及广受好评的《常识矮人》系列的合集！</p>\n<p>您将发现那些困扰已久的问题的答案，比如“死亡能拯救世界吗？”和“有什么问题是岩浆解决不了的？”（这是个玩笑：岩浆什么问题都能搞定！）</p>\n<p><strong>作者寄语：</strong></p>\n<p>致<a href=\"https://archiveofourown.org/users/molybdomantic/gifts\" target=\"_blank\">molybdomantic</a>。</p>\n<p>非常感谢Drayton的帮助！</p>\n<p>Ceb，我形容不出我写这篇作品时有多么兴奋。我真心希望你会喜欢！</p>\n<p>（更多注释请见作品结尾。）</p>\n<hr>\n<p>【摘录自哲学著作《文明：或其反面》（副标题：矮人传奇故事——大胜精灵野蛮！）：】</p>\n<p>你知道吗，精灵会用木头制作家具？他们的堕落毫无止境！</p>\n<p>你知道吗，精灵无法加工金属或石头？上等的材料躲避他们不洁的触碰！</p>\n<p>我的矮人同胞们敦促你将金属彻底施予血肉之上，从他们顽固的本性中驱逐异端。但这只是一种方法！</p>\n<p>这种方法会让发瘟的精灵血液玷污钢铁，更不用说还会留下一座座腐烂的尸山。你知道什么比一个活着的精灵更臭吗？一百个死掉的精灵！</p>\n<p>虽然恶臭比起活的精灵来说更可接受，但有一种更好的方法！一种可以净化他们的基本冲动，洗净他们踏过的大地的方法。岩浆！</p>\n<p>它既是问题<strong>也是</strong>答案。</p>\n<p>【接下来的三十页详细比较了岩浆和传统武器之间的利弊。尽管这会对周围环境造成了一定的损害，但书中高度倾向于将岩浆转化为熔岩。作者还囊括了几张复杂的比例图，展示了理论可行的岩浆陷阱，并详细规划了一座由岩浆环绕、覆盖和部分参与构建的要塞。然而，后者在很大程度上是不切实际的，因为作者拒绝在他的构想中妥协，即使是使用黑曜石也不行。】</p>\n<hr>\n<p>【摘录自《矮人：问题与解答》：】</p>\n<p>矮人！他们正是问题所在！</p>\n<p>“挖一条岩浆通道来为我们的工坊供能。”我告诉那些新手矿工们。</p>\n<p>他们径直往下挖，直接掉了进去。这是对精良镐子的可耻浪费！</p>\n<p>“打点野味来充实我们的餐桌，”我告诉那些猎人，“矮人现在只有一大堆火鸡蛋饼干能吃了！”</p>\n<p>他们带着一群狂暴的大象闯进前门！</p>\n<p>“为我们未来的岩浆瀑布挖一个斜槽。”我告诉矿工队伍，充满信心地认为我们的餐厅和楼梯会让整个大陆满怀妒忌。</p>\n<p>出于嫉妒的背叛，他们挖走了另一个矿工脚下的石头。愚蠢！那是一位传奇矿工，他的鲜血现在染红了我们的楼梯地板！</p>\n<p>“让哥布林们在我们辉煌的陷阱下粉身碎骨，”我告诉全体居民。“那些被笼子活捉的将被关进‘深渊’，成为我们每周的娱乐节目！”</p>\n<p>数十人贪图一位死去的伐木工人的袜子，纵身扑向劣质的哥布林长矛！</p>\n<p><strong>矮人。才是。问题。</strong></p>\n<p>解决方案？我有很多！</p>\n<p>【接下来是十八页粗陋的草图。有的是模糊不清的涂画，有的已经被擦得难以辨认。能够识别出来的东西足以让最冷硬的刑讯者脸色苍白。】</p>\n<hr>\n<p>【摘录自《“你接受了折磨”》，一本欢迎手册，分发给所有试图移民至传说中臭名昭著的矮人殖民地“黑曜尖塔”的人：】</p>\n<p>承认吧。</p>\n<p>你明白自己将要面对什么。</p>\n<p>无论我们管理层如何尝试掩盖，谣言还是甚嚣尘上。</p>\n<p>这完全是你的错。</p>\n<p>第一步是接受这个事实。</p>\n<p>但是，至高领主们，我听见你们在呼喊。要是我出生在这里怎么办？</p>\n<p>你注意到这句话的关键词了吗？“我”。</p>\n<p>是的，就是你。你自己选择出生在这个地狱中。</p>\n<p>没有人强迫你去参与对精金蠢地的殖民，去不断遭受无数恶魔军团和可怖异形的围攻（如果你认为自己被强迫了，请参阅第87页。简而言之，谁知道强迫这个词到底是什么意思呢？）</p>\n<p>这样想吧：没有其他殖民地敢说自己有这样由最纯净的精金雕刻而成的厅堂。那些墙壁是不是涂满了无数在你之前的矮人的血和肉渣？是的。这只是真正虔诚者展示他们激情的方式而已。为什么你不自愿多献出一条肢体来增添气氛呢？</p>\n<p>难道你不想让殖民地变得伟大吗？那你为什么要逃向荒野？</p>\n<p>幸运的是，你仍然可以让这一切重回正轨。就像你选择生活在这里的永恒折磨一样，你甚至可以选择你未来的救赎。</p>\n<p><strong>程序A</strong>：</p>\n<p>岩浆泵。</p>\n<p>关于酷热气候、持续辛劳和危险工作环境的谣言是恶劣、难以消除、但完全属实的。它们可能还低估了实际情况。</p>\n<p>请记住：这是你自己选的。</p>\n<p>我们实在不愿意浪费一支资深退伍军人小队的时间来像追捕狗头人小偷那样追踪你，在夜晚把你用锁链拖回来。一些恶魔闯入了无技能工人的宿舍——也许军队本可以拯救一些可怜的家伙。（如果爆发发生在其他地方，请参考索引。如果没有爆发，请参阅第37页关于撒谎者的程序。总会有恶魔爆发的。）</p>\n<p><strong>程序B</strong>：</p>\n<p>末日装置。</p>\n<p>你可能会认为入选参与这一绝密项目是一种荣誉。你是对的！</p>\n<p>死亡人数可能很高，但我们随时会获得一个幸存的实验对象。我们的统计学家表示，100%的高死亡率是不太可能的，他很了解他的数字。</p>\n<p><strong>程序C</strong>：</p>\n<p>【这本长73页的手册中大部分内容已经被烧毁，无法辨认。】</p>\n<hr>\n<p>【摘录自《常识矮人》系列：】</p>\n<p>这里是常识矮人，为您带来更多常识！</p>\n<p>在上一期《常识矮人：两只猫和你》发行后，我收到了一些读者的加急信件。很高兴告知大家，他们的问题其实有相当简单直接的解决办法，这只需要运用一点点常识！</p>\n<p>举个例子，</p>\n<p>!!乌里斯特·麦克达格尔!!写信说（请原谅我对他的文字进行了一些编辑，以保证其表达清晰、遵循语言规范，并照顾到我们的全年龄向读者），</p>\n<p>“全都烧起来了，全都烧起来了。我们怎么会觉得自己能驾驭如此可怕的力量？全都烧起来了。杀了我吧。”</p>\n<p>好，好的，!!乌里斯特·麦克达格尔!!，我能看出你正陷入困境！多么恐慌，多么痛苦——很显然你需要一点点液体。</p>\n<p>马上前往离你最近的储藏室，拿些肉盔菇酒。我敢保证，只要你解了渴，你的思维会更加清晰，你的生产力会像坐了火箭一样飞速提升，就好比你们殖民地那些远近闻名的岩浆间歇泉渡船一样！</p>\n<p>我很高兴地宣布，大多数信件、信使和远方传来的痛苦尖叫都讲述了类似的故事。一个寻常的问题，一个寻常的答案，都是为了那个拥有最不寻常产品的殖民地！</p>\n<p>我形容不出我有多么希望看到任何一艘美丽的船只动起来。岩浆：唯一值得航行的海面。有你这样的!!劳动者!!的贡献，总有一天，我们可以开着船驶向月球！</p>\n<hr>\n<p>【摘录自《生命有限的困扰》，一本伪装成自助手册的广告小册子：】</p>\n<p>生命有限是一个问题吗？兽人总是来围攻，人贩子在他们最新的绑架和营救尝试中制造骚乱？精灵对你精心装饰的后院中那些有品位的枯树叨叨个不停？矮人邻居总是在你读到一本佳作的最后一章时举办喧闹的派对，惹你心烦？甚至就在读本书时？</p>\n<p>不必担心了！生命有限的困扰有其解决方案！那就是：不朽！</p>\n<p>只要一点点死灵术，那些难搞的邻居就会成为街坊的守望！</p>\n<p>保护你珍贵的塔楼！提升房产价值！立即联系“我们是死灵法师”！</p>\n<p>[附有一张废弃的死灵法师塔地图。这个位置广为人知，而且已经被矮人们彻底占领。如果对那些鼓吹出的僵尸大军的去向有任何疑问，请前往附近的熔岩池，这些熔岩池都是这本书出版后的许多年间喷涌出来的。]</p>\n<hr>\n<p>【《死亡能否拯救世界？》的全部内容如下：】</p>\n<p>【前127页只有一个词：“<strong>不。</strong>”最后一页则是一些对不熟悉矮人文化的人来说意义不明的词：“<strong>岩浆。</strong>”】</p>\n<p>【作者不详。】</p>\n<hr>\n<p><strong>后记：</strong></p>\n<p>【摘录自《矮人与神秘奶酪》：】</p>\n<p>【所有羊皮纸书页上只有一幅幅雕刻师和奶酪轮的图片。每一块的手艺都达到最高水准。】</p>\n<p>【附有一张便条。</p>\n<p>有人以尖锐的笔迹写道：“学徒们！别以为我没注意到你们那糟糕的组织技巧。”</p>\n<p>这句话下面，写着一行柔和、圆润的字迹：“反正，谁会读这破玩意儿呢？”】</p>\n","prev":{"title":"帷幕后的人","link":"2024/man_behind_curtain"},"next":{"title":"实用又迷人","link":"2024/practice_and_atmospheric"},"plink":"http://www.ephesus.top/2024/magma/","reward":true,"reading_time":"2489 words in 17 min"}