{"title":"狄魔高根的补丁(3)","date":"2024-06-23T19:41:14.000Z","date_formatted":{"ll":"Jun 23, 2024","L":"06/23/2024","MM-DD":"06-23"},"link":"2024/demogorgon_patch_3","comments":true,"tags":["AO3","NetHack","同人","翻译"],"updated":"2025-12-03T07:18:09.573Z","content":"<p>原作：greyknight</p>\n<p>译：Silencess</p>\n<p>上篇：<a href=\"/2024/demogorgon_patch_2/\">狄魔高根的补丁(2)</a></p>\n<hr>\n<p>他受够了。之后，本从老电脑中弹出了那张软盘，带着它离开了房间。他沿着街道漫无目的地走着，试图找出摧毁它的最好手段。然后他意识到自己正盯着这个手段：就在路前方，一台垃圾车正把垃圾桶倾倒进自己咀嚼咬合的金属巨口中。他跑过去追上垃圾车，把那片讨厌的塑料方块丢进投口中。本站在那里看着，直到塑料破碎，磁带裂成碎片，整个软盘消失在机器的喉咙里。他满意地回到家，试图冷静下来。新闻报道了关于罗切斯特大学考恩教授的残忍谋杀案；毫无疑问，尸体的头颅显然消失不见了。本知道它在哪里。</p>\n<p>尽管已经摆脱了游戏的邪恶影响，但他仍然睡得很不安稳。在一个奇怪的梦中，他发现自己身处一个ASCII森林的深处，周围都是绿色的表示树木的井号（#）。他小心翼翼地穿过森林，击败挡路的怪物。最后，他来到一个灰色的下划线（_），一个石头祭坛旁。他拿起放在祭坛上的括号（(），然后一切都陷入黑暗。</p>\n<p>次日早晨，他迷迷糊糊地醒来，逐渐意识到手中握着一个薄薄的扁平物体。他感受着它的形状，拒绝去看它。别再来了！他没法再忍受这一切了！他把手举到脸前，颤抖地看着他握着的那张软盘。</p>\n<hr>\n<p>那天，一种坚忍的冷静降临在他身上。显然，他不可能像之前尝试的那样轻易退出。他下定决心，要按照游戏的规则坚持下去。他要打败这一切，赢得这场游戏，也许只有这样他才能摆脱它的凶险本质。从上次离开的地方继续游戏，他从储藏点拿起斧头和其他一些物品，然后回到了任务层的森林。当他经过教授的尸体时，他脸上的肌肉开始抽搐，但他强迫自己保持冷静，继续前进。最后，他来到了森林中挡住他去路的……</p>\n<p>不！这不可能！两棵树都不见了，道路畅通无阻。他的一部分意识抱怨着自己根本不需要去找那把斧头，而其他部分则默默畏缩着。多么浪费时间啊，他在心里嘀咕着。他紧张地往前挪动着；如果他要战胜这个游戏，他必须一直赢到任务层的最后。当然，他胡思乱想着，他已经知道自己会在森林尽头找到什么了。他穿过树木，来到一片空地上。当然会有片空地，他想着。而这里……这里就是祭坛。他检视那个灰色的下划线，看着游戏如何描述它。他读着屏幕上的文字，忍不住发出笑声，在一种扭曲的幽默感中意识到在那个晚上那些可怕符文所代表的含义。当然，他本该立刻意识到那个血腥祭坛上写着什么。除了<strong>狄魔高根</strong>，它还能是献给谁的呢？</p>\n<p>那亵渎的祭坛上放着一只银铃和一枚铜质护身符。和他所希望的一样，任务的宿敌并不在这里。第一件物品是开启之铃，它是每个角色任务的宿敌都持有的物品。而另一个，铜质护身符……嗯，它一定是他的任务神器！真奇怪它没有名字。他把它们都捡起来，快马加鞭地从可怕的森林里跑出来。在半路上，他发现地上有一件工具；他之前肯定是因为心不在焉而没注意到。他走过去，想看看那是个什么工具；也许它会是什么有用的东西，神灯之类的。突然，他大叫一声从椅子上跳了起来，撞倒了桌上的台灯。它摔到地上熄灭了，只剩下荧光屏幕上不祥的文字映照着整个房间。</p>\n<p><span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>“你看见这里有手电筒.”</span></p>\n<hr>\n<p>本能在那天晚上睡着简直就是个奇迹。他要是根本睡不着或许更好。在他的睡梦中，纯粹恐怖的词句向他袭来，命令他戴上铜质护身符。催眠般的话语从黑暗的虚空中涌出，那黑暗比夜色还要深邃。他只看见梦中的自己缓慢无神地遵循着命令，而他残存的意识碎片只能无力地尖叫。现在那声音又出现了。现在，他终于知道那就是狄魔高根，那个篡改他的梦境、造成困扰他的恐怖事件的幕后黑手。只有恶魔领主本人才有能力完成这一切。过去的日子里，本有时会好奇起&quot;老D&quot;是什么样的存在。他的目标是什么？游戏通常并没有大张旗鼓地介绍他。他想要什么？当噩梦中的声音说话，命令他机械地拿起开启之铃时，本明白了。他明白狄魔高根知道，知道自己只是个游戏中的存在。而本明白那个可怕的存在想要什么。</p>\n<p>他想要<strong>出来</strong>。</p>\n<hr>\n<p>当本早上醒来、发现铜质护身符系在脖子上时，他已经不觉得惊讶了。但他还是哭了起来。透过朦胧的泪眼，他看着镜子里的它；他知道试图摘下这个被诅咒的玩意是毫无意义的。他并不认识铜质表面上刻着的符文，但这不妨碍他觉得它令人不安。他浑身发抖着开始整理床铺。有什么东西从被子里滚了出来，当啷一声落到了地板上。那是一只银铃。</p>\n<p>他颤抖着双手拾起了开启之铃，用手指捏住铃舌，避免发出任何声响。哦，他真怕听到它会发出怎样的声音！只要看到铃铛上那些浮雕的邪恶符号和标记，那些尖叫的嘴巴、敞开的骨门，哪怕是不知道它从何而来的人也能看出这是个令人恐惧的东西。但他知道试图毁灭它没有任何意义。它是一件不可摧毁的仪式神器，是进行一种强大仪式所需的三件物品之一，那仪式只能出现在游戏的最深处：地狱般的葛汉诺姆地区。</p>\n<p>一股突如其来的冲动涌上心头，他冲向房间门口，想要逃到随便什么地方，只要能逃离这个噩梦般的游戏就好。这是一次疯狂的爆发，还是他最后一丝理智试图拯救他自己？都无所谓了。当他试图打开门的时候，他突然跪倒在地，被铜质护身符的链条勒得几乎窒息，仿佛一条绞索紧紧缠绕在他的脖子上。他拼命抓扯着，但金属残忍地划破了他的皮肤，直到他半昏迷地爬离门口才松开。他躺在地毯上，痛苦地哭泣着，意识到自己在怎样的一个陷阱中。狄魔高根渴求着岩德护身符，那是属于诸神的力量。而他，本·希顿，是取回它的人选，而恶魔领主绝不会让他在任务完成前逃脱。他难堪地抽泣着，爬回电脑桌的椅子上。他绝不想轻易屈服，但他根本看不到别的选项。他凝视着挂在显示器上方的墙上的日历。10月31日，今晚是万圣节。他原本应该和凯特一起参加派对的。他颤抖着按下按钮，启动了这台古老的、借来的机器。</p>\n<p>漫长的开机流程，曾经枯燥难耐，如今却简直成了一种救赎，成了他重新进入那个可怕世界的缓冲期。他现在希望启动再慢些，但此时一切却好像变得太快了。不久，他又回到了狄魔高根补丁的世界中。哦！他怎么会看不出那个标题的含义？这不是”狄魔高根补丁“，关于狄魔高根的一个补丁，而是狄魔高根本人的补丁！他再次激活艾眼，回到城堡，走向那些通往著名的死亡谷的陷阱门。进入墓地层后，他半是认真地希望什么吸血鬼或者食尸鬼能杀了他的角色，结束这一切，不管是什么形式。但他突然想到，如果他的角色死掉了，现实世界会发生什么事？他敢冒这个险吗？</p>\n<p>不管怎样，这似乎只能流于纯学术问题了，因为他一出现在视野里，墓地中的所有不死怪物都转身逃走。游戏信息显示，<span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>&quot;吸血鬼逃离你的铜质护身符! &quot;</span><em>自然如此</em>，他绝望地想道。毕竟，这块铜片不正标识着其佩戴者是某位可怕且深不可测的存在的奴仆吗？他感到筋疲力尽，仿佛护身符正在吸取他的生命。</p>\n<p>他的思考被一股奇怪的气味打断了。起初，他以为这只是他的想象，是受到了死亡谷层和其中所有尸体的那种腐臭氛围的影响，但他渐渐意识到那是真实存在的。他庆幸自己有借口站起来检查房间。当他拉开抽屉时，气味似乎变得更浓了；最后，他在最不想发现任何异常的那个抽屉里找到了气味的源头。那是他放置了毛巾包裹着的、被诅咒的仪式刀”神魔克星“的那个抽屉。它依然躺在那里，在布料的褶皱中闪闪发光，但那块白毛巾上却沾满了干涸的褐色血迹。他的脑海中闪回了那个可怕的头颅被安放在石头祭坛上的场景，以及头颅上那些破烂的伤口。他把抽屉狠狠关上，心脏剧烈地撞击着肋骨。</p>\n<p>他当然已经逃不掉了。他唯一的希望就是通关这个游戏。他努力继续前进，以创纪录的速度到达了葛汉诺姆的入口。他毫不在意地奔跑着，进入了前往地下世界的深渊巨口。在葛汉诺姆这个迷宫般的世界中，他发现恶魔们也在逃离他的铜质护身符。<em>难道就没人想杀我了吗？</em> 他有点歇斯底里地想着。他的游戏风格开始鲁莽起来，看看游戏敢不敢让他现在死去。事实上他几乎是在欢迎这样的结局了。某种意义上，这也是一种解脱。</p>\n<p>但他没有死成，而是最终到达了弗拉德之塔面前。塔中的低级吸血鬼逃离了他的护身符，而且很快便死去了。而弗拉德本人，对于一名准备充分的玩家来说从来就不算什么挑战，同样被迅速征服，交出了进行伟大仪式所需的第二件神器：祈祷烛台。</p>\n<p>在本的房间外，世界逐渐变得黑暗，但他继续玩下去，害怕自己再次入睡。下一个目的地是岩德巫师的巫师塔，所以他深入了葛汉诺姆的迷宫。至少岩德巫师选择拒绝逃离那块铜标记，与他进行了一场公平的战斗。然而，装备齐全的符号学家本很快就胜利了，从巫师的尸体上拿到了死亡之书。他感到与这具尸体有一种奇怪的亲近感，仿佛他的内在也已经死去。</p>\n<p>现在没有时间可以浪费了。他跑得更快，深入迷宫，对那些在他经过时颤抖的小恶魔毫不在意。他穿过了其他恶魔领主的私人领地：奥迦斯、朱比烈斯、阿斯莫德等等。这些可怕的存在都没有显露身形，它们更喜欢等待那些还没有被可怕的恶魔领主标记的、更有吸引力的猎物。最后，本来到了一个无法再下楼的层级；葛汉诺姆的底部。只剩在这层搜索这一个任务了。短短一阵之后，他找到了举行召唤仪式的地点：一个在他脚下振动的格子。</p>\n<p>在他点燃祈祷烛台、摇响开启之铃、阅读死亡之书时，一阵颤动似乎也传遍了现实世界。电脑桌旁落座的位置后面，一阵恶魔般的铃声从放在本床上的银铃中传来，但它并没有被凡人之手移动或碰触。随着它那诡异的铃声仁慈地逐渐停止，游戏中的地面爆裂开来，揭示出一条燃着烈焰的密道，这将通往他的最终目的地：邪恶的摩洛圣所。</p>\n<p>踏入世界底部，他并不惊讶地发现怪物们再度因他的铜质护身符而逃离。他咯咯笑着，看着强大的恶魔和吸血鬼领主为了通过狭窄的门而互相推挤。也许他已经有些精神失常了。无所谓了。不管会发生什么，这一切很快就会结束了。他来到内殿，与摩洛的高级祭司展开战斗。尽管这个邪恶的牧师至少有礼貌地站起来直面了他，但战斗结束得太快了。当本捡起地牢中最珍贵的宝物时，他几乎变得有些伤感。</p>\n<p><span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>Y - the岩德护身符</span></p>\n<p>高级祭司的尸体突然炸开，变成了一个魔法传送门。这是原本没有的情况。本心甘情愿地朝着传送门走去，已经差不多猜到它会通向何方。转瞬间，他被传送回那片邪恶的森林，出现在狄魔高根的石头祭坛前。当他看到紫色的”&amp;“站在祭坛后面时，他甚至没有感到惊讶。<strong>祂</strong>当然会在这里，准备迎接祂的胜利时刻。他期待着屏幕上会出现一段讲话，就像通常在与任务宿敌相遇时给出的消息那样。然而，显示器突然变得漆黑，比阴影更加深沉。一股邪恶的存在侵入了他的思维。他无法确定这是在使用言语还是根本就在将想法植入他的大脑。但当恶魔领主夺得那枚护身符的所有权时，他感受到祂那糟糕的欢乐。本感到喉咙被勒紧，他被赋予了更多的命令，更多的强迫。黄铜护身符将执行它主人的命令。它似乎与他的心跳同步地跳动着。</p>\n<p>屏幕清空，狄魔高根和护身符都从显示器上消失了。本知道它们去了哪里。他的潜意识中浮现的那张邪恶、带獠牙的柴郡猫笑容足以证明这一点。他努力让自己的思维远离那个可恶的心灵居客的注意。<em>他不会把凯特带到那片森林的！</em> 脖子上的护身符对他叛逆的思想威胁地扭动着。他的思绪转瞬间飞回到那块墓碑上，那是罗宾的安息之地，他是上一个惹恼了主人的符号学家。安息之地？对于这样一个被诅咒的生物来说，有什么安息可言呢？</p>\n<p>保持着头脑的空白，本操控角色离开任务层，返回其中一个装备储藏点，在命令下捡起神魔克星。镌刻着符文的黄铜护身符静止不动。他在储藏室的箱子里翻找着，从中拿出了被诅咒的仪式刀，放入了自己的物品栏。突然间，他迸发出一阵行动。他没有锁上身后的箱子，跑过整个楼层来到楼梯口。他感到喉咙被紧紧咬住，这表明他引起了怀疑，但他毫不思考这件事，而是跑到了相邻楼层的书店。痛苦变得难以忍受，但他必须找到解除诅咒的法术书！他被勒得眼冒红星，但他强迫自己的手指在键盘上移动。当他刚刚走到书店的门口时，护身符突然自己解除了对他的控制。困惑于这一意外事件，他迈出了另一步。</p>\n<p><span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>“一个火球从不知何处爆炸! -- 更多--”</span></p>\n<p>熊熊烈焰充斥了书店的房间。本难以置信地呆望着，按着空格键，看着一本又一本魔法书被火焰吞噬。最后，店主本人也被烧成了焦炭，整个房里只剩下灰烬。脑海中的笑脸嘲弄着他，而那个铜质护身符再次威胁性地扭动着。他半走半踉跄地穿过房间，来到真正的神魔克星所在的抽屉前。至少现在他知道是有不让事情落入主人手中的可能的，即使只是暂时。他凝视着这把被诅咒的刀锋。如果狄魔高根希望在森林中与他会面……那么本将带给他一个特别的礼物。</p>\n<hr>\n<p>下篇：<a href=\"/2024/demogorgon_patch_4/\">狄魔高根的补丁(4)</a></p>\n","prev":{"title":"狄魔高根的补丁(4)","link":"2024/demogorgon_patch_4"},"next":{"title":"狄魔高根的补丁(2)","link":"2024/demogorgon_patch_2"},"plink":"http://www.ephesus.top/2024/demogorgon_patch_3/","reward":true,"reading_time":"4460 words in 30 min"}