{"title":"狄魔高根的补丁(2)","date":"2024-06-23T15:41:53.000Z","date_formatted":{"ll":"Jun 23, 2024","L":"06/23/2024","MM-DD":"06-23"},"link":"2024/demogorgon_patch_2","comments":true,"tags":["AO3","NetHack","同人","翻译"],"updated":"2025-12-02T15:47:24.951Z","content":"<p>原作：greyknight</p>\n<p>译：Silencess</p>\n<p>上篇：<a href=\"/2023/demogorgon_patch_1/\">狄魔高根的补丁(1)</a></p>\n<hr>\n<p>裹上厚厚的外衣，本小心翼翼地藏好自己的右手。他的恐惧成真了，诅咒把仪式刀上牢牢地粘在他的手上，无论多大的力量也不能将二者分开。他走进书店，尽力想表现得一如平常。在昨晚的游戏中，他见到过一家商店出售魔法书之解除诅咒，可惜那本书他买不起。不过，神魔克星在现实世界的出现使他产生了灵感。那无疑是个疯狂的想法，但想想一把锋利的匕首正揣在他的口袋里，这件事本身就足够疯狂了。</p>\n<p>他先和认识的店员闲聊了一小会；在另一个顾客过来要求店员帮忙找东西时，他抓住机会走开了。本知道哪个书架上有几本圣经，于是他径直向那里走去。他翻开圣经，随便选了一段文字开始默读，虽然打心里觉得这样有点蠢。他完全不知道这么做有没有意义，但试试总没坏处。</p>\n<blockquote>\n<p>“待那蒙福的盼望，以及我们那伟大的神、救主耶稣基督荣耀的显现。他为我们献上自己，是为了救赎我们脱离一切罪恶，并且洁净我们做他自己特选的子民，做美好工作的热心人。”</p>\n</blockquote>\n<p>读到“救赎”一词时，他感到手心那把诅咒之刃的重量产生了变化，好像解开了某种束缚。到“洁净”时，那种束缚已经消失得无影无踪了，利刃也随之脱手落到口袋底部。庆幸着自己的机智，他放回了那册经书，离开商店返回了家中。一路上他小心翼翼，生怕自己不小心再摸上那把仪式刀。</p>\n<p>到家以后，他垫着块毛巾隔绝了与神魔克星的直接接触，然后战战兢兢地把它从口袋里拎出来。要是这玩意和游戏中的同位体有相同特性的话，它很有可能也会一不留神就自动变成诅咒的了。他拿毛巾把它包好，丢进抽屉里，试图忘记和它有关的一切。那天他没再玩NetHack。</p>\n<hr>\n<p>过了一段时间，其他烦心的事情分散了他的注意力，神魔克星的谜团也随之被抛到了脑后。他不愿再思考这种显然无法解释的事情。渐渐地，他又开始抽出些时间玩NetHack了。当到达任务层时，本颇感惊讶，因为符号学家的任务地点居然是在罗切斯特大学，他的母校？他饶有兴趣地和雷转遍了任务地点的第一层——是ASCII版本的主校区一角，还原度还不错。最后，他发现自己已经站到任务导师“科恩教授”的对面。</p>\n<p>他阅读常规的任务介绍，想看看补丁里符号学者命定的宿敌究竟是何方神圣。他完全没准备好面对导师提到的那个令人震惊的名字。但他找不了借口；答案一直就在他眼前，不是吗？他早该意识到他会在任务中与谁战斗。他早该准备好……面对狄魔高根。</p>\n<p>本心知肚明，尽管在数值上（角色的等级和阵营值）已经通过了游戏引擎的检验，他仍然没资格完成这项任务。对抗“老D”可是个艰巨的挑战。他必须先攒一些装备，嗯，很多装备。于是他离开任务层，投身向命运地牢的更深处。</p>\n<p>接着，一场残酷而毫无意义的死亡降临到他头上。关于雷的逝去没有什么伟大故事可讲，他丧气地想着。他们只是遭遇了一窝火蚁，正在杀出重围，可他那忠实的宠物在战斗中被他推挤开来，径直落入了坑洞陷阱，坑底插着的涂毒尖刺轻易夺去了这唯一战友的性命，徒留他一人面对地牢中的万千敌群。他怀着悲痛屠尽了剩余的蚁群，找来一块巨石填平了那个陷坑，然后取出一支闪电魔杖，把雷的名字烙印在这片新填的地面上。<em>安息吧，小家伙</em>，他默念道。</p>\n<hr>\n<p>来到地牢下一层，他发现了另一块奥术符文，这同样为他的角色触发了一次奥术充能。他很好奇自己的角色作为符号学家有没有办法利用这些奇怪的陷阱，但一小段时间的实验后，他没找出什么明确的结论。他的尝试被一个绿精灵打断了，它借着走廊的掩护朝他射出箭矢，昭示着自己的到来。本避开精灵的射击角度，躲到门后，只等敌人出现便突袭上去。精灵在一阵乱刺中倒下了——尽管又有个精灵从房间另一边的门里冒出来。本急中生智，凭着刚刚补充的魔力向这第二个精灵倾泻了一连串法术，于是它也倒毙在那块奥术符文所在的格子里，留下一个表示尸体的百分号（%）。本检查了第一个精灵的尸体，看看是否有有用的物品（精灵靴和精灵斗篷都是极好的魔法物品），然后走到第二个精灵身边。</p>\n<p><span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>“你踩上了奥术符文!  -- 更多--”</span> 游戏提示道。哎呀，本想。算了，反正多点法力也没什么坏处。他按下空格键。“<span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>绿精灵的尸体在一片火焰中消耗掉了! 血液覆盖了符文! -- 更多--</span>” 本坐直了身体。他完全没料到这个。这条消息并不像任何陷阱的文本，而更像是……更像是来自祭坛。更准确地说，这是献祭人类的文本。他把心提到嗓子眼，又按了一下空格。</p>\n<p>“<span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>狄魔高根出现在你面前!</span>”</p>\n<p>本没有被吓飞到盲目乱动真算他有自制力。相反，他立刻双手脱离键盘，让自己飙升的肾上腺素回归平稳。一头撞上狄魔高根这样的恶魔领主可能会导致角色的迅速死亡，也经常确实如此。他知道自己完全无法与屏幕中窥视着他的紫色“&amp;”对抗，唯一的选择只有逃离。他理性客观地检查了屏幕上的情况。谢天谢地，狄魔高根并没有刷在他的贴身位置，还有一线生机。他翻阅了自己的物品栏，脑中快速闪过各种可能性。由于阅读并不消耗游戏内的时间，他完全可以在下一回合前停下来慢慢思考。接着他找到了机会：他在上一层里捡到过一柄挖掘魔杖！太完美了。并没有急着动作，他又花了点时间检查了其余的道具。没问题，这毫无疑问是最安全的解决方案。他选定了挖掘杖，瞄准角色脚下的地面，然后挥动魔杖。他向下跌落……</p>\n<p>……接着落地，落到了安全的，没有恶魔领主的，下一层的大房间里。本当即长出一口气，这才发现自己无意识地屏住了呼吸。他保存了游戏，抽出一支红笔，在笔记本上记了个大大的警告，标记出这个让他险些没能死里逃生的、潜藏恐怖的楼层，又在上面连画两个圈，然后才关掉电脑，颤抖着爬上床。</p>\n<hr>\n<p>到了第二天，本有一种莫名的振奋感。鉴于NetHack的基本游戏机制，既然狄魔高根已经在游戏中生成过了，他就不可能再在其他地方出现。并且，考虑到本已经离开了这位大恶魔存在的楼层，那里的一切都会维持原样，直到玩家重返本层。也就是说，“老D”已经被安全地封印起来了。有了这些知识作保障，本一头扎进地牢深处，放心清理每一层的怪物，收集一切有用的物品。经过几天的游戏，他已经穿上了龙鳞甲，掌握了各种强大的武器和魔法。他觉得自己有足够的信心攻打城堡了。</p>\n<p>命运地牢的最底层是其特殊要素之一。恢弘的城堡层坐落在这里的巨型洞窟中，被一条与无人知晓的奇特地下海洋联通的护城河环绕着。抵达地图左侧的小迷宫后，本迅速解决了守卫在城堡吊桥外的怪物。他凝望着护城河对面的雄伟城墙，思考自己的进攻路线。用随身携带的号角演奏正确的曲调密令就可以打开城门吊桥；与以往的许多次一样，他稍微动点脑子就能推断出正确的曲调。不过，从吊桥上发起攻击有其危险之处，其中之一就是吊桥后塞满怪物的王座大厅。本戴上眼罩，使用心灵感应显示他所面对的敌军。</p>\n<p>不出所料，城堡里挤满了敌人。几只水生怪物一如既往地在护城河中巡逻。他扫视着自己的物品栏，目光落在了水上步行靴上。嗯，怎么不行呢？他暗下决定。后门的防守相对较弱，他可以从护城河的水面走过去，顺路消灭其中的原住民——再次检查了一下他的心灵感应，他欣喜地发现没有克拉肯——然后从背后发动攻击。他有几瓶飘浮药水，可以帮助他越过后门走廊上的陷阱门，然后他就可以从后方向王座厅施放法术和魔杖攻击了。</p>\n<p>他检查着现有的这些怪物，根据它们的强弱项策划他的攻势。他估计自己的寒冰锥法术对付王座厅的许多怪物都很有效，因此他从随身携带的书中重新记忆起这个法术。他做了一些其他的准备工作，穿上了水上步行靴，然后大步朝目标走去。护城河中的鲨鱼和鳗鱼迅速被他的+5剑击败，他闪电般地从后方攻入了城堡。一些卫兵穿过后门走廊查看发生了什么，于是本拔出魔杖，冲进后门开始大发神威。</p>\n<p>他迅速突破了通向城堡的防线。与大恶魔的短暂交锋刺激了他，促使他把武器和防具都攒到极高的水平。他仔细留心每个怪物的位置和动作，坚定不移地向前推进，消灭着沿途的一切生机。心灵感应在其中发挥了宝贵的作用，让他能及时察觉远处正在接近的怪物。等他到达了王座厅，许多前住民已经躺在走廊的地板上，成了战利品的一部分。本一边关注着自己的法力条，一边确认剩余怪物的位置和弱点，开始接连放出火球术、寒冰锥、魔法飞弹和其他法术。对那些有魔法抗性的怪物，他扔出了早有准备的附魔匕首，这些魔法锐化的利刃呼啸着，精准地飞向它们的目标。喝下一瓶治疗药水，本迅速欺入敌阵，提剑猛砍受伤的怪物残部。其中一只怪物，一位泰坦，给他带来了一些麻烦，但不久之后，本昂首屹立，胜利地成为了城堡的新统治者。<em>要是雷能看到现在的我就好了！</em> 他想道。</p>\n<p>他花了一些时间搜刮尸体，将所有的战利品按照类型和实用性分堆，王座厅里的宝藏堆积成山。他把最好的物品放进次元袋或主物品栏，无用之物则堆放在一旁，期望着之后拿着变形魔杖回来尝试变形。当然，最珍贵的物品之一位于城堡的一个塔楼里；作为城堡里知名的顶级宝物，它锁在一个箱子里，而箱子被其下岩石上铭刻着的伊尔碧绿丝的伟大真名所守护。</p>\n<p><span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>w - 许愿魔杖 (0:3)</span></p>\n<p>不过，本并没有急着做别的事，而是先把王座厅上了锁，防止其他怪物入侵此地，接着又脱下绝大多数装备放在房间正中的金色王座旁边，只留下几件必需品。他小心翼翼地坐上魔法王座，不知道会发生什么事。玩家都知道王座通常会带来各种离奇的效果，从帮助入座者到伤害他们都有可能。谁知道这版补丁会给王座添加什么奇怪的能力呢？</p>\n<p><span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>“汝之专命, 阁下…”</span></p>\n<p>是灭绝！王座最好最有用的能力之一。尽管没有许愿那样有用，但反正他已经拿到了许愿杖，没有必要太贪心了。有了灭绝效果，他可以选中几乎任意一种怪物种类，把它们从地牢中完全抹杀。他在坐下之前就已经想好了如果有机会灭绝的话要选什么。</p>\n<p><span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>“清除了所有的拟形怪.”</span></p>\n<p><em>该死的拟形怪。</em> 他之前遇到一家商店，里面藏着两个这种讨厌的家伙，时刻准备着扑向不幸靠近的冒险者。其中一个试图伪装成一本法术书，另一个则伪装成了楼梯。楼梯，真的假的？愚蠢的生物。他时常在想店主是不是和它们勾结好了；毕竟，只要有冒险者在商店里被拟形怪袭杀，掉落的财物都会被店主所继承。不管怎么说，即使他的心灵感应可以轻易识破这些变形者，它们的存在本身也会侵占商店中用于进货的空间。灭绝的候选名单上还有些其他怪物——特别是巫妖——但他已经计划好从几层楼上的储存基地里拿一张灭绝卷轴，再用圣水祝福卷轴来解决它们。</p>\n<p>宝座如往常一样消失了。重新装备好物品后，本仔细检查了自己的背包，然后选择了他的三个愿望。首先，当然是一张受祝福的充能卷轴，它可以为魔杖提供三次额外的使用机会。接下来是艾奇奥匹亚之眼。这件超凡的神器是巫师的任务神器，它可以赋予各种能力，包括魔法抗性和快速魔力再生。但本最喜欢的能力是，它能将他传送到遥远的楼层，赋予他不经过狄魔高根层而再次到达任务层的能力！</p>\n<p>实际上他现在就打算去了。他决定之后再使用剩下的愿望；他并不想把愿望都浪费在之后可能捡到的东西上。本把艾奇奥匹亚之眼安全地放在一个之前准备的袋子里，检查了自己的装备，准备激活这个神器。幸运的话，考虑到狄魔高根已经在主地牢中生成了，任务层的最后一层可能只会刷一些无名恶魔作为任务的宿敌。更好的可能是，本的任务神器也许根本不会任何怪物看守！</p>\n<p><span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>打开哪个地牢的入口?</span><br>\n<span style='color:#020202;background:white;font-size:14px;font-family:Consolas,方正像素12;'>任务</span></p>\n<p>回到大学，本先对自己施放了一个小型治疗术以回到最佳状态；艾奇奥匹亚之眼会感知到他不是巫师，因此每次激活时都会对他释放一些惩罚性的能量。但这仍然是值得的。完成恢复后，他径直走向通往任务层深处的楼梯旁边、考恩教授站着的地方。</p>\n<p>本不可能想到他的世界从这一刻起开始崩塌了。房间的地板上躺着考恩教授的尸体。谁干的？周围没有随机的怪物，也没有战斗的痕迹。本确定上次离开这个楼层时还一切正常，而他不在的时候所有的活动都理应停滞。他怀着忧虑再次搜索可能的凶手，但什么也没有找到。尽管心里仍然很紧张，他还是走下了楼梯。</p>\n<p>任务层以平淡无奇的方式推进着。他与侵占大学一楼的恶魔战斗，然后走向户外。这里的地图似乎与现实世界的大学校园不太一致，因为外面似乎被一片茂密的森林覆盖着，与建筑物密不可分。事实上，这森林也太茂密了，本根本无法从这些粗壮的树干中穿过。他打倒了一些自己够得着的怪物，然后决定取回之前存起来的一把斧头。从任务层主层返回时，他走过考恩教授莫名其妙的尸体，又感到了一阵不安。在主地牢中短暂步行后，他到达了之前的物品存放点，当即决定保存退出，上床睡觉。</p>\n<hr>\n<p>当晚，本做了一个怪梦。他徘徊在一片森林里，一片真实的森林，时间是死寂的深夜。可怕的声响从森林深处传来，他试图逃离，但他似乎一直在兜圈子。突然间，他来到一片空地上，空地中央有一张平坦的石桌，桌上放着一张卷起来的纸片，像是一张卷轴。他展开纸张，上面写着一条信息，他衷心希望那不是用血写的。数字……这意味着什么？他惊醒过来，意识到这些数字的意义。坐标。那是一个地点……<em>一个邀请</em>。</p>\n<p>此后的一整天，本一直在想那个梦。当然，他已经在电脑上查找了那些坐标，它们恰好位于不远处的一片森林中心。他希望自己有时间在白天前去；他一点也不想重演梦中的夜晚场景。但他又责备自己是个迷信的傻子，决定顺其自然。</p>\n<p>他到达那里时已经很晚了，但还好他想到要带上一把手电筒。电筒的光束在他周围的高大树木之间扫过，这让他倍感安慰。森林的布局不知为何让他觉得哪里有些熟悉。问题解决了，他想。很显然他之前来过这里，这就是他知道此地坐标的原因。是吧？也许只是游戏中的森林用什么方式唤起了他的记忆。他告诉自己，大脑是个很有趣的东西。终于，他来到一个被两棵大树挡住的地方，它们的树干互相交错，阻碍了他的前进。树的前面有什么东西在土里闪着微弱的光。他弯下腰，发现那是一支普通的箭矢。箭矢……他的血液一下子冷却了，脑海中突然浮现出一个画面。被两棵树挡住的路……那是他掉头的地方……他在那里被背后的半人马用弓箭袭击，然后一路战斗回去，脱离了任务层。</p>\n<p>但那不可能是他现在所在的地方。这个想法太荒谬了。对这支无害的箭引起的疯狂想法感到愤怒，他用力推动那些枯木，满意地看到它们吱嘎一声倒在地上。他向前迈步，深入森林。他要向自己证明，除了可能有几只松鼠外，这里没什么可害怕的。</p>\n<p>借着残月的映照，他来到一片开阔的空地。他拒绝承认这是他梦中的那片空地。甚至在他走近那张低矮的石桌时，他的大脑仍然坚定地认为这一切一定有一个合理的解释。即使石桌的一侧雕刻着难以辨认的非人类符文，这也无法使他动摇。这想法指引他看向桌面，看到桌上摆放的那个东西，然后他意识到自己正在看着什么。那一瞬间他失去了镇静，疯狂地逃回来时的路，逃离那个地狱般的森林，无形的东西在林间发出窃笑。他在某个地方丢掉了自己的手电筒，只能依靠月光摸索前行。在他身后，在那冰冷的石头上，弗雷德里克·考恩教授残破而血腥的头颅无神地望向这片夜色。</p>\n<hr>\n<p>下篇：<a href=\"/2024/demogorgon_patch_3/\">狄魔高根的补丁(3)</a></p>\n","prev":{"title":"狄魔高根的补丁(3)","link":"2024/demogorgon_patch_3"},"next":{"title":"记一场ToMENet中的死亡","link":"2024/BoMENet-arc"},"plink":"http://www.ephesus.top/2024/demogorgon_patch_2/","reward":true,"reading_time":"5310 words in 35 min"}