{"title":"Avanor游记：从充满恶性bug的粪作中艰难通关","date":"2024-05-22T03:43:58.000Z","date_formatted":{"ll":"May 22, 2024","L":"05/22/2024","MM-DD":"05-22"},"link":"2024/Avanor","comments":true,"tags":["Avanor","hxh","roguelike","实况"],"updated":"2025-12-03T07:18:09.571Z","content":"<p>投稿: H_Hedgehog</p>\n<p>故事要从一只没电又找不到充电线的鼠标说起，尽管我的旧ThinkPad有指点杆，但指望用那种东西玩即时制游戏还是太勉强了，毕竟在下不叫路明非。</p>\n<p>不过这也是玩老游戏难得的好机会，大概几个月前我因为别的缘故囤积了一批Roguelike——是那种画面由字符构成的回合制游戏，而不是有点随机要素就往自己身上贴标签的现代工业垃圾；在失去鼠标却充满无限可能的美好夜晚，我从存货里挑了款叫Avanor的游戏并毫无防备地开始了游玩，殊不知即将遭遇的……<strong>是堪称地狱般痛苦的游戏体验……</strong></p>\n<p><img src=\"files/Avanor/title.png\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>进入游戏要做的第一件事必然是rtfm，也就是读说明书；但这玩意上来就给了我个下马威，提示“在目录下找不到帮助手册”，然而手动切出去一看文件夹，手册安安稳稳地躺在该待的位置，居然还是用html写成的，也不知道程序为什么死活不承认它的存在；识别不出路径倒也无妨，直接本地用浏览器看甚至更方便。</p>\n<p><img src=\"files/Avanor/cant.jpg\" alt=\"Alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/see.jpg\" alt=\"Alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/manual.jpg\" alt=\"Alt text\" loading=\"lazy\"></p>\n<p>依据手册内容简单介绍一下Avanor，这是一款奇幻风格的角色扮演游戏，有着类似于ADOM（传统roguelike佳作之一）的操作界面，除了UI设计上“借鉴”不少之外，一些机制也几乎照搬，比如同样的DV PV（闪避和防御值）设定以及从Coward到Berserker的几种战术风格；不知道该不该庆幸，Avanor里的时间观念倒没有那么重要，因为不会有腐化或者以太病什么的赶着玩家跑，但考虑到各种崩溃、闪退、还有成堆的bug，一个存档的游玩记录越长就越容易永久损坏，某种意义上这个世界也算是危在旦夕，正在逐步崩坏之中。</p>\n<p>剧情方面相当老套，也禁不太住推敲和考据：阿瓦诺王国在古代十分强盛，而今它已没落，突然隆起的山脉围困住了王都以及周边一带，许多可怕的生物趁着阿瓦诺孤立无援之时大肆破坏，您作为幸存下来的英雄，将毫不迟疑的拯救王国于水深火热之中，解决这一前所未有的危机……真的吗？</p>\n<p><img src=\"files/Avanor/race.png\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>创建角色的过程比较乏善可陈，选择种族、性别、职业，再输入姓名后就完成了；种族并不丰富，总共只有7种，都是奇幻世界观中常见的类型，除了会影响初始属性的区间和最大属性的上限之外，还会影响角色对食物的评价；比如一份普通人勉强能够下咽的食物，野蛮粗犷的半兽人尝了会觉得是美味珍馐，而对食物极度挑剔的半身人尝了可能会当场呕吐，导致饱食度不增反降；另外还有一项速度属性也是种族决定的，但作者并未对不同种族设置不同数值就停止了更新。</p>\n<p>性别在那个年代流行的还是简单的二元论，Avanor中不存在“沃尔玛塑料袋”之类让玩家眼花缭乱的性别选择，男性会增加一点力量，女性会增加一点体质，仅此而已；所选职业会提供相应属性的固定修正值，并与种族共同决定玩家的初始装备和习得技能，例如人类战士会拿到长剑并拥有烹饪技能，而矮人战士则会得到战斧以及一项挖掘技能。</p>\n<p>听起来不错是吗？但设定得多么饱满，表现出来的就多么贫乏，因为游戏中压根就没有对这些选项进行任何描述，手册同样没有，仅仅介绍了各种技能；可绝大多数技能无法后天习得，玩家要是对某一技能感兴趣，就必须控制变量并不断创建角色，挨个尝试不同选项再到游戏里摸索效果，尽量获得较为理想的技能与属性；然而就像前面提到的，不同类型的选项之间还会产生组合效果，这极大地提高了猜测难度；我是怎么能了解得这么清楚的？因为后来迫不得已把它的源码翻了个底朝天……往下看吧。</p>\n<p><img src=\"files/Avanor/village.jpg\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>玩家的初始位置处于一座村落当中，那些由#号构成的方框就是房子，东边有一条汇入湖泊的小溪，桥对面则能看见不少强盗；村子里有一家食品商店，货物种类不多，无非是大中小三种口粮（Ration）以及精灵的旅行面包（Waybread），这种食物的辛达语名称更广为人知，叫兰巴斯（Lembas），正是《指环王》里那种轻巧又抗饿的美味旅粮；食品的物价在Avanor中相当低廉，最贵的旅行面包才卖15金币，让人不禁怀疑隔壁萨鲁曼是否真的实现了工业化，不过刚开局玩家穷得叮当响，也只买得起一份就是了。</p>\n<p>手册里关于商店的介绍相当有意思：在邪恶降临这片土地之前那个更加幸福的时代，店主很乐意让人们捡起想要的全部东西再一并交钱，可某些流氓和恶棍利用了店主的善意，所以阿瓦诺的商人行会制定了条规则，您必须在捡起任何一件货物后为其付款，别想再装满购物篮后就逃离商店；换个角度理解其实等于允许零元购但是限购一件，只不过玩家没有给钱便离开商店的话，店主会计算玩家的债务利息并在下次要求一同支付。</p>\n<p>还有一种……姑且称之为特性吧，角色能够直接吃掉地上的可食用物品，不需要捡起来，而未拾起的物品就算消失也不会计入玩家的“购物篮”，这恰巧跳过了交易的检测环节，即使在店里吃到撑也不用付出任何代价，甚至把其他地方捡来的食物卖给店主后再吃掉也未尝不可；药剂卷轴等消耗品并不包含在食物当中，必须捡起来才能使用，对比下来这条特性似乎成了种防止玩家饿死的低保，然而考虑到获取食物的轻松程度，还有赶路过来的时间成本，这多半是项漏洞。</p>\n<p>本来我寻思着自己捏了个纯近战向的矮人战士，砍上几名新手村外的强盗那局势应该是一面倒才对，事实证明这完全正确，的确是一面倒的单方面爆杀，只不过倒下的人是我。</p>\n<p><img src=\"files/Avanor/rip.png\" alt=\"Alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/first_die.jpg\" alt=\"Alt text\" loading=\"lazy\"></p>\n<p>出师未捷身先死，我就这样迎来了游戏中的首次死亡，愣是没想明白村口的强盗为何如此之强悍，幸好Avanor不像其他传统Roguelike那样会在死亡后强制删档，试错成本还处在尚可接受的范围内。</p>\n<p>介于跨过桥后强盗们便会主动攻击，走正路是行不通了，我只好在村里尝试与所见到的每位居民对话，试图获取有用的信息，但每次都仅能得到一句“你没有收到任何答复”的系统消息（后来发现是bug），直到我与村中长老交谈，他告诉我村子西边有个大家经常去采蘑菇的山洞，但前阵子一头恶魔占据了那里，湖泊南面说不定有人能帮上忙。</p>\n<p>对话系统做得稀烂也就罢了，最大的问题在于任务引导上，刚才这段指引内容在npc口中只会讲述一遍，并且因为可显示区域不多还是分段展示的，如果玩家没有看清或想再次确认，那么抱歉，长老仅会重复一句“那头邪恶的怪物仍然活着”；仔细思考前面的几句指引其实不难发现，长老是让我去湖泊对岸找人帮忙，但玩家要是读过手册会查看自己的任务面板，上面写着的却赫然是长老请求玩家杀死那头恶魔。</p>\n<p><img src=\"files/Avanor/first_task.png\" alt=\"Alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/Bug_GMSG.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>初入这个世界我没有考虑太多，下意识认为新手任务应该不至于离谱过头，洞里没准是只imp那类的小恶魔，会让村民烦恼也很正常，随即拎着斧头便准备下去大展身手。</p>\n<p>山洞离村子非常近，就位于突然隆起的山脉前，第一层安静得吓人，空空荡荡没有任何生物，我警戒着走向第二层，刚拐过个弯就看见了一道蓝色的身影，正是任务当中提到的恶魔；从看见它的瞬间我便开始发怵，字符&amp;在大多数Roguelike中代表的都是血统纯正的恶魔系怪物，绝对不是imp那类亚种可以比拟的，况且这家伙有名有姓绝对是大恶魔级别以上的存在。</p>\n<p>通常情况下玩家应当立刻掉头就跑，但我仍怀有一丝侥幸，将战术模式切换成完全防御状态缓缓凑了过去，万一对方是魅魔之类可以交涉的种族呢；在靠近的过程中，它的确没有突然暴起并以惊人的速度冲过来将我撕成碎片，反而当我不存在似的，自顾自地在那闲庭信步，直到我接近它身旁时才随手一击清空了我的生命值，说是清空但其实不准确，从负数来看，这一击造成的伤害是我hp上限的十倍有余；杀我对它而言就轻松得如同捏死只虫子，难怪之前忽视我的行动，一只虫子的存在与否确实不值得它放在眼里。</p>\n<p><img src=\"files/Avanor/demon.jpg\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>死亡接踵而至，一切又回到了原点，没有狗洞没有发疯的木匠，谁能料到新手任务要去杀死一头古代种的恶魔；也不知道这个世界中的蘑菇是不是什么硬通货，亚种就算了，连古代恶魔都来抢，更让人好奇的是这村子究竟有何神通，居然能在周围这群煞星手下平安待到现在。</p>\n<p>眼下最重要的是寻找出路，我四处转悠，很快在村子南边发现了一座通向湖心的小桥，走到尽头能够看见一扇传送门，我隐约回想起长老曾说过南面和湖泊，便义无反顾的走进了传送门中，转眼间我来到了一处充满建筑物的地方，后来才知道这是王城。</p>\n<p>出传送门往东走几步就能看见一座大理石建筑，里面有黄金砌成的地板与同样是黄金铸成的栅栏，在它们之间的，是一团被称为永恒烈焰的不灭之火，旁边站着的则是被称为火焰之主的魔法师；从介绍文本中得知他还是国王的顾问，然而这样一位实力高强又有权有势的大人物现在却满脸忧愁，与他对话后了解到有名邪恶的法师需要被消灭，目标就位于东南方向的地下城中，地表上方则有着邪法师塔楼的遗迹。</p>\n<p><img src=\"files/Avanor/fire_task.jpg\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>能让皇家首席魔法师感到头疼，必然不会是什么省油的灯，事实上那名邪法师正是最终的反派头目，难以想象勇者刚出新手村就被安排去讨伐魔王，关键在于这魔王还不是一般的近，简直是刚出油锅又入火坑。</p>\n<p>王城当中有一家消耗品店，出售各种卷轴药剂还有魔法书，值得一提的是Avanor的法术系统与ADOM大相径庭，ADOM中阅读有次数限制的咒语书可以获得咒语知识，施法会消耗它，而知识一旦消耗完毕该咒语便无法再次使用，必须寻找新的咒语书来读；Avanor中的魔法书只能阅读一次，但习得的法术并不会随着使用而遗忘，魔力没有消耗殆尽即可不断使用，找到同样的魔法书再次阅读则能够提高法术等级。</p>\n<p>两款游戏最核心的差异在于阅读书籍的成功率，ADOM中读书需要考虑职业、等级、技能、以及书籍状态，一旦失败就得承担包括物品损坏或者属性永久降低在内的负面效果；但Avanor只要玩家角色不是文盲便能够阅读任何书籍，读写技能仅影响阅读所需要的时间，安全区域中唯一可能中断过程的大概只有饱腹度过低，如果阅读中断，书籍并不会被消耗，吃撑之后再读便是。</p>\n<p>这样的设定让Avanor中物理系与魔法系职业的同质化程度相当高，职业不提供加成搭配上属性培养也不困难，玩家到了后期基本都样样精通，远近攻守兼备；作者意识到了问题，从待办列表中不难看出他在考虑为不同书籍加入最低的属性与技能要求，可这毕竟是款停已久的古董，有生之年恐怕都没办法看见它们被实现了。</p>\n<p><img src=\"files/Avanor/todo.png\" alt=\"注意Search and Hidden Door，后面要考\" loading=\"lazy\" class=\"φbp\"></p>\n<p>自王城向东南方向行走几十余步便能看见一处建筑残骸，顺着正中央的楼梯向下前行就抵达了地下城；虽然是邪恶大反派所在的藏匿处，但里面的怪物却意外适合初出茅庐的玩家练手，浅层怪物主要为骷髅还有老鼠蝙蝠之类的小动物，都是很常见的种类。</p>\n<p>到第二层我还遇到了只ghoul，它的攻击有小概率造成麻痹，隔壁ADOM也有这种怪物但拼写方式为ghul，新手碰上的话还算比较致命；同样在不少游戏里出现另一位“常客”叫作灰色软泥（gray ooze），ADOM与Nethack中的这种怪物会腐蚀武器和盔甲，至于Avanor里这小东西则是攻击带毒，以及不像ADOM的亲戚那样会自我增殖。</p>\n<p><img src=\"files/Avanor/poison.jpg\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>值得一提，Avanor的怪物间也有着仇恨关系，我曾在与一只老鼠搏斗时突然窜出来条褐蛇，但这条蛇不仅没有先攻击我反而一口咬向了同为怪物的老鼠，也算是意外之喜。</p>\n<p><img src=\"files/Avanor/hunt.png\" alt=\"R eat r\" loading=\"lazy\" class=\"φbp\"></p>\n<p>打怪升级的过程整体上还算轻松愉快，逛上三四层地牢就够我升到7级，只不过随处可见的陷阱实在是折磨人；陷阱依据其类型能够造成物理或者元素伤害，可对于前期的玩家来说，不管踩到什么种类的伤害陷阱，下场通常都是被秒杀，“Killed by fooself”则会被记录为死因；更令人头疼的是这游戏并没有几乎每款Roguelike必备的搜索功能，甚至连等待一回合的功能都没有，我自己摸索了好一阵子才发现拾取物品的操作可以在不离开原位的情况下消耗回合，勉强有了替代品。</p>\n<p><img src=\"files/Avanor/diedie.png\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>由于不能主动搜索，被动探测就成了唯一的办法，具体就是在可疑位置附近来回走动或是不断按下拾取键，如果陷阱被发现便会立刻失效，能够安全地经过或是拾取战利品。</p>\n<p>发现陷阱的概率取决于技能等级，玩家升级后可以获得少量改进点数，先不提将宝贵的点数投入到非战斗技能上是否值得，每项技能所能使用的点数存在上限，而这个上限需要通过相应行为锻炼才会提高，直到最大值15；换句话说，想要增加探测概率以避开陷阱，就得先找出大量陷阱积累经验。</p>\n<p><img src=\"files/Avanor/skill.jpg\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>与陷阱斗智斗勇已经不可避免，基于个人感受，它们主要集中在房间门后以及财宝室里，狭窄的走廊中通常不会设有陷阱，至少我的印象如此；最应当警惕的是平白无故躺在地上的宝物或装备，这些很可能是诱饵，或来自上一名踩中陷阱的倒霉蛋，必须要在周围仔细检查；由于怪物对陷阱没有豁免权，加上它们会主动捡起物品，我后来还有过在一格陷阱上捡到五六套装备的经历。</p>\n<p>当然，时刻记得在开门后不要急于冒进，说不定冲过来的怪物转眼就将旁边的陷阱踩了个正着。</p>\n<p><img src=\"files/Avanor/trap.jpg\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>随着我四处磨蹭，一路疑神疑鬼地走走停停，饱食度很快见了底，更糟糕的是我并没有在出发前买足补给，这下不得不品味一番舌尖上的地下城了；实际上这种环节是大多数Roguelike中的保留节目，通过食用某些特殊生物还能获得额外加成与能力，不过眼下最重要的还是确保自己别饿死；很遗憾我不是一只会做饭的矮人，也不会有精灵队友在一旁吐槽食材，所以怪物尸体只能生吃，连调料都没得放。</p>\n<p>这并不意味着Avanor缺少烹饪功能，如果玩家在某个固定层级捡到了烹饪套件，便可以把尸体加工成更优质的食物，具体是指停止腐烂，让尸体的营养翻倍，且重量至多变为原来的十分之一；无法后天习得的烹饪技能不是必须的，但相当重要，它会影响成功概率与消耗时间，玩家没有该技能的情况下，保底成功率只有30%；考虑到烹饪失败不会返还原料，以及购买现成食品的轻松程度，就算提升这项技能也相当吃亏。</p>\n<p>虽然做不出花式菜肴和满汉全席，但至少聊胜于无，估计还有项缺点在于没法修改食物种类，如果东西本身难吃到吐，即使经过烹饪也于事无补；我自己只在机缘巧合的情况下得到过一次烹饪套件，可惜那个存档后来损坏了，而我读到相关源码的时间远比我首次完成游戏要晚，所以当时不知道刷新位置的我就这么错过了它，没能将全世界有头有脸的npc做成料理装进背包通关可太遗憾了（不是</p>\n<p><img src=\"files/Avanor/cook1.png\" alt=\"Alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/cook2.png\" alt=\"Alt text\" loading=\"lazy\"></p>\n<p>第一种被我品尝的是老鼠尸体，尽管描述为tasty但明显非常难吃，角色哇的一声就连带着前几顿全吐了出来；接着我尝试了灰色软泥的尸体，能吃，可不提供抗性就算了，关键是吃下去也有毒；本来只是饥饿状态，现在不仅因为呕吐而濒临饿死，还因为中毒导致生命值也在蹭蹭往下掉，附近似乎仍有具僵尸的遗骸，但那显然不是活人该碰的食物。</p>\n<p>天无绝人之路，背包中还有部分战利品可供食用，几条老鼠尾巴，几片蝙蝠翅膀，以及成堆的骨头；事到如今也管不了太多，只能闭着眼睛都往嘴里塞，至于结果嘛，我成功的活了下来，虽然每件物品都回复不了多少饱食度，也谈不上多好吃，但架不住骨头实在是量大……不管饱，勉强能让角色别饿死；返程路上还碰到了能增加元素抗性的甲虫，无需多言，三两下就进了我肚子。</p>\n<p>靠着这些难以言喻的食物，我挣扎着爬回城里并填饱了肚子，由衷希望店主没有被我饥不择食的模样吓到；不得不承认，在浅层地城里因食物而走投无路时，抓几根骨头啃居然是最为保险的方案。</p>\n<p><img src=\"files/Avanor/vomit.png\" alt=\"Alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/bone.jpg\" alt=\"Alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/eat.jpg\" alt=\"Alt text\" loading=\"lazy\"></p>\n<p>清理完一定数量的怪物后，我带回了不少武器装备，甚至有一把秘银制成的刺剑，可惜并不如我手中的斧头好用，我也没有相关武器的熟练度；Avanor并不像大多数Roguelike那样有着BUC状态，同时无需对武器及盔甲进行鉴定，也就是说玩家不必担心装备上一件未知盔甲后，发现它不仅属性烂得要命还因为诅咒而无法脱下。</p>\n<p>卷轴与饰品却并不遵循这一规则，使用或鉴定前无法得知其效果，我面临的正是这样的问题，虽然没有会勒死角色的护符，但当时知之甚少的我并不敢贸然戴上未知饰品，生怕捅出什么大娄子；另外与ADOM一样，商店里出售的物品都相当于被鉴定过，玩家浏览后即使在其他地方遇见同种物品仍然可以将其认出，这点真的要比前辈Nethack方便太多。</p>\n<p>当我在商店中买下一张鉴定卷轴后，才想起来这名角色是没有读写技能的文盲，即便拥有卷轴也无法使用；手册中提过可以花钱找人学习读写，但并没有说明详细位置，我只好寄希望于在后续的流程中碰到那位贵人，并揣着一背包未鉴定的戒指与护符重返探索之旅；介于店主只会收购与其出售物品类型相同的物品，无法卖掉又较为沉重的盔甲等杂物则被我留在了一间空置的小屋中，毕竟Avanor也有负重过高会降低速度的设定，npc不会打开关上的房门，掉落物品也不会自然消失，所以能安全地往屋里存放物资。</p>\n<p><img src=\"files/Avanor/illiterate.png\" alt=\"关怀文盲，从现在做起\" loading=\"lazy\" class=\"φbp\"></p>\n<p>尽管猜到了装备没有诅咒与祝福状态，但获得水瓶后我还是忍不住想尝试制作圣水；在王城传送门往北走几步便能看到一座大理石教堂，里面有几排教堂长椅和一块同样是大理石砌成的祭坛，阿瓦诺的大祭司则位于旁边祈祷，与她对话只能得到“祝福着你”的系统消息，并没有什么任务或交互选项。</p>\n<p>基于Nethack式的制作方法，我先将水瓶放在了祭坛上，它们并没有表现出任何异常，我随即站在相同的位置使用了祈祷功能，一道耀眼的白光一闪而过，成功了？不对……我水呢？变不出圣水在意料之中，没想到的是水瓶直接成为祭品被献祭掉了。</p>\n<p><img src=\"files/Avanor/pray.png\" alt=\"圣水-&gt;不剩水\" loading=\"lazy\" class=\"φbp\"></p>\n<p>既然说到了教堂与祈祷，那就不得不提Avanor中的两位神明，Marduk（马尔杜克）和Tiamat（提亚玛特），都源自于美索不达米亚神话，隔壁Nethack里要夺回的Yendor护符在设定上即是马尔杜克的宝物，当然，护符的传说来自后人虚构；游戏作者可能受到DND等流行文化影响较重，将祂们简单地设定为了死亡与生命之神，如果玩家在游戏中杀死有生命的活物便会引起生命神的反感，消灭骷髅亡灵等不死族则能够增加祂的好感，死亡神设定上大致相同，只不过喜好完全相反。</p>\n<p>通过献祭高价值物品的方式也可以增进与神明的关系，并且不会惹恼另外那一位，对神的信仰越虔诚，可以向神请求的帮助也就越多，小到治疗轻伤，大到直接对玩家的敌人降下神罚；由于信仰上限远比魔法上限要高，走神官系职业的角色不仅能对自己进行源源不断的治疗，还能够向敌人释放出狂风骤雨般的远程打击，单论持久能力远比纯粹的魔法师要高得多。</p>\n<p>听起来似乎很强，但上面提到的一切都建立在拥有足够的信仰之上，毕竟帮助不是没有代价的，可信仰这东西并不像魔力那样会自动回复，必须得让神满意才行；反映到游戏中就是这不能杀那不能杀，捡到点值钱的玩意还得先考虑献给神明，更痛苦的是就算玩家想要与怪物和平相处，也改变不了它们仍然会主动攻击玩家的事实，体验下来估计相当折磨。</p>\n<p><img src=\"files/Avanor/help.png\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>还有个问题，游戏内的信仰系统并不怎么完善，能祈求的神术种类少得可怜，所产生的攻击与辅助效果经常是复用普通法术充数；事实上这部分也确实只是个半成品，根据作者在定义中写下的注释来看，Avanor本来应当还有“地”“水”“风”“火”四方神明，然而随着游戏的停更，这一切也化作了泡影。</p>\n<p>直到通关我也没有想成为神职人员的意愿，绝大多数时间跟两位神明的关系都非常差，幸好祂们胸襟宽广，不会拿闪电劈我，也不会派遣神使把我彻底抹去。</p>\n<p><img src=\"files/Avanor/deity.png\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>重新上路探索，我从王城离开后，在森林中一路向西穿行，本来只是想看看附近还有没有类似的地城，结果走了一阵子之后迎面撞上群强盗，虽然我的实力和装备都有所进步，但仍然寡不敌众被乱刀砍死；临终前我意识到了一件让我极度震惊的事情，<strong>这个世界，竟然是无缝连接的，而刚遇见的强盗也正是村口那伙人。</strong></p>\n<p>解释一下为何我会如此震惊，像是同样拥有完整世界的ADOM及其后继者Elona，它们都有两套地图系统，一张是用于快速旅行但是操作有限的大地图，另一片是更加细致，可供正常游玩的区域；两种地图的核心差异在于比例尺不同，大地图上移动一格相当于游玩区域走上数百格，但后者有着空间限制，即使两处地点在大地图上相邻，玩家也无法在游玩区域直接行走过去，必须经历走到区域边缘、选择离开、在大地图上移动、进入新区域这几个步骤。</p>\n<p>而Avanor并没有大地图，玩家能在世界中无缝访问各个地点，包括在同类型游戏中很难见到的地下城表层建筑，即便时至如今，拥有这一特性的Roguelike仍然屈指可数；新手村的那扇传送门真的相当误导玩家，让人下意识地认为游戏切换了地图场景，最终发现真相的震撼，与近几年发售一部RogueLite作品《Noita》非常相似。</p>\n<p>无缝的开放世界也为玩法带来了更多的可能性，比如能将追逐玩家的怪物引到城内交给守卫解决，又或者是在大片的林地中边跑边攻击，把敌人当作风筝拉扯；利用不会被刷新的机制还可以将多余的战利品藏匿在野外，不必像其他游戏一样担心进出随机区域后导致里面的物品消失。</p>\n<p><img src=\"files/Avanor/elona_map.png\" alt=\"Elona中的大地图旅行\" loading=\"lazy\" class=\"φbp\"></p>\n<p>读档后角色重新复活在了王城，还没从刚才的震撼中缓过神来的我决定先把自身的实力提上去，不然连探索世界的资格都没有，转头便带足补给到邪法师的地城里接着练级。</p>\n<p>向下深入的路途上基本没遇见什么麻烦，但在第5层走下楼梯后，周遭的环境突然一改画风，出现了极为广阔的空间；角色背后是面石墙，在昏暗的灯光下仿佛无边无际，眼前则是由黑曜石铺成的道路，似乎在引导着来访者前进，顺路走上几步便能听到潺潺的流……好吧，Avanor并没任何声音，音效全靠玩家脑补；忽略掉流水声，在前方静待玩家的，是条狂澜暗藏的地下河流，绵延的黑曜石凌空跨于两岸，通向一座规模庞大的地下宫殿。</p>\n<p>走过黑曜石构成的桥梁，推开地宫大门，一间地板同样是黑曜石铺成的前厅出现在了视线中；厅中没有任何陈设，空旷得让人感到不安，我在门口反复确认了许久，断定不可能有陷阱后才缓缓向里走去，打开第二扇门，藏在后面的是条狭窄且一眼望不到头的走廊，与外面的空旷形成了强烈的反差；我小心翼翼地继续前行，走到尽头隐约能看见大厅时才发觉到，有两名全副武装的黑骑士正守在出口，就如同等待猎物走进圈套一般。</p>\n<p><img src=\"files/Avanor/death_knight.png\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>它们一手拿长剑，一手持塔盾，浑身上下都被漆黑的重甲所包裹着，这正是邪法师的精锐部队，没有感情只崇拜死亡的杀戮机器——死亡骑士。</p>\n<p>我顿时如临大敌，摆好架势做足了与它们决一死战的准备，回合制的优点在此体现的淋漓尽致，玩家即便身处险境也仍然拥有充足的时间来思考；首先它俩处于我的左右前方，如果我率先发起的攻击不能一击必杀的话，将遭到敌人的双重反击，从装备来看这当然不现实，必须另寻他法。</p>\n<p>根据先前与古代恶魔交手的经验，可以推测Avanor中的高阶敌人不一定会具有压倒性的速度优势，而面前这两位显然是注重防御的重装战士，自然就更不可能拥有远超于我的速度；那么后退就是此时最佳的决策方案，狭窄的过道只能容下一人并行，势必只有一名敌人能够紧跟着追上来，并刚好阻挡在我与另外那名敌人之间。</p>\n<p>无论如何，这至少能让局面从二对一变得更加有利，要是死亡骑士的速度与我接近，那我甚至可以撤退到楼梯处再逃之夭夭；虽然某些敌人似乎会追着玩家上下楼，但现在不想坐以待毙也只有放手一搏，确认完战术模式是全力防御后，我便操纵角色猛地向后一撤，是生是死就看这一步险棋……吗？</p>\n<p>奇怪的是，身后并没有任何东西跟上来，我愣了一下，随即小心翼翼地又等待了数回合，才确认了根本就没有敌人在追，毕竟它们速度再慢也不可能连玩家的几十分之一都不到；我壮着胆子再凑了上去，两名死亡骑士仍然一动不动，静静地矗立在走廊尽头的两旁，好像刚才不过是只苍蝇飞来罢了；结合它们的行动与之前疏漏的事实，我心中大致有了种猜想，便试探性的朝着一名骑士的位置移动，果然，系统弹出了“您是否真的要攻击……”的提示，这死亡骑士竟然是彻头彻尾的中立单位。</p>\n<p><img src=\"files/Avanor/AhkUlan.png\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>也对，如果它们与角色敌对，那我走到尽头后再轮到其他生物行动的一瞬间，我便会身首异处，压根就没有继续思考的机会；捡回条命后总算是能把悬着的心放下来了，地宫的主人似乎并不打算加害于我，这番“盛情难却”之下也不免让人好奇后面究竟还有什么，眼前即使是龙潭虎穴也得闯上一闯。</p>\n<p>大厅中央是座黑曜石祭坛，跟周遭环境几乎融为一体，其供奉对象不用想都能猜到是死亡神马尔杜克；后边不远处有六名死亡骑士整齐的列于过道两侧，装备类型与之前那俩位别无二致，它们簇拥着游戏的反派头目，邪法师Ahk-Ulan；遇见大魔王也倒是意料之中，毕竟任务目标就是除掉这家伙，但整整八名精锐战士配上一名深不可测的施法者，我这样羽毛未丰的冒险者只有脑子不开窍才会动手。</p>\n<p>敌我实力悬殊，可试着交谈过后，这位大魔王居然也有求于我，他声称一帮法师摧毁了他的塔楼，他现在正为了复仇而积攒力量，需要玩家为他取得三块古代机器的部件，并答应事成之后给予丰厚的报酬。</p>\n<p>怀着复杂又矛盾的心情我原路返回了城中，苦思冥想也没搞懂正邪两方咋都喜欢给我这样一位无名小卒派任务，还件件都涉及到世界的危急存亡般重大；不过目前想太多也没用，邪法师我现在弄不死，古代部件找起来也没有一点头绪，到头来貌似依旧停留在原点。</p>\n<p><img src=\"files/Avanor/ancient_part.png\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>转念一想，邪法师完全不提部件位置，这说明任务设计者在潜意识里就笃定玩家能轻易将其找到，或者后续会有内容引导玩家；另外既然是邪法师委托我，那就表示部件所处位置对于他而言难以进入，而对我来说能够轻易抵达；结合这两种因素，嫌疑就重点指向了戒备森严的皇宫，虽然村子西面那座蘑菇洞也很可疑，但邪法师一人估计就能把那村里村外屠干净，不太可能将我当做战力派过去。</p>\n<p>所以眼下的首要目标是摸清楚王城，在教堂与永恒之火的东边就是皇宫，相较于邪法师朴素的藏匿处，这里明显更加奢华且富有生活气息；花园，餐厅，起居室等日常设施一应俱全，还能见到不少皇家守卫在各处站岗，但他们并没有对我在皇宫里到处晃悠提出任何异议，说不定是因为里面确实没啥好偷的。</p>\n<p>唯一让我在意的是皇宫花园的西南角附近，那里有处被守卫严密把守的下行楼梯，与他们交谈没法得到任何反馈，想下去的话战斗似乎不可避免，只好暂且作罢。</p>\n<p><img src=\"files/Avanor/king_task.jpg\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>到王座厅找国王对话可以领取到清理墓穴的任务，虽然这位君主身边同样有不少守卫护驾，不过这种奇幻世界里能位居一国之君，其自身实力必然不可小觑，本人很可能是前代勇者之类的人物，据我后来的交手经历，即便城内所有卫兵加上大魔法师和祭司也不会是国王的一合之敌，守卫更多是作为权力象征顺便起装饰作用；邪法师就算带齐部下估计也很难从国王手底全身而退，这可能解释了为什么他不敢主动出击而需要积攒力量。</p>\n<p>令人费解之处在于国王为什么不亲自去墓穴把入侵的不死族处理干净，这对他来说应当是举手之劳，或许是懒得动以及不想跟死亡神搞坏关系吧，另有隐情也说不定。</p>\n<p><img src=\"files/Avanor/crypt.jpg\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>墓穴位于王城的西南方，离邪法师塔的遗迹很近，地表建筑像是一座石丘；穿过甬道和几扇墓门就进入了大约是前厅的地方，此处现在充满了骷髅，它们察觉到活物存在后便一窝蜂地涌了上来，我起初应付得还比较谨慎，站在甬道里等它们挨个冲到跟前再逐一解决；可这堆没有武器盔甲且不知道腐烂了多久的骷髅实在是构不成什么威胁，攻击迟缓容易避开不说，即使命中了被防具阻挡后也产生不了多少伤害，我后来干脆换成狂战模式边往前冲锋边砍瓜切菜，结果hp都没怎么动弹。</p>\n<p>清理完表层我便顺着楼梯来到了地下，整个墓穴除去表层建筑后只有一层，里面看似空无一人但实际上却充满了各种幽灵系怪物，正常情况下玩家无法用肉眼看见它们，必须佩戴足够强力的see invisible戒指或护符才行；然而正如前文提到的，我这名角色是文盲，鉴定不出饰品，这导致隐形怪物对我来说相当棘手，只能将它们引到狭窄的墓道里，同时不断向空气挥斧以便“凑巧”击中这些鬼魂。</p>\n<p>然而事情并不总会按照预期那般一番风顺，地下的清理过程堪称胆颤心惊，各种鬼魂不仅行动诡谲，伤害还奇高无比；有时候拉扯不到位，砍了半天空气发现没鬼过来，有时候又不小心走得太深，直接被数只怨魂围殴，要是运气不好碰上几只特别厉害的惧魔（Dread），生命值三两下就能见底。</p>\n<p><img src=\"files/Avanor/tomb.jpg\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>光是看不见敌人倒也还能接受，更大的问题在于出现了极为严重的bug，本来只是十几级再升一级，可游戏在升级完成后依然反复弹出升级界面导致角色的等级一路飞窜至了近百级；刚开始我以为是技能加满后剩余的改进点数无法使用而造成的，毕竟这游戏前中期的等级提升速度高于技能上限的增加速度，但后续流程中该bug不定期触发，以及在新建的低技能角色上同样出现的情况否决了我这一猜想。</p>\n<p>结合触发bug的大致情形，似乎是输入过快以及移动键的问题，因为角色仅仅连升几十级就停了下来，差值范围远比类型错误以及死循环等情况要小；游戏会在升级过程中读取玩家输入用于技能加点，而升级前我正巧在不断按下方向键以砍杀怪物，Avanor推荐使用数字键进行全向移动并且不支持键位映射，但这台笔记本没有NumPad，所以大部分时间我都用方向键进行移动，那么很可能是我的输入队列卡到缓冲区影响了调用或表达式，让升级函数多执行了几十次；考虑到我和游戏之间隔着一层虚拟机和几套不同的字符编码，这一切也不是说不通。</p>\n<p>后来翻阅源码时倒没找到符合我这一猜测的相关片段，反而发现程序有块部分一直在监测等级最高的生物，仿佛有种惊天大阴谋的感觉。</p>\n<p><img src=\"files/Avanor/IncLevel.png\" alt=\"Alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/best_creature.png\" alt=\"Alt text\" loading=\"lazy\"></p>\n<p>嘛，就结果来看，我轻而易举地超越了等级的设计上限，这项数值大于50级再查看经验界面就只会显示一片漆黑；虽然技能全满后升级仅能依照属性增加些许生命与魔法的上限，但这样的bug还是极为影响游戏体验，我后续游玩中因为此漏洞在内的各种运行错误而重开过不下几十趟，不过为了叙述方便，本文还是尽量将其串成一场完整的旅程。</p>\n<p>杜绝类似的问题不太可能，最好还是经常保存（尤其在升级前），并对记录文件进行定期备份，尽管类似行为就Roguelike这种常是永久死亡的游戏而言较为“可耻”，但现在为了减少程序问题产生的损失也顾不上那么多了。</p>\n<p><img src=\"files/Avanor/max_level.jpg\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>幽灵系怪物无比难缠，好在角色可以随时退回地表恢复状态，毕竟任务没有限时，不断消耗之下还是艰难地完成了清理工作，可扫兴的是这些鬼魂没有形体，自然也不会掉落任何战利品；大失所望的我将目光投向墓中陈设，整座墓穴当中没有任何陪葬品能够拾取，甚至连装饰物都没有，除了建筑结构之外就只剩四丘坟墓，墓碑上刻有死者的姓名与生卒年份。</p>\n<p>意外发生于我脑子一抽后，鬼使神差般地对一间耳室内的坟墓按下了使用键，结果哐当一下掉出把长剑，这把剑在黑暗中闪烁着微光，一看就不是凡品；捡起剑后我整个人都懵了，因为这把长剑实在是让人难以置信的强悍，手中战斧骰满得到的最大总和，还不如这剑的伤害加成，再一对比命中修正，我的斧头仿佛成了根极为笨重的棒槌，另外长剑的属性增幅还能让我的力量和体质翻上近一倍，这些数值就算到后期都不太可能有其他武器超过。</p>\n<p>此剑名为阿瓦诺之防卫者，乃是该游戏中不可多得的unique item，这些独特物品大多都性能优异，固定生成且仅有一件；我拿到它之后脑子里没有开心或激动，想的净是得赶紧去把其他几座坟给掘了，说不定有整套盔甲和盾牌呢，结果是除了几根骨头之外一无所获。</p>\n<p><img src=\"files/Avanor/sword.jpg\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>说实话，我一周目里清完怪物就走了，并没有拿到这把神兵利器，后来重开的时候虽然在读源码，但也没有翻到与之相关的部分，能从四座坟墓中一次就选对这座靠后的，纯属机缘巧合。</p>\n<p><img src=\"files/Avanor/Rodomir.png\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>当作是同一场旅程吧，我兴冲冲的跑回皇宫交任务，没想到国王居然一眼认出了角色手上的长剑，并以打扰先祖安息为由，直接痛下杀手；作者整这一出也不知道该夸人心细还是说人恶毒，无奈，只好再次读档。</p>\n<p>将武器卸下藏回包里才能正常领取报酬，国王会感谢玩家并给予1000金币，再次对话还可以接到一项后续任务，他说几年前有名非常受信任的仆人偷走了一件强大的神器，Eye of Raa，那名仆人后来企图将其藏到南方的一处地洞里，但人们声称他在藏匿途中就被杀害了；国王希望玩家能够找到这件神器并带回给他，不过一件神器丢了几年才派人找，究竟是心眼大还是暗藏玄机，莫非这件神器就是邪法师要找的部件？当时的我不得而知。</p>\n<p><img src=\"files/Avanor/LootedTomb.jpg\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>路过塔楼遗迹，再向南穿过一片密林便可来到地穴上方，如果再往前走一段的话可以看到环形山脉的南部；地穴没有什么显眼的地标，看到下行入口直接走过去就行，然而，即将迎来的是游戏中<strong>最为折磨的部分</strong>。</p>\n<p>地穴主要有两种类型，一种是房间式的地下城，另一种是不规则状的洞窟，但里面的怪物类型倒没有什么差异，主要威胁来自于妖精（goblin），他们的装备良莠不齐，有全身上下都被精金秘银所包裹的，也有装备栏位还空着的；危险之处在于这些家伙拥有智慧，不仅会从地上拾取武器盔甲并替换穿戴物品，还会主动喝下隐形等药剂为己方在战斗中增加优势，甚至能向玩家一样对神明祈祷和献祭。</p>\n<p><img src=\"files/Avanor/ShitCave.jpg\" alt=\"Alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/WiseMonster.jpg\" alt=\"Alt text\" loading=\"lazy\"></p>\n<p>怪物的ai和背包系统并不是问题的元凶，这种合理的强度反而能为游戏增添趣味；真正值得诟病的是随机地城的设计，我初见时幸苦杀穿整座洞窟后并没有找到什么所谓的神器，对着截图回忆了一番任务文本才猛然领悟到了“one of the caves”和“was killed while hiding it”的含义；一座地穴约有十层，而这样的地穴有整整三座，那名仆人可能死在其中的任何一层，并且怪物会拾取装备，这使得玩家必须地毯式清空每个层级的每个角落，一只怪物都不能放过。</p>\n<p>从todo list不难看出，搜索和暗门属于未实现的内容，然而玩家却可以在地城中遇到完全密闭的房间，直接被困死；算上初见清了两趟，地图生成错误又再找了几趟，通关又是一趟，累计下来我估摸着扫荡了百余层地牢，这个战绩放到隔壁Moria（以流程拖沓而著名）都够通关了；我也是从这一阶段开始被迫审查源码以继续游戏。</p>\n<p><img src=\"files/Avanor/GelatinousCube.jpg\" alt=\"paralyzed！\" loading=\"lazy\" class=\"φbp\"></p>\n<p>无独有偶，Avanor也有gelatinous cube（凝胶方块）这种怪物，且在随机地城中大量分布，它不像在其他游戏的表亲那样人畜无害，而是能麻痹玩家后继续攻击并叠加麻痹效果，直到死亡，在生命值因为升级bug而来到四位数时，它仍然可以一套连招让角色直接去世，丝毫没有还手的机会。</p>\n<p>处于麻痹状态时，玩家无法进行任何操作，甚至无法键入退出游戏的指令，想主动读档都做不到，只能拍空格以继续显示战斗消息，主打一个无助，过高的hp又使得该过程变得更加漫长，我后来都养成了在被麻痹时干脆重启整个虚拟机的习惯。</p>\n<p><img src=\"files/Avanor/1kHP.jpg\" alt=\"paralyzed！\" loading=\"lazy\" class=\"φbp\"></p>\n<p>应对方法也有，那便是佩戴free action类的饰品，先不考虑当前角色是名文盲，无法识别出道具功效，即使正确佩戴了相关饰品的情况下玩家依然可能会被麻痹，因为饰品提供的抗性强度是一个随机值，而该数值不会直接展示，想判断强弱只能通过在店里试图出售的方式查看价格，价高者的效果自然更好。</p>\n<p>但Avanor并没有类似于Nethack那样能对装备起别名的功能，如果玩家移动高属性饰品时没有清空同类物品，那么它们会直接混到一起，得手动再次鉴别；我后期嫌麻烦，把两个戒指位和一个护符位全装上了free action，以量取胜且干脆不换了，毕竟其他攻击的致死率远远无法相提并论。</p>\n<p><img src=\"files/Avanor/resist.png\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>头几回我都无功而返，不是杀到最底下啥也没找着，就是走一半到了死胡同，所以便打起了其他地方的主意；从已知的情报来看，被山脉围住的区域里西北角是村庄，东北角是王城，东南角则是森林地穴，那么西南方向有什么呢？于是我转头一路向西，途中除了密林之外别无他物，相当单调，最终在横跨了大半个区域后遇上了一群orc（半兽人），他们看到孤单的旅行者路过自然是不分青红皂白的攻了过来。</p>\n<p>开放世界的好处体现出来了，尽管这群半兽人在前中期都相当致命，但只需稍微往北跑上一段路就会见到一座军营，而这里的士兵与半兽人有仇恨关系，玩家可以利用他们御敌或者脱身，运气好还能渔翁得利，趁乱捡些死者的遗物。</p>\n<p>这里有家武器店，允许出售和购买武器，如果与守卫队长交谈将得知他一直在担心半兽人们会随时攻打过来，玩家消灭掉所有敌人则可以得到一柄独特的匕首，名为Death Hack，除了基础属性不错之外，对恶魔还有整整三倍的额外伤害加成，难怪新手村长老让玩家到湖对岸寻求帮助。</p>\n<p>拿到它的过程也挺有意思，当时的军营被半兽人们杀了个片甲不留，而我再经过此地时已是一身神兵利器，非常随意的就报了曾经的追杀之仇，找了几圈没有看见队长的遗物，还以为任务失败了武器不生成，没想到临近通关回王城的时候，在护城河外见到了这名踌躇不前的逃兵队长，他交出匕首的那一刻仿佛放下了千斤重担，也不知道是什么支撑着他横穿整片地图，从最西跑到最东边，希望他之后能以普通人的身份，回到城内与家人团圆吧；纵使我能直面源码，知道这只是npc随机移动的结果，但程序生成的情节加上脑补，依然是这类游戏最为迷人的特点之一。</p>\n<p><img src=\"files/Avanor/barrack.jpg\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/DeathHack.jpg\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/DemonSlayer.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>营地上方的一排房屋中，最左边那间有条下去的路，通向一层似乎是牢房的地方，在源码中被标记为“老鼠地窖：1”，虽然有个数字但并不存在第二层或者其他的地窖（与墓穴相仿），也许是本打算在未来进行拓展的内容；里面确实有非常多的老鼠，还固定生成两只鬼魂，错综复杂的小道后面能找到一箱武器盔甲，旁边还有口箱子则装了一大堆魔法书和卷轴，唉，只可惜吾乃文盲，目不识丁。</p>\n<p>四角的大房间内还固定能找到一件森林兄弟……或者说绿林好汉的披风，很可能来自被处极刑后遭到老鼠啃食的受害者，它的防护能力约等于没有，我头回见到的时候还差点当垃圾给扔了，但它却是件定义在unique item当中的独特物品，关于它的用途与故事，则暂时先留个悬念。</p>\n<p><img src=\"files/Avanor/under_barrack.jpg\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p><s>离开军营往南，略过那群半兽人之后将看到一座残丘，上面本该有个入口能直通半兽人洞窟，但它只存在于作者的todo list，并未实装至游戏；</s><br>\n弄错了，后来读源码发现那个入口通往独眼巨人巢穴，翻山进去击杀boss可以得到全游戏最重的武器：黑曜石大棒，质量为8000游戏内单位。</p>\n<p>往西是环形山脉的一部分，无法逾越，但如果顺着山脉的走势往北前进，小心翼翼的穿过湖泊与山体夹缝之间的窄路，就又回到了新手村，没错，虽然看似不可通行，但湖泊旁边确实有条小路可供行走，并且这条路靠山的一侧还有处通往矮人王国的密道。</p>\n<p><img src=\"files/Avanor/OrcHill.jpg\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/SheeVoo.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>L:PDC3于源码中的完整描述是&quot;Path to the Dwarven City Level 3&quot;，需要穿过6层这样的地方以抵达矮人王国，并完成那里的任务以获得pickaxe（十字镐）用于挖掘墙壁；但眼下在接任务的半路上遇到了完全闭塞的房间，陷入了拿不到镐子无法前进，无法前进就拿不到镐子的死循环。</p>\n<p>不死心的我拾取了半天空气也只搜出了一个无关紧要的陷阱，周围的墙壁依然纹丝不动，这种地图生成问题曾在之前的随机地城出现过，获取镐子的主要原因之一便是需要挖开那边的洞穴；现在的情况约等于宣告死档，只能重开，缘由可能是作者打算添加隐藏门，改完生成机制后忘记相关功能还没做就直接发布了游戏。</p>\n<p>除了十字镐这件工具之外，还有一项挖掘技能，该技能无法后天习得，只可通过开局创建角色时选择矮人或地精时自带，我一度以为缺少技能便无法使用相关工具，还庆幸自己刚开始就选对了种族，不过后来阅读源码才了解到，技能仅会加快挖掘速度，并不影响能否进行挖掘。</p>\n<p><img src=\"files/Avanor/PDC3.jpg\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/HiddenDoor.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/SKT_Mining.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>从叙事角度考虑，还是当作一切正常继续把故事讲下去，路上都是些常见的怪物与陷阱，随着深度而逐渐变得更加危险，快到目的地时还能捡到烹饪套件，没有看见的话多半是被妖精什么的捡走了，需要满地图追杀。</p>\n<p>矮人之城相较于人类的王城显得十分朴素，大体上都是灰白色的岩石基调，规模也小不少，路过居民区和中央广场的生命祭坛就抵达了矮人王的居所；另外城里有位铁匠特别容易错过，通常他会呆在商店旁边的屋子里，但他也可能和广场上的人群混到一起，我通关后翻阅npc的对话文本才发现有这么号人，花钱可以让他为武器添加元素伤害，以及对半兽人的额外攻击倍率。</p>\n<p><img src=\"files/Avanor/DwarfCity.jpg\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>与矮人王对话将接到收复矿坑的任务，不过这家伙的脾气非常暴躁，没完成任务再与其对话时他会让玩家滚出去；矿坑里倒没有半兽人和炎魔，全是从岩石中渗透出来的神秘毒气，玩家需要前往最底层启动一台气泵把毒气抽干。</p>\n<p>设计比较蠢的地方在于它纯粹是个“数值检测器”，任务未被标记完成前每走一步都有概率会强制扣上2到7hp，不存在任何豁免，尽管游戏中有着毒素抗性和魔法戒指等各类道具，玩家能做的却只有走上一段再喝口治疗药剂让生命值别见底，要是恢复能力足够高甚至连喝药都免了；毒气矿坑因为可以稳定掉血且没有怪物，刚好还非常适合刷恢复技能的等级上限，代价只是几份食物和一点微不足道的时间，就可以将上限刷到最高值，突出一个无脑粗暴。</p>\n<p><img src=\"files/Avanor/GasDamage.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>完成任务获得十字镐之后也没什么留在矮人之城的必要了，本来打算立即动身，但矮人王右手边紧锁的门扉勾起了我的好奇，门旁一左一右两名精壮的矮人战士更凸显了它的不凡；靠近后玩家会立即遭到他们驱逐，可我现在不仅神剑在手，数值也经历了相当的积累，警告只当作耳旁风，毕竟此处不光没有了利用价值，矮人王的态度还十分恶劣，早就看不顺眼了。</p>\n<p>随着我一脚将门踹开，两名门卫意识到劝说无果，挥舞着兵器就和其他士兵一起攻了过来，可这些攻击要么被闪开，要么被防具阻挡了绝大部分伤害；我三下五除二解决了他们，顺着前方的阶梯走下，展现在我眼前的，正是矮人王国的宝库，但遍地的黄金与宝箱之间，潜藏着大量的传送及其他陷阱，不幸触发便会被转移到没有出路的幽暗洞穴中，万一没有挖掘工具，将会活活困死在洞里，不得不说很有矮人作风。</p>\n<p>抛开那些司空见惯的财物装备，宝库中最为让人惊喜的是一块古代机器部件，正是邪法师苦苦寻找的三件之一，结合门外的状况，几乎可以断定皇宫花园那处被严加看守的地方就是王城宝库了，里面多半也有古代部件。</p>\n<p><img src=\"files/Avanor/DvTr.jpg\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>简单的置换一下身上的盔甲，又挑了点暂时还看不懂的魔法书带走，这座宝库便搜刮完毕，返回刚才的事故现场，门卫尸骸仍倒在血泊之中，虽然逻辑上是进门时他们对我先动的手，但在我“不正当防卫”后，角色依然与整个矮人王国产生了敌对关系，场外的其余士兵甚至市民都在蜂拥而来；令人啼笑皆非的是矮人王非但没有率先发难，反倒逃去了墙角，可惜游戏没有更详尽的姿态描述，是否在角落瑟瑟发抖我们无从得知，姑且当作他是担心腹背受敌吧，哈哈。</p>\n<p>战斗过程没什么可说的，几乎一面倒的屠杀，唯一一点小插曲大概是有名士兵喝下隐形药剂，让我不得不与空气搏斗一番；矮人王虽然躲挺远，但其战斗能力依然大于所有卫兵之和，交战过后我的hp定格在了164/267，损失的近一半生命值中，估计90%都是由他造成；npc的战斗ai要是懂得合围，重伤后撤，利用远程击破走廊战术，那鹿死谁手还不一定，眼下这帮乌合之众可改变不了我完胜的局面。</p>\n<p>不出所料，堂堂矮人王者果然有不少独特装备，最为引人注目的是一柄重1200单位的巨斧，该重量相当于10件钢铁鳞甲，其威力自然不言而喻，除此之外还有一顶王冠与一面Torin之盾，它们穿戴后都能够增加属性，尤其是体质方面。</p>\n<p><img src=\"files/Avanor/TorinAxe.jpg\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/easy.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/kill_DwarfKing.jpg\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>遗憾在于我最不缺的便是体质属性，因为初始种族选择了矮人，不但体质基础值高，还可以安全地通过食用怪物尸体继续增加，更重要的是在我随机地城的战利品中有一双“至高王之靴”，它能提供整整25点体质，此数据比穿戴矮人王全套装备的加值还高，可惜这双靴子仅是带有高级词条的随机物品，而非独特的unique item。</p>\n<p><img src=\"files/Avanor/eat_werewolf.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/highking_boot.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>离开了矮人王国，准备利用传送门快速回到王城，虽然西侧小路可以直接抵达村庄，可湖泊东面的那片未知着实引人好奇，于是我向东从军营与湖泊之间穿过，打算绕湖一周从村子正门回去。</p>\n<p>没走出去多远，一座模样怪异的建筑出现在了面前，似乎有几分眼熟，凑近之后猛地一拍脑门想起来了，这不就是邪法师塔楼的完好无损版吗；顺楼梯上到塔顶，见到位名字非常日系的精灵巫师叫Yohjishiro，与她对话可以花500金币学习识字，没错，我几乎把整个世界绕了一圈才终于在回到原点的时候摆脱了文盲身份，而此时背包里的金币已是数以万计。</p>\n<p>很大程度上要怪角色视野不足，巫师塔就位于军营东北方向不远处，甚至开局都可以非常安全地从小路绕过来，但我却三番五次与它失之交臂，并因为不识字而在冒险之旅上吃了许多暗亏；除了能教识字以外，这位巫师还可以为玩家鉴定携带物品，而代价只是一条老鼠尾巴或者一片蝙蝠翅膀，还记得我曾在初出茅庐没有食物时而吃过它们吗？这相当于我在把珍贵的全背包鉴定卷轴当饭吃。</p>\n<p><img src=\"files/Avanor/jp_wiz.jpg\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/jp_need.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/jp_iden.jpg\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>那两样东西倒不是说有多难得，顾名思义只要杀老鼠和蝙蝠就有可能掉落，而且概率高达整整四十分之一（捧读），问题是这两类生物几乎不会在中高等级的地城中出现，如果专门为了刷它们而前往没什么经验的低级地城又十分吃亏，显然是种仅对新人友好的机制，使得我如鲠在喉般难受。</p>\n<p>与之类似，军营中还有条叫Gekta的大狗，给予骨头后它会从地里刨出一些东西作为回报，可由于军营被半兽人血洗，我直到通关后翻阅源码时才留意到这一隐藏功能。</p>\n<p><img src=\"files/Avanor/bat_drop.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/Gekta.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>识字后终于可以让积压的卷轴与魔法书派上用场了，虽然看书学了很多乱七八糟的的法术，不过真正常用的却只有鉴定术与无属性的魔法箭，前者用于探索时辨别高价值战利品，后者适合在绝大多数情况下作为远程辅助手段。</p>\n<p>绕着湖泊来到村庄正门，作为新人杀手的强盗们依然是二话不说就杀了过来，可对如今的角色来说犹如以卵击石；将他们当靶子试验完新法术后，在其掉落物里居然发现了绿林好汉的披风，与我之前在军营地下室捡到的unique item一模一样。</p>\n<p>结合他们在村口却不攻击村庄的情况，这些所谓的“强盗”应该是劫富济贫的绿林好汉才对，那军营地下室里的鬼魂是他们的同胞吗？为何只留下了一件披风，有人成功逃脱了吗？两口宝箱是原有的储备物资还是哪次行动被缴获的赃物？当地正规军与他们还发生过哪些摩擦？悬念太多让人一头雾水，但完全有理由怀疑这是什么依托于物品的碎片化叙事。</p>\n<p>看着眼前的披风，我突然冒出了个大胆的猜想，随即将角色的服饰卸下，换上捡来的绿林披风，并试着朝着角落残余的“强盗”走去，结果如图设想一般，他们居然真的没有再主动发起攻击，伪装成功了；虽然一周目我不小心杀了他们不少弟兄，但后来我专门戴上隐形戒指，不伤一人的情况下将他们同伴的遗物送还了回去，意想不到的是他们竟然对我放下的披风进行祈祷，然后把它献祭给了死亡之神马尔杜克；虽然我知道这是npc处理多余物品的常规行为，但我更倾向将其认作是送还失物，悼念亡者的一种仪式。</p>\n<p><img src=\"files/Avanor/rip_brother.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/ForestBrother.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>山洞里的恶魔老朋友也当然不能忘记，经过数座地城洗礼，现在的角色早已今非昔比，不费吹灰之力便可手刃仇敌，考虑到手上盗墓弄来的先王剑对它也有额外伤害，最终斩杀恶魔只用了两刀。</p>\n<p>这头邪恶生物的尸体似乎化为了飞灰，掉落物仅有一枚戒指，名为“伟大元素之戒”，游戏内没有途径显示物品描述，但从源码中可以了解到它提供几种元素抗性与看破隐形，具体数值以毕业装的角度还算过得去，不过为了预防麻痹至死，大多数时候我并不戴它。</p>\n<p><img src=\"files/Avanor/kill_demon.jpg\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>恶魔所在的一层有两处向下的道路，一处通往钴鬼（kobold）洞穴，另一处通往蘑菇山洞，先不提我没有草药学技能，摘了蘑菇也没法加以利用，光是站在这鬼地方就有概率永久降低角色的属性，也不知道恶魔和那些村民怎么会看上这种凶险之处。</p>\n<p>至于隔壁自然是有成群的钴鬼，细分下来还存在萨满和弓箭手等远程杂兵，对初期玩家应该算不小的威胁，然而它们的掉落物基本上都是些破烂，源码里也表明此处仅会生成一只没有特殊装备的头目，但玩家都有能力击杀恶魔了，实在是想不出有什么来这探索的理由，或许让下去的玩家倒霉就是它唯一的意义。</p>\n<p><img src=\"files/Avanor/misc_cave.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>村里的待办事项全部解决，向长老报告完成情况，好，如我所料没有任何奖励，毕竟恶魔已经“给”过戒指了，然后……然后游戏就又崩溃了。</p>\n<p>不过这次崩溃与以往的任何一次都不同，它非常稳定的出现在与长老交谈的瞬间，如果不交任务那么大家相安无事，但一旦对话游戏程序便会炸成一团灿烂的乱码，找不着解决办法，报错信息也看不出个所以然，倒是视觉冲击力相当震撼；翻了翻源码，发现既没奖励也没后续任务，那少听一句感谢也损失不大，其他任务别出问题就行，可墨菲定律告诉我们，越担心什么它就越有可能发生，等着瞧吧。</p>\n<p><img src=\"files/Avanor/crash_elder.jpg\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>既然已经提到了程序崩溃，就顺便再说说存档损坏的情况，问题出在保存进度是通过直接覆写存档文件完成的，没有创建副本；本来无伤大雅，但这游戏有概率在储存时崩溃，而文件覆写中断会导致格式失效并无法再被读取，意味着永远丢失进度只能从头再来。</p>\n<p>储存时坏档的概率大致上取决于数据复杂程度，刚开局那会儿一般遇不上，但到了后期，即使在森林里跑一跑都有可能乱码，这时候存个档堪称心惊胆战，还好我曾因为升级bug而备份了巨量存档，坏档问题虽然也碰上了不少次，幸亏都没造成太大损失。</p>\n<p>长话短说，重返王城沿着熟悉的路线再次下到随机地城底部，依次挖开封堵的岩壁以寻找道路，功夫不负有心人，三座随机地城里有两座都存在隐藏洞穴，一路往下地毯式搜刮，最后我成功于一只惧魔附近找到了Eye of Raa这件神器。</p>\n<p><img src=\"files/Avanor/dig_hole.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>历经艰难险阻，我自然希望这件神器有个惊天动地泣鬼神的外观，最好在拿起来的时候再出现一道直冲天际的金色闪光，遗憾的是在这种字符世界里它的长相就是个‘*’，甚至连物品描述都没得看；从源码中得知它能提高精神相关的属性，还能施放一种不耗mp的远程攻击，但最大的优点是它属于工具类别，不用跟其他饰品抢装备栏位。</p>\n<p>与随机地城永别，到皇宫提交任务，时刻记得在这里要将盗墓弄来的先王剑藏好，不然一对话国王会翻脸；给出神器之后国王戴上它，深刻地感谢了玩家两句话，接着呢？接着就没下文了，不光把东西拿走连奖励也不给，感觉就差一句“最珍贵的回报正是你一路上的成长”。</p>\n<p>发送消息，标记任务完成，给出物品，结束操作；四行代码让我起了杀心，之前清理墓穴好歹给一千让人尝个甜头，这次忙活这么久居然一毛不拔，那就不要怪我心狠手辣了；拔剑斩击一气呵成，但是手感有些不对，臆想中血溅五步的场景也并未出现，查看战斗记录，国王居然躲开了突如其来的一剑，还反手几招将我击伤，其速度之快，破甲力道之强，着实令人汗流浃背，雪上加霜的是周围一队皇家守卫也围了上来，虽然几乎无法对我造成有效伤害，但致命之处在于他们堵住了皇宫唯一的逃脱路线，最终害我饮恨当场。</p>\n<p><img src=\"files/Avanor/give_eye.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>几番读档与国王“切磋”后，我大致掌握了他的信息，首先他是一名纯粹的物理战士，拥有非常高的速度与闪避率，尽管我防护能力也不低，但我一剑的功夫够他反击三四次，实在吃亏，其次是虽然有相当程度的元素抗性，但他并不免疫射弹伤害与恐惧状态，不会使用刚刚交出的神器，也造成不了麻痹等状态。</p>\n<p>综上所述，我的策略转变成了穿戴增加智慧的饰品，然后在极限射程发射无属性的魔法箭进行消耗，必定命中但是伤害较低，肯定不足以直接击杀国王，所以等他冲过来后势必需要近身作战，好在这个世界持剑穿重甲也不影响施法，可以无缝切换近战模式；接下来我在死亡前大概率能将他的hp削减至恐惧范围，他会逃跑，但此时千万不能追，角色状态较差容易被他回身几棍子送走，保持使用魔法压制，运气好可以将国王的hp消耗完，运气差让其脱离恐惧状态则可以在他冲回来之前喝药，这下再面对重伤国王应该能轻松取胜。</p>\n<p>战前也当然要给自己叠好状态，力量药水英雄卷轴什么的有就都用上，多少增加一些容错，另外不太建议在国王未恐惧之前喝那些轻伤治疗药水，按照对方的速度，hp恢复量可能还没一回合吐出去的多；国王身上也会固定生成不少healing药水，最好提前偷走，不然会增加翻车风险。</p>\n<p><img src=\"files/Avanor/hit_king.jpg\" alt=\"maaaaaaagic aaarrowwwww！\" loading=\"lazy\" class=\"φbp\"></p>\n<p>最终击杀国王时角色hp还剩四分之一不到，再吃两下重击便会暴毙，mp也空了大半，堪称惊险万分，这离谱的强度除了他是前代勇者外，我想不出还能有什么合理的解释，至于那些烦人的皇家守卫，国王一死早就跑到角落里逃命去了，打扫战场时直接挨个手起刀落。</p>\n<p>除去Eye of Raa，掉落物中还有两件unique item，一顶阿瓦诺的王冠与一柄阿瓦诺的权杖，王冠和矮人王那顶几乎是同款，除了外观不同，所提供的加成都完全一致；权杖则没想到是近战武器，骰面比先王剑大概要低一半，但是能额外增加16点力量，可以考虑拿在副手，不过国王拿根棍子都这么强，要是我这剑给他拿去了那强度想都不敢想。</p>\n<p>从花园旁边的神秘入口下去，底下果然是王城宝库，也如同预料般躺着古代部件，而且还是两块，先前在矮人王国“捡”来的那件在去随机地城的时候就顺路给邪法师送去了，既然三件都已浮出水面，那么激动人心的时刻马上就要到了……吗？在我捡起第二块部件时，游戏程序又崩溃了，这次崩溃得也非常稳定，固定在捡起两块部件时发生。</p>\n<p><img src=\"files/Avanor/bad_bag.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/bad_bag2.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>起初我以为这是不让玩家一次性将所有部件带上逃走，必须击败国王能再来一趟拿剩下的那件，但转念一想谁会用进程崩溃当作阻止手段，这肯定又是什么恶性bug；当时还乐观的我想着一件件拿也无所谓，就多跑一趟的事，可等我找到邪法师给出部件时，游戏再次崩溃。</p>\n<p>一部分原因得怪所有生物都有背包设定，包括敌人和npc，这表示我给出的第一块部件真真切切的躺在邪法师包里，而并非交完任务便消失，即使我将第二块部件扔到地上尝试让邪法师自己拾取也无济于事，因为任何物品栏只要含有复数块的部件就会导致崩溃，别无例外。</p>\n<p>也不知道这玩意是不是铀235做的，两坨凑一起就发生临界反应；在反复读档以及试验失败后我决定将目光投向广大的互联网，首先是Roguelike的大书库RogueBasin，其中记载了Avanor在dosbox上存在缺乏长文件名支持的问题，也就是无法在游戏内打开帮助手册的元凶，我尝试切换了模拟器，但文件名与崩溃的问题依旧未能解决，仅能调整出过于清晰的字体。</p>\n<p><img src=\"files/Avanor/roguebasin.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/dosboxX.jpg\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>根据官网的更新日志与irc上的求助信息，可以推断出游戏的原生平台应该是win32，但即使我连后续移植的linux版都找到了，也没能发现任何windows版本的踪影。</p>\n<p>曾经还有些人在游玩过Avanor后也留下了自己的观点，从Ben Power在大书库中的评价来看，原生环境下程序运行得堪称完美，他甚至请了病假在凌晨玩到了第二天晚上；个人角度更好奇Jeff那篇充满负面言论的评论在哪里，猜测他和我肯定遇到了不少一样的问题。</p>\n<p><img src=\"files/Avanor/official_web.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/review.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>正当我考虑是否要用源码自己编译个破解版出来的时候，我突然想起了曾经看到过的一篇俄语冒险记录，帖主似乎没有遇到相关问题，只是随口提到过一块古代部件也能完成任务，给出去再偷回来就行。</p>\n<p>再看到这句话我顿时犹如醍醐灌顶，简单阐明一下工作原理，虽然所有生物都拥有背包设定，可任务不会检测npc持有的物品数量以判断完成情况，而是在玩家执行“给予”这一操作时更新状态；换个说法，该任务的完成条件其实可以看作是将部件交给邪法师<strong>三次</strong>。</p>\n<p>即使物品存在bug无法堆叠，但这一方法自始至终都不会出现两块古代部件，依然是由于背包空间，只需要利用偷窃将部件盗回，对方物品栏中的对应物品也就真的不翼而飞，如此重复至计数器归零，任务即可完成。</p>\n<p>一切由bug引起又以bug终结，理解到背后的运作逻辑时我不由得拍案叫绝，利用漏洞欺骗游戏系统以绕过故障，酷毙了。</p>\n<p><img src=\"files/Avanor/ru_irc.png\" alt=\"当你的程序漏洞太多又刚好能互相支撑be like\" loading=\"lazy\" class=\"φbp\"></p>\n<p>不出意外的话又该出意外了，查完源码发现能教玩家偷窃技能的大师在村口那群绿林好汉里……已经不小心横尸村头了，只得被迫回档，本文姑且当作无事发生吧。</p>\n<p>随着一次次给出刚偷回来的物品，任务进度变成了3/3，与邪法师交谈他会称赞玩家并提出最后一个请求，杀死阿瓦诺之王Roderick，这样就没人能阻止他的计划了；慢着，国王不已经是具尸体了吗，我突然有股不详的预感，难道要领完任务之后击杀才能检测到？</p>\n<p>我赶忙再次对话，试图说明情况，结果表示不过是虚惊一场，游戏成功弹出了统计信息，通关！</p>\n<p><img src=\"files/Avanor/WINNER.jpg\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>很难说明当时是什么感受，毫无疑问，游戏体验相当之“粪”，但里面确实又有可取之处，不然我也不会坚持到结束。</p>\n<p>如果让我总结，我会认为这是一款相当“遗憾”的作品，它有很多基础框架都十分扎实，像是显示方式、物品生成、射击寻路、各种怪物的特质与风味文本等等，UI虽说是仿的，但也确实做得有模有样；每个生物都有背包，都有技能，甚至都可以学习法术，同时期的ADOM都未能做到这一点。</p>\n<p><img src=\"files/Avanor/ADOMinventory.png\" alt=\"Alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>事实上，2002年ADOM停更在1.1.1之后的那些日子里，irc上甚至有人认为Avanor能够取代它的地位；Avanor于2001年发布首个版本，持续开发至2003年后公布了源代码，接着要是能吸收开源和社区的力量，那它也许会成为一个“CddADoM”式的玩意，可没想到它跟前辈有样学样，同样陷入了停更。</p>\n<p>不知道是幸运还是不幸，制作组回光返照得比较快，两三年后突然又更了次新，一副要恢复长期开发的架势，较为重大的一项改动是使用LUA脚本，以便让游戏世界更容易扩展，这本有可能让它吸引elona系里喜欢omake mma的受众。</p>\n<p>能保持住这个势头的话，或许它真会成为新一代中流砥柱，因为忙于JADE的Thomas要到2012年才恢复ADOM更新，顺便赚上一笔巨款；但说不定是这次诈尸依旧反响平平，Avanor再后来就彻底没了消息。</p>\n<p>它的基础设定充满潜力，无缝开放世界，所有生物同时移动，如果作者再想着加入z轴并3d化，没准我们今天流行的就是“AvanorCraft”之类的东西，毕竟《矮人要塞》在2006年才发布，而受此启发的notch要在2009年才创作出《Minecraft》的原始版本。</p>\n<p><img src=\"files/Avanor/replace.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/LUAworld.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>抛开未来的发展形态不谈，光是现有的内容就还有很多疑问和可拓展之处：古代恶魔与蘑菇洞有什么秘密？国王为何不肯离开王城一步？丢失数年的神器怎么才开始找？与现在的异变是否存在关系？</p>\n<p>能在灾难之中存活下来，玩家这名角色的真实身份是什么？散尽力量又怎会被正邪双方一起看上？</p>\n<p>外面的世界多半早已天翻地覆，围住这一带的环形山脉有没有可能不是牢笼，而是最后的壁障？</p>\n<p>邪法师与国王莫非是更高位存在的棋子？元凶真有能力造成山脉隆起这样的天地异象吗？从未现身的神明对世界动荡又持怎样的态度？</p>\n<p>另外Avanor的游戏流程太短，对整个世界犹如管中窥豹，凑齐部件后完全可以来段山崩地裂的演出，然后从山体缺口展开一副更为广阔的外界画卷；曾经那个dos与软盘的时代可能会受限于机能，但现如今这种字符世界能有多大几乎完全取决于创作者的想象能力。</p>\n<p><img src=\"files/Avanor/memory.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>该项目的主要作者是Vadim Gaidukevich，在详情页面上还有另外两位程序，其中一位的github主页至今仍然活跃，除此之外应该还有许多其他成员也参与了开发，像是撰写了生物描述的Uriah Otting与许多汇报了bug的玩家。</p>\n<p>翻源码的过程中也能感受到些许码风差异，几位程序里肯定有一名狂热的OOP爱好者，比如对于游戏内的物品，多数情况下定义个item class或者struct就差不多了，剩下的数据打表或者从本地文件读取；尽管部分药水列表啥的让人神清气爽，但Avanor中有非常多的物品与生物都单独以一个派生类的形式出现，如果将继承关系用树状图画出来应该是朵蒲公英，由衷希望当事人有配置良好的自动补充模板，否则我会非常佩服ta的毅力。</p>\n<p><img src=\"files/Avanor/members.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>那些人共同创作了这部作品，他们曾有过一座论坛，一张响应迅速的bug收集表，肯定还度过了几段欢乐的时光；纵使时间流逝，绝大部分存在过的痕迹都抹平，也总会有些美好的东西留下来，就像irc上那些发自内心的赞扬与冒险分享。</p>\n<p><img src=\"files/Avanor/forum.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Avanor/buglist.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>游戏实际上还有另外一种隐藏结局，将国王和邪法师全部击杀后，回到初入王城的地方找火焰之主对话，他便会为玩家加冕，封角色为新一任的Avanor之王，看样子这家伙精明的很，懂得将自己隐藏在幕后；我后来专门再去完成了这一结局，通关的统计数据放到了本文末尾，如果感兴趣的话可以下载看看。</p>\n<p>可惜Avanor这部作品的结局则早已注定，未来也几乎不可能有机会“复活”，至少希望本篇短文能够成为它的一份Memory File，记录曾有过这么一款游戏存在。</p>\n<p>非常感谢读到这里的各位，能撑着看下来可真不容易。</p>\n<p><em>PS：多亏了Simon Swerwer的Danger Room才让我在枯燥的rng地牢里没有当场Bo毙，如果没听过这首歌请一定要抽空听听</em></p>\n<p>👉本文首发于言静rl网，<a href=\"files/Avanor/%E9%80%9A%E5%85%B3%E8%AE%B0%E5%BD%95/HHEDGEHO.MEM\">点我</a>前往以弗所查看角色统计👈</p>\n","prev":{"title":"记一场ToMENet中的死亡","link":"2024/BoMENet-arc"},"next":{"title":"使用SIMH模拟器安装4.2 BSD（以Win11为例）","link":"2023/win10_4.2_BSD"},"plink":"http://www.ephesus.top/2024/Avanor/","reward":true,"reading_time":"21593 words in 144 min"}