{"title":"Elin | 北提里斯成神手札","date":"2025-12-03T02:08:19.000Z","date_formatted":{"ll":"Dec 3, 2025","L":"12/03/2025","MM-DD":"12-03"},"link":"2025/Elin","comments":true,"tags":["Elin","hxh","roguelike","实况"],"updated":"2025-12-03T08:39:06.877Z","content":"<p>投稿: H_Hedgehog</p>\n<p>（原文发布时间2024.11.11）</p>\n<p><em>赞美unlimit，为Glitch之神的诞生献上咒酒与Bo球</em></p>\n<p align=\"right\">——罗米阿斯如是说</p>\n<p>相信不少人都听说过Elona（伊洛纳）的大名，它已经算是古典rl后辈中混得比较“出人头地”的了，不过还是再仔细介绍一下；Eternal League of Nefia，《奈菲亚之永恒的盟约》，简称为Elona，是一款日系角色扮演游戏，玩家将作为一名冒险者在名为Ylva（伊尔瓦）的奇幻世界中生活，其主要宣传特色为鬼畜&amp;自由程度。</p>\n<p>如果要找一个类型来形容，那Elona应该是“人生型游戏”，角色有着漫长的养成期，不像其他游戏升个级或者喝瓶药就能增加属性，而需要从日常饮食中摄入高级料理或者名贵草药，<strong>提高潜力</strong>后再通过对应行为进行锻炼，比如交易训练魅力，挨打训练体质；属性成功提升后潜力会相应降低，所以这是一个需要长期循环往复的过程，技能方面类似，但必须消耗珍贵的白金币，可白金币基本上只能完成委托后少量获得，甚至无法用金币购买，这让某些人不惜杀害小妹妹吃下人肉作为代替。</p>\n<p>小妹妹是游戏中的一种雌性人形生物，驾驶着名为“大爹地”的机甲，对玩家的默认态度是中立，正常情况下应该拿★精灵球将其捕捉，然后交给神秘科学家以领取奖励；但吃掉她的尸体可以提高生命和魔力上限，并且略微增加所有技能的潜力，因此很多玩家宁可无视善恶值降成通缉犯和刷新率下降的风险，也要将她作为饭后甜点。</p>\n<p><img src=\"files/Elin_OK/little_sister.jpg\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>有着相同境遇的还有约恩村的小萝莉——格温，她在设定上是全世界最天真无邪的存在，然而必须杀死她才有小概率掉落名为★善人秘宝的黑星道具，该道具可以将玩家的善恶值上限从20增加至40；善恶低于-30便会成为罪人，进入贼村以外的任何城镇都将遭到守卫攻击，如果不易容，商人也拒绝与罪犯交易；另外善恶跟税金挂钩，是的没错，Elona里玩家甚至还需要<strong>定期纳税</strong>，具体金额取决于角色的资产与声望，而40善可以提供整整40%的税金减免，这让无数人趋之若鹜。</p>\n<p>说起来讽刺，像什么地狱笑话，玩家需要杀死手无寸铁的纯洁萝莉才能让自己变得更加善良，由于固定城镇和npc会定期刷新，击杀格温也不扣善恶值，许多冒险者每次路过约恩村都会顺手宰只格温以试图获取秘宝，100%掉落的标本和卡片卖掉补贴家用，尸体便当作今天的免费的路边餐，这也是玩家社区中她“午餐肉”绰号的来源，恶趣味可见一斑。</p>\n<p>Elona中能把旅店老板灌醉后爽一爽获得初始资金（爽多了会得病），也能与选择的对象步入婚姻殿堂，根据不同地区的特产跑商，又或者经营农场和牧场，甚至圈养智慧种族繁殖然后当作奴隶贩卖；厌倦战斗和跑腿了可以拿根鱼竿再揣点虫子，找个水池一钓一整天，冰箱里塞不下的鱼则全献祭给喵咪咪换取女神的青睐，就是这样自由开放。</p>\n<p><img src=\"files/Elin_OK/specimen.jpg\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/specimen2.jpg\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>虽然看画面像是什么RPGmaker的作品，然而Elona实际上是用HSP 3.0（Hot Soup Processor）写成的，没有公开源代码，但可以向作者Noa写邮件要到；至于本文的真正主角Elin则是用C#和Unity制作而成，尽管仍然不开源，通过dnSpy等手段还是能够逆向出底层逻辑与美术资源，出于道德角度考量，还是尽量少展示为好。</p>\n<p>Elin在现实时间上是Elona的续作，在剧情上则算Elona的前传，世界观完全相同，也继承了本家的长线养成与普通人出门会被波球吃掉的难度；不再大量使用免费素材后，场景的精美程度提高了几个层次，可惜也失去了一点原有的味道。</p>\n<p><img src=\"files/Elin_OK/chess.png\" alt=\"视角和UI设计极大的参考了Ultima\" loading=\"lazy\" class=\"φbp\"></p>\n<p>容易混淆的是，Elona存在大量变体，由Noa创作的1.22原版通常被称为“本家”，而各种改版中最臭名远扬叫做ElonaPlus，简称为E+，作者则是Ano；由于本家的主线剧情只完成第一章就停止了更新，继续开发的E+起初被认可为续作，但因为创作理念分歧，后者又重新被定义成了同人作品。</p>\n<p>用爱发电十几年的努力值得肯定，但E+充斥着（此处省略75字符），在2.19甚至移除了经典核爆开局的可行性，令人唾弃。</p>\n<p>即便制作水平远远不如本家，仅是内容多这一点便让E+引流了数量更大的新人，只能感慨“狗尾续猫”（Noa cat）；更多详情就不再浪费笔墨，可以引用但不限于下列材料：</p>\n<p><img src=\"files/Elin_OK/ano.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/reddit.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/reddit2.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/revile.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p><img src=\"files/Elin_OK/ref.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/ref2.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/ref3.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<h2 id=\"elin-alpha阶段幽默漏洞的不完全摘录\">Elin alpha阶段幽默漏洞的不完全摘录<a title=\"#elin-alpha阶段幽默漏洞的不完全摘录\" href=\"#elin-alpha阶段幽默漏洞的不完全摘录\"></a></h2>\n<p>正式进入核心章节，为了防止有吃瓜群众问为什么sbeam搜不到，简单解释一下，Elin暂时还没上架售卖，只提供测试版给参与了Kickstarter众筹的赞助者；本人因为人傻塞得钱多，所以档位比较高，有幸自去年12月起作为首批玩家之一进入了alpha测试，下文中提到的漏洞也基本局限于α测，至于β测（已于今年6月开放）能玩出什么花来，就看其他新冒险家的表演了，经历三百多小时的高强度游玩后我已经彻底燃尽，必须先恢复一下元气X-P</p>\n<p>最先出现的问题在游戏外，原定于12月11日发送α测试激活码，结果流程上遇到故障，所有人只收到了封空头邮件，然后社区经理Rusty赶忙跑出来鞠躬，日语一遍英语一遍，表示24小时内会补发；大家被迫坐着干等，直到第二天下午四点突然来信补了码，可当我们火急火燎地输入后，发现库中并没有多出新游戏，又是几番追问，然后了解到这个key只代表preregister，预注册完了还得等到22号才开放下载。</p>\n<p>把其他游戏清完，请好假专门等Elin发布的玩家都成了joker🤡，更草台班子的是他们没说22号几点，PST还是GMT还是UTC，这关系到不同地区得熬夜还是补觉；最后有玩家跑去赞助页面的FAQ处问了才知道是日本时间晚上7点，在此之前我们热烈地讨论了坐哪一班飞机去拦截卷钱跑路的Noa。</p>\n<p>后续的等待期间比较担心当事人的精神状态，发个key整出这么多幺蛾子，正巧几天前又出现了谷子（周边小礼品）运输延误，要推迟发货时间，换我估计早就汗流浃背了，好在Noa抗压能力优异，没真跑。</p>\n<p><img src=\"files/Elin_OK/smms.png\" alt=\"躬匠精神，红豆泥私密马赛\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/smms2.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/smms3.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>不过总的来说，回想起发布前夕还是很美好的，大家都在疯狂罗米（写各种骗人的怪话）来装作已经玩到了游戏✍🔥，比如编造开局必须去一座会融化蜗牛种族的废弃盐矿，又因为存在高浓度盐雨，出门得带伞或是把煎锅顶在头上（但也让食物停止腐烂），甚至谣传新加入的神祇就是盐神，有人听完表示自己在奶酪房屋的顶部建造了漏斗，这样便可以在雨水风干后收获以太盐晶体。</p>\n<p>频道里还有捏造的剧情和战斗评价，甚至连怎样跳过流程的邪道都开发得像模像样，实在是令人笑得喘不过气；临近7点时反而清净不少，全体成员都忙着刷新库存准备第一时间进到真正的游戏里，下载完成后大量玩过技术demo的玩家出现了黑屏问题，又是一阵混乱，好在很快发现了解决办法；就这样，我们历尽波折地抵达了Elin的世界。</p>\n<p><img src=\"files/Elin_OK/write.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/writewrite.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/blackscreen.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>角色设定方面虽然对这篇bug记录不重要，但还是顺带一提为好，本人职业为魔法师，种族为巫妖，跟隔壁骨傲天最大的区别应该是我还有具肉体，能享受世俗欢愉，这样开局肯定没纯近战轻松，主要为了更全面地体验一下游戏内容，<s>以及万一哪天我出门被大卡车送去异世界也不用担心寿元耗尽。</s></p>\n<p>外观我是照着本家自己那个充满神性的金色卤蛋捏的，加了件大衣和翅膀，非常中二非常帅；称号嘛，极其幸运地随机出了魔法之神的头衔，虽然只是叫着好听，不会给予任何加成，但成神的命运或许在冥冥之中早已注定。</p>\n<p><img src=\"files/Elin_OK/character.png\" alt=\"双亲后面重新roll了一下\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/PCC.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>尽管是初次踏上提里斯这片大陆，由于拥有Elona的后世记忆，我一定能在此时大展身手，改写历史然后走上人生巅峰……才怪咧！</p>\n<p>玩家熟练地在野外遇难，然后被两位新手导师捡到，之前的经历也不知道是失忆还是一笔勾销了，依然有祖传的喂食环节，不过这次没塞乞丐肉，取而代之的是碗蔬菜粥，十分残念；接着从导师处能领到宠物，可选项一如既往的亲切，狗、猫、熊、以及少女，毫无疑问，少女是唯一答案，但按照继承自本家的强度设定，我俩目前联手也仅能揍死只波球，遇到野猪或史莱姆都得落荒而逃，探索地城？想都不敢想。</p>\n<p>魔法方面仍为ADOM式的存量型，得不断的花钱买书读，否则使用次数一旦耗尽，即使mp有剩，人也得当场变麻瓜；导师给了我一张★地契，嘴上说着送块风水宝地，实则让人白白打工，玩家只需要把荒野发展成繁华据点就行，上头管每月收税要考虑的可就多了。</p>\n<p>前几辈子的经营思路再怎么高超，没有原始的资本积累也毫无用处，另外过去认识的那帮王公贵族现在都还是小屁孩，只会拽着我给他们讲冒险故事，一点也指望不上；起先这段日子过得无比艰辛，基本在城里摘绿化带的果子（后来还不让摘了要扣善恶），野外采集原料，简单处理一下再拿去卖；库莱姆梅因为具有成瘾性，借老乡的石磨加工成粉后销路不错，但一单位的粉末仅能卖出30金币，第一个月要缴纳的税金却可以轻松500+，摆点家具和工作台甚至能奔着1000去，大写的一个惨字。</p>\n<p><img src=\"files/Elin_OK/little_girl.jpg\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/prince.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<h2 id=\"#1-开局导师祭天\">#1 开局导师祭天<a title=\"##1-开局导师祭天\" href=\"##1-开局导师祭天\"></a></h2>\n<p>本家6级之前存在新手保护期，不需要交税，某些人甚至愿意去刷罕见的降级药水，在后期把等级压回5级以免除巨额税款；Elin这种操作却行不通，原因是玩家根本没人物等级一说，必须全力赚钱，不然算上生活开支，血条当体力条往死里干也入不敷出，还有随时随地过劳死的风险。</p>\n<p>纵使玩家想好好干活，领地内自然刷新的怪物可不会手软，没错，虽然我有这块地名誉上的所属权，但路过的各类牛鬼蛇神显然不准备乖乖听话，遇到头野猪被拱死，遇上只哥布林被揍死，砍树都有概率掉个波球打我。</p>\n<p>最绷不住的一次是我失手射中幼犬然后被它当场反杀，两位导师正常情况下会主动攻击怪物，玩家可以跑到他们身边抱大腿（实力甩新手冒险者十条街以上），但这条狗原属于中立生物，他们不帮忙反而跑过去rua狗，还一副摸得很开心的样子，我尸体却只能血肉模糊地躺在一旁死不瞑目。</p>\n<p><img src=\"files/Elin_OK/die_lot.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>好在很快让俩导师也尝到了苦头，那是个大雪纷飞的清晨，这小破地不知何德何能刷新出了一名冒着金色粒子的地雷侍，一种Elona中会自爆的恐怖怪物，但Elin那时还并未实装怪物的特殊能力，所以他只会用刀砍人；正巧，这玩意基础等级不低，冒金光表示精英怪，面板更上一层楼，在我灵活拉扯下，导师成功地勾引到了地雷侍的仇恨，然后？然后导师就被揍死了，对面连战两人反而血条都没掉多少，开局强度正是这么离谱。</p>\n<p>地雷侍后来被我诱引进一座房子，用墙封死在了里面，得亏怪物不能拆玩家放置的建筑，收容成功，由于没弄到方便的装修告示板，期间反复S/L了大半天，狂凹角色能够闪避他的攻击，最想念本家时停漏洞的一次。</p>\n<p><img src=\"files/Elin_OK/kill_guide.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>生成这么离谱的怪物绝对是平衡性问题，因为此处算作自家复活点，守尸的精英怪也不会凭空消失，完全可能出现一复活就又被砍翻的死局，但“不小心”坑死导师这一操作，某种意义上也算致敬了本家传奇的核爆开局，令人怀念。</p>\n<p><em>PS：核爆开局是指在不进入矿镇的情况下，快速跑商攒齐1w2到贼村购买原子弹，再回乞丐洞穴炸死两名导师获取强力★装备的流程</em></p>\n<p><img src=\"files/Elin_OK/nuke.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<h2 id=\"#2-小水池钓鲸鱼\">#2 小水池钓鲸鱼<a title=\"##2-小水池钓鲸鱼\" href=\"##2-小水池钓鲸鱼\"></a></h2>\n<p>名为阿什兰德的导师掉落了一把★吉他，不会演奏乐器的话用处不大，另外那位叫做菲亚玛的掉落了一件★商人包，里面装着她售卖的所有道具，这实际上关系到某个其他漏洞，我们稍后再提。</p>\n<p>初始这片领地的左下角固定会存在一处水池，按照本家能钓鱼的传统，自然有人打起了里边水产的主意；只需要些木棍和藤蔓搓成的纤维，即可制作出简易鱼竿，随便再弄点肉便可以制作鱼饵，哪怕是腐肉或生皮也行，接下来就到钓鱼佬最喜欢的拼人品环节了。</p>\n<p><img src=\"files/Elin_OK/whale.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/pond.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>运气不好只能钓到杂物甚至空军（一无所获），但要是运气好，即使这么一座飘着垃圾的小水坑同样可以钓出鲨鱼，甚至重达1200s的鲸鱼，光是拿起来就会被压扁的程度，也不知道这杆怎么收上来的；令人惊奇的是，钓鱼对技能几乎没什么要求，纯看脸，频道里最早钓出鲸鱼的，角色相应技能才六七级，没准是Noa自己debug完忘记把爆率改回去了，本家可没这种好事。</p>\n<p>鲨鱼的出货价在1000金币左右，而一条鲸鱼甚至可以卖出3000金币以上，对比制作鱼饵那点边角料简直一本万利，抛开这些值钱的大鱼不谈，玩家也有概率钓到像是深海鱼和空棘鱼之类，吃了能够增加属性潜力的品种；再退几步讲，哪怕脸黑得只能钓出小鱼小虾，那无非是今晚要吃的腐肉变成了蝌蚪烤串，亏不到哪去。</p>\n<p>另外这也说明了一件事，家中每格水体地块的功能，与野外的海洋湖泊没有区别，并且钓鱼不计算当前水域的面积；我们只需要用墙把水池围起来，便可享受室内不刷怪的无干扰环境，真正意义上做到背对众生，独钓万古。</p>\n<p><img src=\"files/Elin_OK/ship2.png\" alt=\"这是城里的快递箱\" loading=\"lazy\" class=\"φbp\"></p>\n<p>在自家钓鱼还有一层好处，那就是运输方便，只有非常早期的版本才能将出货箱（卖东西用的）放置在领地外，后续要是在海边钓出了鲸鱼什么的，因为压溃状态下无法移动&amp;归还，想卖鱼就只能压死自己接着重生回家中；而死亡会导致丢钱甚至属性降低等后果，反观自家垂钓，大大方方把出货箱摆在一旁，钓上什么了随手扔进去，何等优雅。</p>\n<p>应该是随机列表没有限制范围的缘故，曾见到过有小孩在大街上若无其事地举着条鲸鱼在啃，没被压死真是奇迹；听说只要踢一脚便能击落npc手中的食物，但当时救鱼心切的我上去一个手起刀落，将小孩斩于鲸下，然后咱作为钓鱼佬的第一条大鱼就是这么从菜市场捡来的。</p>\n<p><img src=\"files/Elin_OK/ship.jpg\" alt=\"孩口夺鲸\" loading=\"lazy\" class=\"φbp\"></p>\n<p>得益于当地邮局高效便捷的送货服务，玩家征收大型家具之后可以将它们邮寄回家，代价只是税单旁边多一张要缴的快递单而已，既然沙发和国王床都能运，帮忙捎条鱼也不是什么难事；就这样，那头鲸鱼在腐烂前被我成功的塞到了自家冰箱里冷藏，舍不得吃，权当留念。</p>\n<h2 id=\"#3-料理返鲜\">#3 料理返鲜<a title=\"##3-料理返鲜\" href=\"##3-料理返鲜\"></a></h2>\n<p>本家有件特殊容器叫★小冰箱，食物存放在里面将不会变质，但它的容量只够装下4份食物，一般情况下玩家应当仔细管理资源，防止自己饿死或者贵重道具腐烂；可小冰箱有个bug，将它拿在身上放入腐烂物，再扔到地上，不拾取它的情况下直接打开容器，取出的物品会是新鲜如初的版本（虽然贴图显示错误）。</p>\n<p>原理不详，疑似储存状态上的差异，但结果是我们成功把腐烂物逆转回了正常食品，也没人争论它在哲学上还算不算原来那个。</p>\n<p><img src=\"files/Elin_OK/decay.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>Elin中同样有小冰箱，容量升级成了3x3，能放9份食物，但问题是冷藏功效大幅下降，只能延缓变质，没法阻止物品最终仍会走向腐坏；想要永久保鲜就必须使用插电的冰箱，完成足够多任务后可以从王都征收到，至于能源方面……您得自己发电，因为提里斯目前还没建成国家级的输电网。</p>\n<p>发电雪人也好，强制劳动机也罢，α测时期玩家可以对家园实行自然发电政策，虚空产电，然而β测貌似删了那玩意，只能依靠各种机器了；如果没有电，冰箱不过是一个大号柜子，里面的东西早晚得通通烂完。</p>\n<p><img src=\"files/Elin_OK/forging.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>假设万一停电，非常名贵的食材腐烂了咋办？难不成直接扔掉？那也太浪费了，但这边的小冰箱又没有bug可供利用；答案是先放着，东西不会彻底烂得什么都不剩，等到需要的时候再考虑分解成生鲜或制作成鱼饵，要是它真的十分有价值，您手头又有富余的话，就使出我们的Elin返鲜大法——把食材丢进锅里做成料理！</p>\n<p>没听错，原料虽然是腐烂的，但烹饪出来的料理可新鲜热乎着呢，不过这有个前提，成品的品质必须达到普通或以上才行，否则劣质品出锅就是一坨黑色的焦糊物，人没法吃；腐烂食物的评级通常不会好到哪去，想让整道菜的品质别完全垮掉，得猛掺其他调料压住，仔细一琢磨还挺符合逻辑。</p>\n<p><img src=\"files/Elin_OK/cook.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>以这块陈年老鼠肉为例，首先需要挑稍微高级一些的食谱，不然没有操作空间，如果将肉选作主料烹饪会大幅影响料理词条，但要是放到辅料栏当额外食材，则对成品影响较少，好处是几乎不会增加品质上的难度；此处准备将其作为主体，用高温油炸盖住本来的味道，所以选择炸肉排的配方，除了一袋天妇罗粉固定需要之外，其他素材为松露、味增、黑胡椒，分别是我最好的蔬菜，调味品以及香料。</p>\n<p>烹饪过程来自胡乱脑补：第一步把老鼠剥皮去骨处理干净，切成合适的大小用味增腌制入味，然后将松露洗净切好作为配菜，开始热锅烧油；天妇罗粉加水搅成面浆，蘸取一点滴到油锅中，能被炸至浮起则说明油温合适，将老鼠肉和松露挨个裹满浆糊下锅油炸，刚放下去的时候用筷子辅助内馅与面衣保持聚而不散，之后每过一小会便轻轻地给它们翻个面，待到炸至金黄飘香时即可捞出装盘。</p>\n<p>黄金老鼠天妇罗，堂堂出锅！</p>\n<p><img src=\"files/Elin_OK/cook2.png\" alt=\"新鲜的！温馨的！\" loading=\"lazy\" class=\"φbp\"></p>\n<p>做完记得趁热吃，否则料理再腐烂掉，即便向女神祈祷也回天乏术；这种返鲜手段的代价实在是奢侈，为了一块烂肉得倒贴大半锅高级配料，或许只有特殊怪物以及小妹妹的肉才值得逆转。</p>\n<p>再给不想把腐肉当主料的小伙伴推荐个其他食谱，在吊锅那边能煮炖菜，末尾的额外食材加肉即可；难度比炸肉排低，30级出头的烹饪技能便可轻松应付，也不需要消耗稀有调料。</p>\n<p><img src=\"files/Elin_OK/cook3.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>最后，作为辅料的话，成品名称更依赖随机权重，即使加了肉也可能做出“蔬菜的炖菜”，对收集党（例如想把神做成各种料理的单推人）不友好；根据个人测试，原材料完全相同的情况下，名称差异不会影响最终售价，如果准备返鲜做菜卖钱，这说不定是个好消息。</p>\n<h2 id=\"#4-奥伦投掷者\">#4 奥伦投掷者<a title=\"##4-奥伦投掷者\" href=\"##4-奥伦投掷者\"></a></h2>\n<p>隔壁《矮人要塞》有个经典名梗，Legendary Thrower，指的是在冒险模式中将投掷技能训练到足够高后，无论扔什么都将造成毁灭性后果，哪怕是泥巴、呕吐物、甚至自己脚上的袜子，三两下就能击倒一头狼，泪水要是能抓取，可以物理意义上做到挥泪斩马谡。</p>\n<p>但老是扔杂物或者在开战前吐半天口水，实在不是什么优雅的行为，玩家们找到了一种更加致命且方便的代替物：金属硬币，大小和重量刚刚好，容易获得的同时非常适合随身携带，毕竟揣点钱总比背着几十双袜子要有用；在高水平的投掷者手中，各种金属铸币能够轻松造成骨折，甚至颅骨碎裂等致命伤，有需要也可选择性地让对方失明或丧失行动能力，角色如果再搭配上传奇级别的闪避技能，几乎天下无敌。</p>\n<p><img src=\"files/Elin_OK/thrower.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>而我们在Elin里遇到了类似情况，起因是在投掷计算公式更新前，无论扔喷泉还是木棍都没啥差别，伤害只取决于角色的力量属性与投掷技能等级；在导师的新手任务中，教玩家扔的是石子，但石头挖起来很费体力，还得放到切石机里磨碎，相当不好取用，更何况制作其他物品也需要石头，拿来当一次性的投掷物多少有些浪费。</p>\n<p>那么数量多，重量轻，丢了也不心疼的东西是什么呢，答案呼之欲出，奥伦（oren），这是Ylva世界中最常用的一种货币，由黄金制成，非常适合砸人；弓箭枪械尚需考虑武器和弹药面板，初期的伤害经常不如扔硬币，甚至有玩家在缺钱的时候，制作了大量简易箭矢直接用于投掷，而不是搭配弓弩发射，另外属性和技能由于可成长，发展前景也比远程武器上限高。</p>\n<p><img src=\"files/Elin_OK/oren.png\" alt=\"Just Rock！\" loading=\"lazy\" class=\"φbp\"></p>\n<p>此外，投掷还有一大优势，它可以无视DV（粗略算是闪避值）100%命中敌人，这样强大的特质让奥伦成了必中的朗基努斯穿甲之弹；一时间提里斯钱贵，再强大的战士也不会拒绝在敌人靠近前先扔上几把硬币，最令人笑得喘不过气的是频道底下有人发御坂美琴，哈哈哈哈哈嗝。</p>\n<p>如此op的操作显然会受到开发者的重点关注，狂欢派对上午开完，当天傍晚Noa就堵住了漏洞，最终伤害新增了硬度和重量作为影响因素，一代传奇奥伦投掷大师，就此陨落。</p>\n<p><img src=\"files/Elin_OK/build_gone.png\" alt=\"吃我一记金钱镖\" loading=\"lazy\" class=\"φbp\"></p>\n<h2 id=\"#5-批量完成计数任务\">#5 批量完成计数任务<a title=\"##5-批量完成计数任务\" href=\"##5-批量完成计数任务\"></a></h2>\n<p>要说新手冒险者最常干的活，毫无疑问是跑腿和通马桶，Elin初期没来得及实装护送和收菜任务，玩家基本上只能接搜集特定物品和猎杀怪物的委托，后者分为两种，一种仅要求杀敌数，还有一种则额外限定了类型；好玩就好玩在这个限定类型可以roll到所有种族，包括真神，可能没想过给祂们设定对应奖励，系统默认采用了最低的档次，于是便出现了：</p>\n<p>“拿着这两百块钱，把七大主神都给我杀一遍，哦对，还有那个叫无之艾斯的，把祂从虚空中拉出来再弄死一遍，数量不够就把赞助的那几个新神也砍了，做不到？不管，接了委托你就得给我干活！”</p>\n<p><img src=\"files/Elin_OK/slay_god.jpg\" alt=\"我打主神？真的假的？\" loading=\"lazy\" class=\"φbp\"></p>\n<p>反正见到指定怪物种类的任务尽量离远点，就算不难打，也可能腿跑断了都找不齐，费那么大劲只为了这点报酬实在是不值得；旁边不限种类，只要求数量的委托才是唯一之选，虽然奖励方面半斤八两，但它们的杀敌计数器是共享的，不需要等到上一任务完成才开始计算下一任务，解决只波球可以全部进度+1，解决掉头巨龙照样是全部进度+1。</p>\n<p>光这样也不算什么，真正离谱的地方在于α测早期没有对委托接取数量设置上限，加之消耗影响力能够重roll任务告示板，完成委托又能增加影响力，像形成了链式反应一般，玩家可以成指数倍地增加同时进行的任务量；出门随便杀个十几只杂兵就能同时完成数百，甚至是数千件委托，更方便的是奖励会自动出现在角色脚下，省得回去找人挨个领。</p>\n<p><img src=\"files/Elin_OK/reward_tower.png\" alt=\"有钱啦\" loading=\"lazy\" class=\"φbp\"></p>\n<h2 id=\"#6-善恶与宠物\">#6 善恶与宠物<a title=\"##6-善恶与宠物\" href=\"##6-善恶与宠物\"></a></h2>\n<p>每完成一件委托，善恶值便会增加1点，另外如果能批发到珍贵的赎罪券，那么每用一张便可增加20点；如本文开头所述，本家只有杀害格温后才能将善恶提升至40，而Noa却忘记了在Elin中设置该数值的上限，导致完成几轮任务后我的善恶已经突破了两千大关，要是按照每5点给予-5%的税金减免，帕罗米亚税务局应该倒贴给我几十倍的钱，再折腾一下说不定过俩月国家银行都得跟我改姓。</p>\n<p>善恶既然无上限，那就不存在杀害格温的理由，用★小奖章换到精灵球后，我第一件事就是尝试捕捉一只午餐肉作为宠物，出乎意料的成功了；这也是α测早期漏洞，因为本家的特殊npc不可装进精灵球，显然Elin又没添加限制因素，导致后来貌似有人连地城头目都捉了带回家。</p>\n<p><img src=\"files/Elin_OK/spam.png\" alt=\"娇小狐狸午餐肉\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/2k_karma.png\" alt=\"两千善大好人\" loading=\"lazy\"></p>\n<p>游戏中将少女什么的定义为宠物算是种恶趣味，实际上叫“伙伴”可能更好理解，他们可以留在据点中任命成仆人或居民，条件合适的情况下打扫卫生，产出物品；也可以当成队友带在身边一起战斗，但与雇佣其他冒险者不同，玩家无需支付工资，探险所得全归自己独吞，即使把宠物作为肉盾或炮灰也毫无负担，一是他们绝对不会主动造反，二是哪怕死亡，宠物也会在次日清晨于家中复活，简直像什么不死族的奴隶苦工。</p>\n<p>大部分生物都有好感度这一设定，本家里甚至能和宠物步入婚姻殿堂，再留点遗传因子什么的；由于结婚可以收到系统随礼，某些玩家会刷好感以便反复结婚，具体流程为送宠物可燃材质的婚戒，把宠物架在火上烤，烧掉装备栏里占位置的戒指，再继续送婚戒加好感，如此重复至结婚拿到奖励；什么，后宫佳丽太多了怎么办？没事，我们有一套完整的产业链，您可以将多余的配偶卖给港口的人妻爱好者，还能换不少钱呢，玩法就是这么没底线。</p>\n<p><img src=\"files/Elin_OK/scum.png\" alt=\"NTR仙人\" loading=\"lazy\" class=\"φbp\"></p>\n<p>可惜Elin目前来不及做婚姻相关的内容，但宠物依然有些非常好用的bug，首先，他们不存在负重上限，即便背着几百块铁砧也还能健步如飞，玩家可以将其视作四次元口袋的终极版本，无需耗蓝耗精，连施法都省了，直接稳定做到随取随用，不敢想那帮大魔导师得有多羡慕。</p>\n<p>然后还有个直到β测也没改掉的……特性，宠物背包相当于插电冰箱，里面的食物不会腐烂，代价是将定期遭到他们偷吃（否则饥饿状态下宠物无法回血），所以只有食物非常多的情况下才能利用该特性保鲜，然而就算这样，也请尽量不要将贵重的可食用道具放到宠物身上，某些情况下npc比活人聪明……吧？</p>\n<p>“快把木乃伊的尸体吐出来！！！吃了会降属性啊！！！”</p>\n<p><img src=\"files/Elin_OK/anvil.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p><img src=\"files/Elin_OK/walking_mic.png\" alt=\"宠物不消耗充能无限使用法杖 &amp; Walking Mic\" loading=\"lazy\" class=\"φbp\"></p>\n<h2 id=\"#7-信仰与铁球\">#7 信仰与铁球<a title=\"##7-信仰与铁球\" href=\"##7-信仰与铁球\"></a></h2>\n<p>其实这算是宠物背包的话题延伸，涉及到Ylva诸神，角色可以选择一位神祇作为信仰，然后不断供奉祭品增加恩惠，以获取祂赐予的奖赏；本家中祈祷是喊神救命，会倒扣恩惠值，Elin则改成了每天祷一祷有助于与神拉近关系，令人喜笑颜开。</p>\n<p>赐予的奖励涵盖功能各异的神仆与黑星道具，但神祇通常只专精于自己的领域，不说把所有奖励拿全，光是想转换一下游戏风格就得考虑改宗问题，可叛教的惩罚极其严重，本家中需要抗住9999回合的负面buff，-20%的DV&amp;PV还有速度；Elin初期虽然只用抗2000回合，但玩家的生命值、魔法值、体力值都会被降低为1（休息可正常恢复），还得背上一个100s重，不能扔掉的大铁球直到buff消失，配上玩家刚改宗的虚弱状态，十分容易陷入无限压溃的死亡循环。</p>\n<p><img src=\"files/Elin_OK/heavy_item.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>α测后来似乎将负面buff的回合数，修改成了依据之前的虔诚程度而定，铁球重量则按照角色最大负重的固定百分比生成；部分举重能力较弱的种族避免了在前期被压死几百次的命运，但后期属性更高的玩家也无法忽视铁球重量带来的影响，算是好坏参半。</p>\n<p>为什么说这跟宠物有关呢？首先肯定是因为他们不存在负重上限，可正常情况下咱应该无法将铁球移出背包才对，巧就巧在Elin新增了一种名为“寄生”的技能，可以让宠物附着在玩家身上作为外置血条；或许是游戏系统对于背包所属的判定出现了问题，<strong>在我印象中</strong>，有办法把铁球直接塞到寄生状态的宠物包里，随后置之不理或解除寄生都将不会对玩家行动造成干涉。</p>\n<p>匪夷所思的是，我后来收集文案素材，测试了bug修复前那段时间的大量版本，<strong>均未能复现这一操作</strong>，要么它条件苛刻，要么它只是种偶发性的故障，在此仅当成可能性提出，不视作记录。</p>\n<p>没准是曼德拉效应，群体性的出现了记忆偏差，不少人都将宠物背东西和寄生联系了起来，但如果塞铁球给宠物不成立的话，压根没必要浪费白金币去学寄生，因为跟随状态下的宠物同样可以按鼠标中键然后给予超重物品。</p>\n<p><img src=\"files/Elin_OK/parasitize.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>除此之外还有办法处理掉大铁球吗？当然有，且稳定可复现，那便是使用装修告示板，该方法要求在自己的据点中进行，可以选择背着铁球归还回家中再操作，但更推荐用宠物把野外或休战地的祭坛直接运回来，一切准备妥当后再叛教，更大程度上规避风险。</p>\n<p>前置条件是家园的建筑等级升至10级解锁自由建造，不够的先花金条提高，然后使用装修告示板，选择放置模式的工作台一栏，点击铁球图标接着找个地方一放，包里的大铁球就作为家具出现在地上了。</p>\n<p>需要注意的是，放在地上的铁球不会因为神罚buff结束而自动消失，代码的底层逻辑应该是在buff结束的那一回合移除玩家背包中的全部铁球，过时不候，所以嫌这大黑丸子又丑又占地方的记得在debuff消失之际去捡一下。</p>\n<p><img src=\"files/Elin_OK/iron_ball.png\" alt=\"该学Nethack整条铁链栓玩家身上了\" loading=\"lazy\" class=\"φbp\"></p>\n<p>作为一名忠实的朱亚控，信别的神是非常不齿的行为，尤其众神里边还有库米罗妮这种变态，顶头上司是伪娘只会导致我杀意涌动，那帮神祇后来还真被砍翻了几遍，但信起手下败将也更让人不爽，所以我对祂们的奖励长期不屑一顾。</p>\n<p>直到那个午夜，频道管理转发了一则问卷调查，问我们哪种幸运机制更有趣，一是游戏中每roll一次随机数，就有Luk%的概率给予重roll的机会，运气为正取更好的结果，运气为负取更差的结果；二仅仅是增加装备生成时的强化等级，说得好像我们很缺那么几张强化卷轴一样。</p>\n<p>当时在线的所有人齐刷刷地选了前者，Noa相当给力，投票半小时后就实装完毕，不少人怀疑他把新机制直接写到了rand()函数里；虽然我不为五斗米折腰，但每走一步就多一捧米的机会实在太诱人了，懂不懂双骰取高的含金量啊，还是every dice roll in the game！</p>\n<p>这下不得不信幸运神了，此生无悔入艾赫卡托尔，喵门永存🙏</p>\n<p><img src=\"files/Elin_OK/luck.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<h2 id=\"#8-盗窃无前置判定\">#8 盗窃无前置判定<a title=\"##8-盗窃无前置判定\" href=\"##8-盗窃无前置判定\"></a></h2>\n<p>自从拥有了几千善恶以后，我行事愈发肆无忌惮，根本不将社会的公序良俗放在眼里，税单烧一张撕一张，毕竟欠税超过三个月也才每次减50善，我扣上几年都还是提里斯优秀公民；由于税金减免功能被家园的逃税政策所取代，高善恶值反而成了干坏事的底牌，用来在杀人放火偷鸡摸狗之后维持玩家的非罪犯身份。</p>\n<p>要说零成本暴利的最佳选择，那毫无疑问是α测初期的盗窃，因为这时候偷东西不存在任何判定与属性检测，只要没被发现，盗窃成功率就是100%，即使周围有npc，通过S/L也可以轻松规避掉来自视线的影响；不像本家还要考虑灵巧补正、道具品质、下手时间、以及目标重量是否小于自身力量的一半等等，当然，这样一个明显的疏漏显然会被光速修复。</p>\n<p>但在此之前或不更新游戏的话，便可化身提里斯怪盗，偷光一切咱看上的东西，国王床？不错，归我了，发电机？也顺走，好看的雕像和大喷泉？连根拔起直接带回家。</p>\n<p><img src=\"files/Elin_OK/boat.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>连前置要求都没有的话，那赃物系统就更是无稽之谈，这些偷来的东西不仅可以光明正大地在市场上流通，出售金额也分毫不减，要知道本家赃物不去盗贼工会处理（仍会损失三分之一），只能卖出原有价格的十分之一，对比之下Elin简直像是做慈善。</p>\n<p>一张国王床大概能卖出三万奥伦（金币）的高价，不过该值肯定比它的真实价格低，因为买回来约要十几万，光是放在家里就会让本月税金增加近七千奥伦；只要掌握偷窃，这样的床可以轻松在商人公会搞到四张，技能等级再低也没影响，妖精和盗墓贼由于是天生的窃贼，开局便可前来提款，公会外另有一台重型发电机，不要忘记一起顺走哦。</p>\n<p><img src=\"files/Elin_OK/kingbed.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>其他不会偷窃的种族与职业如何是好？此等高精尖技术，自然是被牢牢垄断，除了许愿获得&amp;开局自带，必须加入盗贼工会才能花费白金币习得；虽理应如此，但α测期间找贼村酒馆的训练师就能直接解决，压根不用入会或是从水池暗道溜进地下。</p>\n<p>β测往后才实装上述限制，但开发者不小心整出过一个抽象的逻辑悖论，导致那段时间一名新学生都没有，<s>差点给神偷大师整抑郁</s>。</p>\n<p><img src=\"files/Elin_OK/conflict.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<h2 id=\"#9-洗劫店主\">#9 洗劫店主<a title=\"##9-洗劫店主\" href=\"##9-洗劫店主\"></a></h2>\n<p>接下来的部分仍然与盗窃有关，涉及到前文所提及的★商人包，如果忘了这边提醒一下是新手导师所掉落的那种。</p>\n<p>为什么非找店主麻烦？显然咱需要更好的装备来增强生存能力，可我们不是很有钱吗，干嘛不直接买？首先，α测初期的金币存在重量，一千奥伦的重量为2s，十万奥伦的重量则为200s，相当于两颗叛教送的大铁球，足以压死好几个开局玩家；其次，玩家的钱包作为容器有bug，钱放进去会让钱包正常增加重量，但把钱拿出来之后，钱包的重量仍然维持原样不变，得将容器丢到地上捡起来刷新一下才能复原，然而要是把钱从容器转移到背包，那变重的钱包+背包相当于两倍负重，更容易暴毙……</p>\n<p>停！快被绕晕了，我让无限负重的宠物帮我背着巨款总行了吧，呃，行是行，但钱总归要在玩家身上才能花出去，更大的问题在于您可能掏不出那么多钱；以这双七里靴为例，它的售价约为一百二十四万奥伦，反观玩家累死累活偷张国王床才赚三万，由于Elin中暂且没有幸福床，那已经算是家具中的顶奢了，不然椅子花瓶什么的能卖个几千就偷着乐吧。</p>\n<p><img src=\"files/Elin_OK/1239k.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>后续更新虽然移除了金币的重量，但要弄到这么多钱，全Ylva的皇室用品偷了卖掉也不够，所以想获取优质装备以便拳打守卫，脚踢npc的话，必须洗劫那帮万恶的店主；数不清是第几次疏漏或者没有限制了，本家中无法偷到店主所售卖的物品，可Elin不仅能偷，偷的还是作为容器的商人包，里面装着那名倒霉蛋的全部商品，一步到位。</p>\n<p>更离谱的是这么把npc彻底偷干净会导致系统误判，然后给店主重新生成一背包商品，盗窃直接成了快速刷新商品列表不二之选，令人捧腹；该bug当然也被很快修复，不过记得咱最早怎样获取商人包的吗，答案是售卖物品的npc死亡后固定掉落，盗窃判定添加完的很长一段时间内也没改掉这设定，显然，上帝为你关上一扇窗的时候，门还开着。</p>\n<p>凭借偷来的家底，角色已经能轻松的把店主剁成肉末，接下来无非是从薅羊毛变成了杀鸡取卵，考虑到npc会和城镇一起定期刷新，损失约等于没有，到很久之后商人包彻底被隐藏时，咱也看不上卖的那些东西了。</p>\n<p><img src=\"files/Elin_OK/steal_bag.png\" alt=\"老老实实地偷东西没前途，怎么办？只有杀！价格如此之高，已经算抢劫了！我只是在正当防卫！\" loading=\"lazy\" class=\"φbp\"></p>\n<p>说点有意思的，有种特殊的机器叫做自动贩卖机，非常符合日系元素，里面会出售一些药剂饮料以及……粉红色的胖次，价格还不便宜，一条内裤大概要八九千奥伦，更令人表情扭曲的是这玩意算乐器，原因多半是它能用来play（v. 演奏/把玩）……</p>\n<p>售货机里卖胖次貌似属于岛国的都市传说，还是什么梗文化来着，本家其实也有内裤这种道具，不过算作为远程投掷武器存在，可以对击中者造成幻惑属性伤害，只能说Noa放飞自我了，恶趣味更上一层楼；Elin后来也对这些贴身衣物追加了可投掷词条，相比扔硬币之类，它们的优点在于能像回旋镖一样飞回来，重复使用。</p>\n<p><img src=\"files/Elin_OK/pants.png\" alt=\"售货机也能偷出商人包，别刷新库存还能把机器偷走\" loading=\"lazy\" class=\"φbp\"></p>\n<p>让人惊掉下巴的是，词条的追加对象实际上为所有乐器，包括麦克风、小提琴、吉他……以及钢琴，没错，一架砸完人的还会自己飞回来的三角钢琴出现了，由于它的基础重量十分沉重，通过*素材变化卷轴*将其材质改成硬度和密度都更高的精金之后，威力更恐怖，一砸一个不吱声，投掷侠携手钢琴师再度崛起！接招吧，这就是我们热血澎湃的组合技！</p>\n<p>但好景不长，钢琴的可投掷词条在alpha 20.24版本中被单独移除了，唉，明明是一个十分有趣的特性，只需要稍加平衡即可；哦对，演奏内裤是什么口感？这点交由各位自行体验，本人在此郑重声明：我的钱都是大风刮来的，没放下过身段去吹裤衩子卖艺🙄（其实有</p>\n<h2 id=\"#10-越级制作榨干潜力\">#10 越级制作榨干潜力<a title=\"##10-越级制作榨干潜力\" href=\"##10-越级制作榨干潜力\"></a></h2>\n<p>假设有能扔出去的钢琴，那前提也得是背得动，否则敌人来不及砸死，自己先要被压溃了，虽然攒了一身好装备和相当数额的金钱，但角色本身的各项属性与开局相比，并没有增长多少，提高肉体方面的硬实力成了当务之急。</p>\n<p>通常情况下咱得慢慢食疗然后加以锻炼，因为Elin不存在人物等级，没法杀杀怪就快乐加点，人与人的本质差距主要体现于技能等级与属性值上，抗性虽然也是一方面，但它们更依赖外在装备；推断一下α测初期的成长公式，大致有几点核心要素，首先，提升技能可以反哺属性积累，其次，技能所获经验值受潜力影响，最后，也许是考虑到连升几级的可能性，升完级后剩余的技能经验不会清空，而是用到下一等级的提升上。</p>\n<p>明眼人估计已经看出来了，这样计算的话，增益应该按不同目标分批处理，因为每次升级后技能潜力都会降低，此外也可能导致原有行动的经验倍率产生变化；可Noa在这上面疏忽大意，选择了先把总经验以<strong>初始条件</strong>直接算完，然后全用于依次升级，导致玩家叠一个非常高的经验加成后，能连增几十点属性。</p>\n<p><img src=\"files/Elin_OK/supermake.jpg\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/supermake2.jpg\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>具体步骤如下：</p>\n<ul>\n<li>第一步，学习一项与属性对应的生产型技能，比如木工与力量相关，制造与灵巧相关，然后消耗白金币将该项技能的潜力训练至1100的上限</li>\n<li>第二步，搜寻合适的配方，等级需求越高越好，生产常规道具与烹饪料理相去甚远，即便水平不足也不会做出垃圾，反而每件制作物都将给予我们高额经验</li>\n<li>第三步，备齐材料，由于需要进行大批量制作，一定要保证素材充足，即使采用更低级的配方也在所不惜</li>\n</ul>\n<p>属性潜力（不是技能潜力）能攒则攒，它会影响技能到属性值的“转化效率”，但缺乏高级食材攒不动也无所谓，技能连升几十级的话，它大概率消耗到半路就被榨干了，最终结果差不了太多；一切就绪后，站在工作台旁带着所有材料准备开始操作，在此之前千万记得备份存档，因为接下来创造的经验，很有可能会多到数值溢出。</p>\n<p>感谢Elin的独特机制，成品数量不会影响制作次数，几百件物品照样可以被当作一次制作，这样叠加所产生的经验，约等于高级配方乘以几百倍作为基数，再乘以越级倍率，1100的潜力加成等一系列因素之后的总和；虽然“正常情况”下角色将增加几十点属性，但制作数量稍有差池，也可能造成上溢错误（超过数据类型可表达的最大范围），导致技能和属性受负值影响，不增反降。</p>\n<p><img src=\"files/Elin_OK/overflow.png\" alt=\"解包得出经验上溢边界疑似为268435455，约2.6亿\" loading=\"lazy\" class=\"φbp\"></p>\n<p>实际上，各种溢出和错误数值已经到了屡见不鲜的程度，本家有多保守，Elin就有多奔放；不知道为何，金钱和重量这类不应当出现负值的数据，也都用有符号整数储存，或许是根本没考虑过有人能达到上限吧。</p>\n<h2 id=\"#11-仙人掌与虚空产蜜\">#11 仙人掌与虚空产蜜<a title=\"##11-仙人掌与虚空产蜜\" href=\"##11-仙人掌与虚空产蜜\"></a></h2>\n<p>在我们忙着用邪道大刷特刷时，正常发育组也没闲着，找出了不少好用的生财之道，其中又要属仙人掌和蜂窝酒尤为突出。</p>\n<p>种地是自本家起就一直存在的玩法，主要作用是产出各种草药，部分高级种子也能结出装备或者矿石之类的果实，相当魔幻；Elin的种植系统则变得更加写实，呃，至少设计初衷如此，作物大多是些现实中存在的植物，玩家需要铲掉草皮，锄地，播种，施肥，甚至用喷壶定期浇水以增加幼苗的生长速度，听起来……像是《星露谷物语》？</p>\n<p>确实像，但这边更宽松一些，毕竟咱不是专业农场主，还得出去冒险，没法天天守在地里，稻草人插不插貌似没区别，鸟要是敢下来叼种子，保准第二天就有拿草籽批发鸟肉的漏洞仙人；作物少浇水也不会枯死，只是长得慢一些，玩家们后续发现把农作物栽水里甚至能省去浇水，更方便了，直接大搞水培和稻田，谢谢无底壶。</p>\n<p><img src=\"files/Elin_OK/farm.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>育种算是Elin耕种系统中比较有趣的设定，买到的或者野生的种子默认是+0白板，作物成熟后用其他工具收获可以得到果实，如果用镰刀收获则可以得到几个种子；这些新种子有概率升级并获得一些词条，正面加成和负面减益都可能出现，种子已存在的词条能遗传给后代，再次收获新作物便有机会取得新特性，或是加深现有词条的程度，比如光亮变成靓丽光泽，超甜变成糖分爆炸。</p>\n<p>总而言之，农业就是不断培育种子，汰劣留良，扩大种植规模的过程，除了需要留种的部分，多余作物加工后卖掉或自己食用都是不错的选择；α测初期每一代种子最多只能升一级，后来似乎改成了按照玩家的耕作技能而定，算减少了劳动量；值得注意的是，种地需要密切关注家园的土壤肥力，一旦杂草树木过多就会影响作物结果，导致颗粒无收。</p>\n<p><img src=\"files/Elin_OK/seed.png\" alt=\"杂草疯长？那就焦土政策\" loading=\"lazy\" class=\"φbp\"></p>\n<p>常规作物从播种到可收获大约需要20天，水培+施肥能够缩短到9天左右，已经非常快了，但偏偏有一种植物鹤立鸡群，生长变异迅速，堪称行走的转基因体——仙人掌，它不像别的作物有好几个生长阶段，从种子到成熟只需要仅仅1天，别人收一茬的功夫够它迭代二三十次，能生吃能烤熟能烹饪，还能拿去酿酒用来卖钱，简直是完美的万金油。</p>\n<p>另外仙人掌的种子也好获取，任意一种沙漠地形便可轻松找到野生植株，甚至有沙子的海滩都行，但想要找到野生的西瓜或苹果用于采取种子，就几乎是不可能的事了；仙人掌自然抗旱，而成熟仅需1天也没必要种在水里，更惊人的是Elin虽然冬天会下雪，各种建筑还绘制了单独的雪景，作物生长却不受严寒影响，即使没有温室它们也不会枯萎或停止生长，草地被积雪覆盖只要铲个雪便可正常耕地，到头来仙人掌还是耐寒作物。</p>\n<p><img src=\"files/Elin_OK/farm2.png\" alt=\"is by design？\" loading=\"lazy\" class=\"φbp\"></p>\n<p>蜂箱则为更纯粹的无成本收益，在α测初期摆在家里就将每天产出一块蜜脾，两块蜜脾放到石磨可以磨出一罐蜂蜜，能用于烹饪或出售，价格在五十奥伦出头，但单独一块蜜脾直接卖掉也有近二十奥伦，为此辛苦推石磨并不值得，最早那会儿甚至倒亏钱。</p>\n<p>虽说啥都不用干，光挂机卖蜜脾，靠一座蜂箱两个月都能收入上千，但这样的效率还是低了些，接下来就要提到Elin非常离谱的酿造机制了，在咱们Ylva，肉类甚至都能酿成酒，未经加工的蜜脾自然也行；蜜脾发酵为蜂窝酒后价格翻了快四倍，将近七十奥伦，代价仅需一只酿造桶，可以很容易从城镇中征收或者偷得，玩家后续弄到配方还允许自行制作；由于物品堆叠上限非常高，桶里又能放好几组物品，一只酒桶便可处理成千上万块蜜脾，玩家除了搬运一下物品之外，还是什么都不用做，而利润已经来到了一个月两千奥伦，两座蜂箱就是四千，五座就是一万，摆得越多赚得越多。</p>\n<p>玩家也能把成堆的蜜脾先磨成蜂蜜再扔进酿造桶，蜂蜜酒远比蜂窝酒值钱，但考虑到一罐蜂蜜相当于两块蜜脾，最终累死累活连十奥伦都换不来，充分地体现了玩家劳动的廉价与非必要性，唯有躺着收钱才是出路。</p>\n<p><img src=\"files/Elin_OK/honey.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/honey2.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>开发者显然不希望玩家这么舒坦就做到财富自由，新版本反手一刀大砍，将家园中的鲜花数量作为制约要素，如果不够的话，蜂箱就无法产蜜，一时间哀号遍野，众多养蜂大亨如丧考妣，纷纷扭头去研究花卉种植技术，并试图用特殊手段突破肥力限制。</p>\n<p>曾经因为杂草疯长而坚壁清野的玩家重新在耕地里种满了野花，几番辛勤劳作后，蜂箱才再次流淌出了甘甜的蜂蜜，正当他与他的花海准备共度晚年时，意想不到的事情发生了，地里的“摇钱树”们居然因为花期结束而纷纷凋谢，之前那番繁华景象原来只是过眼云烟，转瞬即逝。</p>\n<p>霎时，嬉笑怒骂不绝于耳，笑是没素质的人（我）吐槽花白种了，骂是其他群友觉得Noa管太宽，新内容添加太慢，净在游戏初期折腾平衡，断掉玩家为数不多的财路。</p>\n<p><img src=\"files/Elin_OK/flower.png\" alt=\"人在北提里斯就应当不断与自己和解\" loading=\"lazy\" class=\"φbp\"></p>\n<p>可事实是上帝把门窗都关上的时候，并没说这间房子有墙，花朵的状态即便是枯萎，它在程序中也依然算作一个有效计数，最后看到的效果就是几田残花败叶养活了无数蜜蜂，使得蜂箱照常吐蜜；简直修复了个寂寞，大伙发现真相后都挺无语，不过养蜂这一系列反转反转再反转也着实有趣。</p>\n<h2 id=\"#12-暗物质\">#12 暗物质<a title=\"##12-暗物质\" href=\"##12-暗物质\"></a></h2>\n<p>要是玩家有尝试大面积垦荒，那么一定被东零西落的巨石所困扰过，虽然可以捡坚硬的花岗岩石头用于制作石镐，但那些大块巨石其实是铜矿，对应硬度直接采用了金属材质的数值，石制的工具自然凿不动，甚至一度出现过“我的镐子只能挖泥巴”，“那去采矿做高级镐子啊”这样的逻辑循环。</p>\n<p><img src=\"files/Elin_OK/pick.jpg\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>这方面涉及到本家的一项机制——素材变化，主要方法有两种，使用一次性的素材锤将物品更改为某特定材质，以及阅读素材卷轴（已在β测中被删除），能够将物品随机更改成另一种材质；部分像是秘银、精金、以太之类的顶级材质仅有通过带&quot;*&quot;的强力卷轴才能roll出，而受诅咒的低级卷轴则可能会让您的钻石大宝剑变成纸剑或者生鲜剑（还真能吃掉）。</p>\n<p>装备受材质影响非常大，涉及到价值、伤害、抗性、重量等等，以太可以制成极度致命的武器，作为防具的性能却还不如钢铁，精金虽然攻防兼备，但其高到离谱的重量也不得不让人犹豫一番；与之不同的是，家具等功能性物品的效用几乎不受材质影响，黄金幸福床与灵布幸福床睡起来没有一丝一毫差别，可在重量方面，前者能压死人，后者随身揣着到处跑都没问题，所以素材降级不完全算是坏事。</p>\n<p>评价一把镐子好坏，那最重要的便是其硬度，该项数值与技能等级共同决定了挖掘难度，通常情况下买张卷轴把花岗岩镐子变成其他更硬的材质，便可解决只能挖泥巴的问题；但我们显然不满足于此，既然以神为目标，那用的东西理所应当是天下第一才配得上身份，解包游戏文件，硬度最高的材质是什么？答案出乎意料也相当陌生，暗物质（dark matter）。</p>\n<p><img src=\"files/Elin_OK/hardness.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>暗物质是本家没有的素材，硬度在Elin中约为精金秘银一类的两倍，哪怕玩家是没有挖掘技能的废物，拿上它做的镐子也可以像热刀切黄油一样，将世间万物视若无物；然而我们该怎样获取这种逆天材料呢，群友说它似乎有个“test only”标签，正常游戏里不会生成相应矿物或建筑，*素材变化卷轴*的随机列表也无法roll出这一结果。</p>\n<p>我个人比较好奇它的别名为什么叫void，如果只是表示空值，那其他地方都直接不填，这里的词语更像是有意为之，神会设有对应材质，比如机械神的材质为铬铁，风神为青金石，幸运神则是云母；这样一解释，玩过Elona的估计会立马想到无之艾斯，但祂的英文名称叫做Eyth of Infidel，对应花岗岩，跟void风马牛不相及，真正让我起疑的是Elin存在一种关于void的古祭坛，尽管眼下只能通过特殊手段调出来，但没准表明了暗物质与某种未做完的古代神祇有关。</p>\n<p><img src=\"files/Elin_OK/void.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>撇开那帮神的闲杂琐事，能不能弄到暗物质才是重点，我本来只是在频道随口一问，没想到还真有人见过，对方表示扭蛋的随机列表较为独特，从中生成的装饰物涵盖所有材料，包括暗物质；扭蛋嘛，好说，花费异国货币就可以从扭蛋机里抽出来，那些货币正巧包含任务奖励中，咱批量完成委托时已经攒了一大把，找台机子抽就完事了。</p>\n<p>首件出货的杂物是暗物质头颅，属于恐怖主题装饰物，虽然轻易地弄到了原料，但把它变成可用素材却还要花上几番功夫，考虑到没有比暗物质更硬的东西，那就只能苦练玩家自身的技能，我最终用精金锤配上一百级出头的工艺才成功将其拆解，得到了暗物质原木。</p>\n<p>之后就是不断开扭蛋的测人品环节了，杂物能拆解出的素材类型十分固定，比如易拉罐出废料，装饰斧出条锭，烧瓶出碎片，这些素材会继承原料的材质，也就是我们心心念念的暗物质；它们可以进一步被分解或加工，原木能拆出树枝，树枝再放进切割机里便可制成棍棒，纤维能纺织成线团，线团编制成布匹则可以制作各种容器和帐篷之类的建筑……</p>\n<p><img src=\"files/Elin_OK/gacha.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/darkmatter.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>拆解因为硬度问题所以有技能要求，但加工完全没困扰，毫无经验也能100%制作成功，咱打算做镐子的话就需要尽快弄到暗物质石头或者暗物质条锭，其他棍棒和绳子是什么材质都无所谓，不会影响成品；狂开扭蛋直到出现所需材料不是不行，但如果准备集齐所有暗物质素材，并将身上的全套工具和容器都换成暗物质的，那工作量可就太大了，数千枚异国货币拿去抽扭蛋也不一定够用。</p>\n<p>接下来就得提到Elin的染色机制了，直接对物品使用染料可以改变其贴图，各项属性维持原状，这不是我们想要的；然而一旦将瓶子投掷出去摔碎，溅到物体上的染料将会造成附着bug，虽然硬度等基础数值不变，但采集后得到的素材却会错误地读取并继承染料的材质；举个通俗的例子，假设有瓶暗物质染料，路边随便找块能徒手采集的岩石，对着它投掷染料，岩石将会附着上暗物质，此时玩家仍然能够直接采集那块岩石，最终得到的却是暗物质石头。</p>\n<p>看上去仅是增加了点容错率，可将染料当作所需的素材而已，额，在α测初期确实是这样，不过在alpha 20.43版本后，游戏添加了染织商人，而这名新店主的商品列表同样不受材料限制，给玩家留下了批发暗物质染料的漏洞，又因为投掷操作不会增加目标的采集难度，之前练习拆物品技能的环节全都可以省略掉，彻底铺平门槛。</p>\n<p><img src=\"files/Elin_OK/dye.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p><img src=\"files/Elin_OK/dye2.png\" alt=\"露露薇身材太好了，遮一下\" loading=\"lazy\" class=\"φbp\"></p>\n<p>只需染两块石头，即可获取全游戏最硬最强的镐子，其他物品也能如法炮制，染骷髅获取暗物质骨头，染盐岩获取暗物质调料，染大王花获取暗物质树叶；要注意的是不能对物品直接使用染料，必须通过投掷的方式附着，以及染料无法在撞到家具等人工建筑时破碎，所以该方法基本上只对自然资源有效。</p>\n<p>当然，我们可以自己将进阶素材加工出来，完全摆脱扭蛋的运气成分，诸如染珊瑚获取碎片然后烧出暗物质玻璃，染巨石挖出暗物质矿石，然后炼成条锭；不过巨石与能徒手采集的岩石不同，附着染料后会非常硬，玩家即使拿暗物质镐子也需要20级左右的采矿（Mining）技能才挖得动。</p>\n<p>但α测非常早期的时候有种比较取巧的方法，随意造块木地板或者草地板，往巨石的位置一拍，巨石便会因为建造的自动替换功能被“压碎”，以素材形式掉落，可惜该特性在染织商人添加之前就被修复了，用处不大。</p>\n<p><img src=\"files/Elin_OK/floor.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>总之，开动脑筋，条条大路通染料，暗物质的空间性能估计极为优异，制成的洒水壶灌满可以用44次，反观以太喷壶才能用28次，我后来把角色身上的各种袋子小包，还有随身帐篷全换成了暗物质的，遗憾的是这些道具都固定容量，没法体现其材质的优越性。</p>\n<p><img src=\"files/Elin_OK/tool.png\" alt=\"暗物质鱼竿，听起来就很适合虚空垂钓\" loading=\"lazy\" class=\"φbp\"></p>\n<h2 id=\"#13-蓝图复制与无中生有\">#13 蓝图复制与无中生有<a title=\"##13-蓝图复制与无中生有\" href=\"##13-蓝图复制与无中生有\"></a></h2>\n<p>任何东西，总会有不够用的时候，比如说珍贵的暗物质素材，拆完一个又得去染第二个，各种药水卷轴由于缺乏批发渠道，也只能一点点积攒，另外像是高级料理、金钱货币、强力装备，就没有不缺的，存在一劳永逸的解决办法吗？答案是肯定的，然而那犹如潘多拉魔盒，一旦打开，可能会让整个游戏索然无味。</p>\n<p>该禁忌之术名为蓝图复制，什么是蓝图，常玩生存建设类游戏的朋友肯定不陌生，正是建筑设计图，在Elin中它的作用为花钱复制区域建筑，所需金额波动较大，不过至少为物品售价的两倍以上；这本应当用于后期快速建设据点，没曾想，它的判定有个致命疏忽，那便是不会计算未建造物品的价值，但复制内容却照常包含了所有掉落物。</p>\n<p><img src=\"files/Elin_OK/blueprint.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>什么意思呢，只要玩家将物品以掉落物的形式直接扔到地上，再使用蓝图，便可<strong>一分钱不花，无限复制地上的道具</strong>；虽称之为“复制”，但在底层实现上套用的是重新生成，所以复制武器装备的话，词条和品质不会固定，我们可以用这种办法，将一件普通装备“变”出无数件白星同款。</p>\n<p>白星☆是与黑星★类似的一种品质前缀，不过与黑星道具由开发者预定义不同，它几乎完全来自于程序生成，所以也被叫做随机神器（random artifact），主要特点是性能上下限更高，允许带有更多的增益词条；正好说明一下蓝图原有的缺陷，它无法复制任何生物、货币、卡片标本、白星或黑星道具，除此之外，箱子内的物品也会忽略不计，必须拿出容器才能当作目标。</p>\n<p>由于博物馆等地产系统暂未实装，标本和卡牌基本用于收藏，馋那点掉率增益不如直接复制怪物的掉落物；接着是生物克隆，虽然可以将对象捕获后复制精灵球，但它们哪怕再生成后数值发生变化，其内部指向的仍然是同一只生物，没法让目标增殖，计划宣告失败，好在咱没有这类需求。</p>\n<p>缺钱？既然蓝图没了代价，随便复制点温戴尔披风和极光戒指之类的稀有装备扔进出货箱，第二天就该发愁奥伦和金条太多怎么花，至于异国货币、征收券、白金币，这都属于任务奖励，利用前文的批量完成委托的漏洞，便能成堆成堆的搞到，唯一不好获取的只有★小奖章，怎么解决呢，还记得早期版本可以洗劫店主吗，收奖章的矮人工匠也在此列，偷偷抢抢直接立省100%。</p>\n<p><img src=\"files/Elin_OK/report.png\" alt=\"使用许愿在风讯刷屏，所以市民会梦见纸羊吗\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/copy.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>关于神器类物品，白星通常是复制结果而非原对象，至于黑星嘛……一想到本家中甚至不能持有两件相同的（Elin目前允许），无法复制瞬间好接受了不少；可只是这样的话，蓝图似乎也算不上禁忌之术，无非是让我们从提里斯富翁变成了Ylva财神而已，就算道具用之不竭，那总得先搞到一件原物才行。</p>\n<p>此时需要为该邪道引入一种催化剂——“许愿”，奇幻故事中经常出现饮下泉水或擦拭油灯后，蹦出灵体为主角实现愿望的情节，此等机缘在Roguelike中亦有记载，Nethack、ADOM、Elona都设计了类似机制；Elin也不例外，狂喝井水或喷泉便有概率能向女神许愿，虽存在些限制，但大体上是玩家要什么就给什么，可相较于本家逐渐降低出现概率，这边定死了一年内最多仅能通过喝水许愿一次，吝啬至极。</p>\n<p><img src=\"files/Elin_OK/wellwish.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>咱的确可以通过复制水井或者雪村圣井，来快速喝出许愿机会，但一年一次又有什么意义呢？别急，先向女神索要一根许愿杖（wishing rod），这是种非常强大的魔法物品，挥动后效果同样是满足玩家一个愿望；与其他游戏不同，这种法杖是一次性的，无法充能，用过之后就成了根破棍子，所以正好注明：为了满足愿望而给予的许愿杖，必定是“剩余0次”的不可用状态。</p>\n<p>看上去我们刚刚浪费了本年仅有的许愿机会，但可曾记得蓝图及其底层实现？简简单单复制一下，由于是重新生成，哪怕储能耗尽的许愿杖也将变为“崭新出厂”。</p>\n<p><img src=\"files/Elin_OK/wishrod.jpg\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>转眼间，我们便拥有了无穷无尽的许愿杖，搭配上蓝图功能，要什么有什么，要多少有多少，简直是人形外挂，张口即神谕。</p>\n<p>诅咒之馆的支线更新后，地下室底层可以稳定获取一根未被使用的许愿杖，这样即使挑战永恒盟约难度，禁止S/L也不足为惧；蓝图比较特殊，最早在大使馆花6000左右奥伦能直接购买，发现复制漏洞后，咱同样第一时间通过正版渠道发送了bug反馈，但万万没想到开发者选择不修复，而是删除了物品的获取途径；自alpha 20.15之后，蓝图就售罄成了绝版物品，可之前已存在的蓝图却不受影响，依然能无代价复制物品，着实让人摸不着头脑。</p>\n<p>群里当时有群友开玩笑说“这怕不是Noa防止自己穿越到游戏里被暴揍，专门留的后门”，现在一琢磨还真有几分道理，因为直到β测尾声，蓝图漏洞都仍旧未被修复，反倒快捷建造功能被搁置至今。</p>\n<p><img src=\"files/Elin_OK/feedback.png\" alt=\"留张复制蓝图的蓝图就等于完全没修\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/farewell.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>后来我测试旧版本时还发现了个奇怪的特质，从steamclient_loader启动的盗版游戏无法使用蓝图，一旦阅读就会导致进程卡死和ui全部消失，Unity也有概率弹出报错信息；故障原因尚不明确，但运行Elin本体走一遍sbeam的正版启动流程便能解决这一问题。</p>\n<p><img src=\"files/Elin_OK/stuck.png\" alt=\"Elin.exe未响应\" loading=\"lazy\" class=\"φbp\"></p>\n<h2 id=\"#14-提里斯赌王\">#14 提里斯赌王<a title=\"##14-提里斯赌王\" href=\"##14-提里斯赌王\"></a></h2>\n<p>忽然想起还有筹码这么个货币，在赌场叱咤风云也算是从ADOM继承到本家的“传统习俗”，但与隔壁按住空格不松手就能获得巨额财富不同，Elona得专门等大幸运日去玩21点（纸牌游戏），那究竟什么奖励能让玩家如此垂涎三尺？答案是——以太抗体。</p>\n<p><img src=\"files/Elin_OK/slot_machine.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>以太风是Ylva世界中的一种自然灾害，会导致生物畸变，其原型正为ADOM的腐化，不过程度上更轻，即便病情再严重也没有致死的可能性，然而考虑到那些变异多数是负面效果，大家通常都避之唯恐不及；麻烦的是有害物质早已渗透到世界的方方面面，就算灾害期间躲在避难所，最后也仍然会因为日常生活的不断累积而患上以太病。</p>\n<p>不幸之处在于以太病无法自愈，也无法根治预防，只有喝下昂贵的以太抗体才能消除一定症状，所以这东西成了生存必需品，价格自然水涨船高，本家里边大几万一瓶是常有的事，更多时候有价无市，想买都买不着；这般珍贵的药剂有机会出现在赌场的连胜奖励中，引得不少冒险者想方设法只为取胜，哪怕出老千作弊也在所不惜。</p>\n<p><img src=\"files/Elin_OK/antibody.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>与本家相比，Elin完善了赌局的娱乐项目，额外加入投篮小游戏和真实可玩的老虎机，它们虽然趣味性尚可，但能给予的报酬实在不太够看；期待高回报就需要承担高投入和高风险，有两种办法可以获得大量赌资，一是直接花钱买，比例为20奥伦换1筹码，其次是在21点中下巨额赌注，赢者翻倍，输家丧失一切。</p>\n<p>注意筹码在该作尽管可以兑换奖品，但那些道具一概不能用于出售，这是由于测试期间很多玩家发现疯狂赌博，然后贩卖奖品来钱飞快，所以兑换列表中的道具都被设置成了针对玩家的“非卖品”；此外，奸商不负责回收代币，奥伦换成筹码后就再也换不回去了，赢来的筹码同样不能变成钱，是否值得购买代币，需要结合情况好好考虑清楚。</p>\n<p><img src=\"files/Elin_OK/slot_machine2.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/meow.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>我不缺奥伦，也可以随口创造出无数以太抗体，但筹码这种东西，不从牌桌上光明正大地赢到手，食之无味。</p>\n<p>一般情况下，咱们应当花体力将波球投进篮筐，以获取原始资本积累，再去尝试其余门槛更高的项目，不过早期版本中存在个漏洞，一旦玩家输得精光，便可领到500枚免费筹码作为安慰奖；而哪怕只拿着1枚筹码输掉也将触发这个保护机制，于是只要玩家领完救济再扔499枚筹码到地上，一直输反而能够实现财富正增长，成为名副其实的“大负翁”。</p>\n<p>可救济毕竟是输掉才得来的，这与前面的原则不符，那有什么手段能保我们稳赢不亏？S/L？固然不错，但要是立下过永恒盟约禁止读档，阁下又打算如何应对？很简单，<strong>虚空押注</strong>，bug期间估计有以0为分界的表达式漏写了等号，玩家的筹码持有数只要刚好为0，便可任意下注，赢了拿走奖励，输了反正包里一个能用来扣除的筹码都没有，毫无损失；如果持有数为正值，则下注金额不可超过该值，而0筹码下注导致持有数为负值时，也无法进一步加注，大于或小于0都将正常运行，无法触发bug，至于赢来的筹码，塞宠物包里或者扔地上都行，不会判断为持有状态。</p>\n<p><img src=\"files/Elin_OK/blackjack.png\" alt=\"致敬离职的社区经理Rusty\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/blackjack2.jpg\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>简而言之：清空背包内筹码，选最大数额ALL IN，随便玩玩牌，输了重来，赢了继续把包内筹码转移至别处，刷上几轮就千万筹码到账了；轻松吧，每笔钱还都是堂堂正正赢来的，毕竟不丢赌注也算一种本事。</p>\n<p>筹码已然积攒成山，等之后更新出赌场npc，即可将兑换列表扫荡一空，每瓶以太抗体的售价仅为3000筹码，要不是限购，咱能买入正常人一辈子都用不完的量，饭前饭后直接拿来漱口；考虑到普通道具能许愿获得，最重要的奖品其实是那些黑星家具与……女神抱枕！虽然只是提供些微睡眠增益的时尚小单品，<s>但我们这种人傻钱多的死宅最喜欢买了。</s></p>\n<p><img src=\"files/Elin_OK/basketball.png\" alt=\"测试初期画得很抽象的临时素材\" loading=\"lazy\" class=\"φbp\"></p>\n<p>然而这一切值得吗？大概率是否定的回答，因为在相当长的一段时间内，以太风停刮了，提里斯居民们久违地回到了安稳生活之中；起因是α测初期内容不足，导致平衡性过差，以太抗体尽管存在于游戏内，但玩家几乎没有搞到它的手段，只能眼睁睁地看着病情恶化接着叫苦不迭，所以开发者从alpha 20.4起删除了整个以太病系统，准备机制完善后再重新引入。</p>\n<p>病症消失也让以太抗体真的失去用处，成了漱口水，至于其他奖品嘛，要么纯摆设，要么咱不缺，而抱枕？<s>肯定当场买爆</s>，不过尔尔，几位女神之后都得亲自给我侍寝，等着瞧吧🤓👆。</p>\n<p><img src=\"files/Elin_OK/ether_disease.png\" alt=\"以太风再临\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/ether_disease2.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<h2 id=\"#15-锻造弑神武器\">#15 锻造弑神武器<a title=\"##15-锻造弑神武器\" href=\"##15-锻造弑神武器\"></a></h2>\n<p>俗话说，工欲善其事必先利其器，之前我一直用着把☆精金大剑，是从黑市店主那里花两千不到买的便宜白星，自带免疫麻痹和增加力量速度的词条，还行，但原材质为硅砂，非常劣质；读几堆*素材变化卷轴*之后给它roll成了精金材质，攻击能力起码翻了六倍有余，多数情况下用到主线通关不成问题，可咱的目标是杀死几大主位神，这点数值如同蚍蜉撼树般不现实。</p>\n<p>所有本家就存在的神祇，在Elin中都是难度评级为Lv9999的实体，不再是Lv350或Lv1200的表层/里层化身，基础属性通通过万，速度也是几千打底，要知道价值连城的加速戒指才给予30不到的增益，凡人与神的差距犹如天堑，令人望而却步。</p>\n<p><img src=\"files/Elin_OK/old_sword.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>该如何弥补？对抗这等超自然伟力，根本不是常规手段能解决的，我们需要动用世界法则的漏洞，而这其中的关键便是前文介绍过的★黑星道具；黑星之所以被称为特殊，就是因为它们完全是预设好的固定值，当然也包括重量。</p>\n<p>可有一种物品名为翅膀卷轴，正常情况下它能以攻防降低为代价，减轻装备重量，主要是妖精种族使用，因为他们无法穿戴重量超过1s的武器盔甲；有趣的是，如果卷轴被诅咒，那么效果会完全相反，增重同时也增加伤害和防御值，巧就巧在<strong>黑星道具虽然重量恒定不可变化，却能正常享受面板加成</strong>。</p>\n<p>疯狂阅读诅咒的翅膀卷轴，就将造出刺伤神明的★武器，叠加后的防御甚至足以抵挡住神全力攻击而不伤分毫，即使祂们的闪避率无人能及，由于暴击必中这一机制的存在，咱仍然能够一刀刀地将这些高位存在凌迟剜死。</p>\n<p><img src=\"files/Elin_OK/new_sword.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>被我选为原料的是本家“老朋友”，★以太匕首，Elin中获取它需要杀死一名无异于半神的护剑者（Sword Keeper），详情会放到文末的速通部分；通常情况下去矮人工匠那里弄一把★屠龙者是更好的选择，入手门槛低，还必定带有“对神族与龙族发挥巨大威力”的增伤词条。</p>\n<p>以前没准会发愁上哪去弄这么多翅膀卷轴，现在既然有了无限许愿和蓝图复制，一句话的事而已，诅咒更是简单，利用蓝图的重生成机制能够快速获得不同BUC（祝福诅咒状态）的水瓶，有了一瓶咒水便可浸泡几千张卷轴，或是混合出无数瓶新咒水，接着只需要一张张读过去就行了，我后来嫌手点太累干脆写了个鼠标宏，全自动锻刀。</p>\n<p><img src=\"files/Elin_OK/dragon_slayer.png\" alt=\"剑风同款\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/kill_god.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>关于翅膀卷轴，还有另外一种漏洞可供利用，那便是搭配素材变化“重置”装备，瞬间变轻变强，堪称妖精福音。</p>\n<ul>\n<li>先将装备（非黑星）更改为高密度材质，比如精金，重量越重越好，但用诅咒卷轴增重无效，必需完全依靠素材本身</li>\n<li>读翅膀卷轴，让装备的重量减少至0.1s极限，无法再被选作附魔对象为止，其数值此时将会正常降低</li>\n<li>使用素材变化卷轴，再将装备重新变为精金之类的高属性材质，但此时它不仅会因为bug仍为0.1s重，其余属性相较于不减重直接改材质，甚至变得更加精良</li>\n</ul>\n<p>该现象未查阅源码，这里仅提供大致猜测，值不变或许是存在检测或修改上的冲突，导致减重后改材质不会复位重量；性能增强则可能是把0.1s当成了初始值，而材质的正常重量被算作更改值，让其受到了类似于诅咒卷轴的增重加成，但由于赋值并未成功，装备依然轻若无物。</p>\n<p><img src=\"files/Elin_OK/different.png\" alt=\"改完材质记得重新涂一下抗酸，这里忘了\" loading=\"lazy\" class=\"φbp\"></p>\n<p>丢开胡思乱想，就结果而言，妖精没法穿戴超过1s的物品，直接用翅膀卷轴又会导致装备劣化，通过这种方法不仅无负担地穿上了轻如薄翼的精金装备，还白白享受了增益，即使是其他种族，能省点负重背别的战利品也总是好的。</p>\n<p>此外，该bug不影响继续使用强化卷轴升级武器盔甲，可由于匕首已经提供了三万多的PV，我并不在乎重甲之类的物理防御，反倒比较关注各种元素和魔法抗性；尤其是我作为巫妖弱火，干脆利用生成机制刷了一堆☆装备，然后都改成龙鳞材质，直接冰火双元素彻底免疫，全属性维持和负面状态无效也都顺带安排上了。</p>\n<p><img src=\"files/Elin_OK/resist.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/resist2.png\" alt=\"高属性后使用xx之歌获得逆天抗性\" loading=\"lazy\"></p>\n<h2 id=\"#16-肉身成圣\">#16 肉身成圣<a title=\"##16-肉身成圣\" href=\"##16-肉身成圣\"></a></h2>\n<p>相较于我所掌握的神之权柄，这幅躯体已经是羸弱到不堪入目的程度，撑死也只算名精锐冒险者而已；纵使借助外力弑神，但终究未能抵达超凡脱俗的境界。</p>\n<p>妄图以凡人之躯拥有神性的不可战胜，必须跨越全属性过万这道鸿沟，Elin暂未加入潜力药水，如果仅凭食物增加潜力，那锻炼到有生之年都不一定能达成，还有什么别的办法吗？</p>\n<p><img src=\"files/Elin_OK/message.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>第一，利用复制祭品和祭坛，快速献祭刷恩惠值，神的加护可以增强角色属性且没有上限，信仰等级太烂就复制点信仰卷轴，读半天够升几百级；但致命缺陷显而易见，现有的神存在对应领域，十分局限，别指望战士神给你加智慧，总体操作起来也不比食疗方便多少，没准更麻烦。</p>\n<p>最重要的是处处受制于神，不能违背神的喜好，更不能改信，完全依赖于加护，颇有一番寄人篱下的凄凉，这般作茧自缚的行径，直接毙掉不考虑。</p>\n<p><img src=\"files/Elin_OK/faith.png\" alt=\"攒点幸运图一乐\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/faithLCK.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>第二，投资黑市店主，其商店规模越大，出售武器所带的属性增幅也就越离谱，几千规模可能有加几百属性的装备，要是能把规模投资到几十万，那属性加值破万的装备都唾手可得。</p>\n<p>可这需要金钱数量犹如天文数字，即使拥有零成本复制，也要不断重复刷道具，卖掉，狂点投资的循环，由于商人每次“限卖”，连点太久还会导致游戏卡顿，实际过程一点也不轻松；另外从本家继承而来的投资机制相当离谱，表面上是玩家出钱帮商店扩大规模，但店主不会因此给予玩家丝毫优惠，本质上接近给人当免费苦力，白白送钱。</p>\n<p>就算忍下来，购得的装备仍旧属于外物，除了能生长肢体的畸形人，其余种族的装备槽位都固定无法增长，如果选择属性增益，势必会与现有防具产生冲突，致使面板与抗性不可兼得，着实不妥。</p>\n<p><img src=\"files/Elin_OK/blackmarket.png\" alt=\"点到卡爆，CE验证的\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/invest.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>第三嘛……吃屎，是的你没有看错，Elin流传着一种两星纯粹大便的传闻，吃下去据说可以全属性+3，然而我运气较差，从来没遇到过这等神物，未经测试，在此也仅做记录。</p>\n<p>倘若传言是真的，那么只需吃下三四千坨纯粹💩就可以全属性破万，先不考虑行为能否被接受，由于蓝图重生成机制，复制后大概率会得到普通品质，短时间弄出这么多纯粹级别完全是痴人说梦；解包数据显示，大便一般情况下食用会扣潜力，如果传闻属实，那应该是品质加成导致的结果，可惜无论排泄物还是正常食材，我都没见过两星极品。</p>\n<p>计划行不通，整件事倒是提供了不错的笑话，让人联想到某病栋梗。</p>\n<p><img src=\"files/Elin_OK/poop.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>除了上述三种方案以外，进展一度陷入僵局，甚至差点放弃，不过现在既然单写一节，自然是再一次突破了不可能。</p>\n<p>启发来自于文末速通，在不断牵制半神的时候，我意识到药水效果不会“刷新”，而是以“叠加”的方式累计；假设一瓶睡眠药水能让敌人昏睡10回合，那再扔一瓶并不会将buff时间重置为10，而是直接增加至20回合。</p>\n<p>于是我便有了一个大胆的想法，肉体/精神恢复两种经典药剂，诅咒状态下会降低使用者属性，普通可以恢复被降数值，而祝福状态的则可以给予永久属性加成，直到角色死亡为止；本家中反复喝下祝福的恢复药剂，仅能“刷新”当前状态，如果Elin的buff逻辑被改为“叠加”，那么……提里斯所有的生灵即将见证新神诞生。</p>\n<p><em>从自动贩卖机中购得恢复药剂，蓝图一挥便出现了漫山遍野，用之不竭的复制品，随手拿起一根许愿杖，神说要有水，于是便有了圣水，两者混合，药剂闪烁着银色光辉，将之一饮而尽，此乃邪道神的现世。——《神诞记 其二》</em></p>\n<p><img src=\"files/Elin_OK/step_to_god.png\" alt=\"muscle! muscle! muscle!\" loading=\"lazy\" class=\"φbp\"></p>\n<p>如同预料，buff效果真的可以无限累计，肉体/精神恢复各对应几种数值，合在一起就是全属性增幅；看着血条蓝条不断加长，角色面板上的数据不断疯长，从三位数变成四位数，乃至五位数，酣畅淋漓，无以复加。</p>\n<p>属性通通2w+以后，HP突破10w大关，角色已经可以单凭肉体屹立在Ylva之巅，哪怕徒手挥出一拳，都能将巨龙和泰坦绞成肉酱，<s>堪称秃头披风侠</s>；由于精神方面的加成，即便咏唱低阶咒语，其威能也足以毁天灭地，无愧于我魔法之神的称号。</p>\n<p>考虑到仅有怪物难度评级，没角色等级，下降药水不用纠结存在与否了，还有什么需要增强？知识方面么，成为移动的大数据库相当简单，许愿随机给予法术书和技能书，复制后读到天荒地老就完事；什么叫去法师公会预定，堂堂魔法之神难道还要屈尊去买书？真是令神乐不可支。</p>\n<p><img src=\"files/Elin_OK/skill.png\" alt=\"其实去别的店买过\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/skill2.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>玩到现在，平衡性已经彻底崩坏了，看着数值不断膨胀也不失为一种乐趣；然而某次跟Noa唠嗑，顺便提了药剂漏洞，没想到第二天就给修了，有一种刚成神就毁掉登神长阶的罪恶感。</p>\n<h2 id=\"#17-支配神明\">#17 支配神明<a title=\"##17-支配神明\" href=\"##17-支配神明\"></a></h2>\n<p>师承Nethack，本家和Elin也有幸运饼干这一道具，吃下后能够阅读一则随机消息，它们有真有假，其中一条为“据说有办法令神也成为你的宠物”，这当然是谣言……吗？</p>\n<p>Elona必需通过改版的星芒光笔或者人体练成才有办法将神拉进队伍，但在目前尚未开发完善的Elin中，神和普通居民使用的是同一套交互功能，只要好感度大于75，便也会显示“邀请加入”的选项。</p>\n<p><img src=\"files/Elin_OK/cookie.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/cookie2.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>想增进关系？一般情况下得用听诊器查看npc详细信息，然后投其所好地不断送礼物，但这样实在太慢，能够速成么？当然行，先往食物里偷偷掺入媚药（love potion），由于同样为叠加药效，一次性掺几十瓶也可一步到“胃”，接着将食物给予npc，吃下去后好感度就会瞬间暴增。</p>\n<p>然而当玩家迫不及待地点击邀请后，会发现神依旧毫不留情地表示拒绝，理由是嫌弃角色太丑，那魅力究竟要达到多少，是好感度一样的固定值还是对方的某个百分比？经逆向小组研讨，结论为最坏的情况，必须完全大于对方才能邀请成功。</p>\n<p><img src=\"files/Elin_OK/lovepotion.png\" alt=\"混入媚药\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/lovepotion2.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>当时还没想起祝福的恢复药水，这则消息犹如晴天霹雳，神的魅力可都是一万起步，几千说不定能当成通关目标攒攒，也要上万那只能给黑商投资到海枯石烂……或者等提里斯什么时候不刮以太风，改下纯粹的屎雨，然而那玩意保质期挺短，还得趁热（悲）。</p>\n<p>对于抗拒啃屎的群友，就出现了某病栋名言：“连为了女神而食大便都不肯，你好意思说你爱她吗？！”</p>\n<p><img src=\"files/Elin_OK/meeting.png\" alt=\"逆向作战会议\" loading=\"lazy\" class=\"φbp\"></p>\n<p>时过境迁，物是人非，现在我近三万的魅力够把女神迷到神魂颠倒，而且随时还能再喝再加；唯一担心的只有拿上★弑神匕首后，经常一击千万甚至过亿伤害，就怕全属性20w+后，这伤害得溢出成负数。</p>\n<p>条件皆已满足，几大主位神也将成为咱的宠物，麻烦的是祂们的召唤途径压根没来得及做，只能用控制台生成；好在恩惠值和许愿杖都用不完，无论最后要11月跑去休战地还是愿望召唤都没所谓了。</p>\n<p><img src=\"files/Elin_OK/console.png\" alt=\"毕竟都有杀神委托\" loading=\"lazy\" class=\"φbp\"></p>\n<p>真神的速度都相当离谱，作为宠物护主的话，经常是我刚走一步祂们就已经清场完成了，想拥与之匹配的速度有两种办法，一仍是投资黑商，可以买到加几万速度的戒指，二是依据个人喜好挑个宠物女神，直接骑到对方身上，角色速度自然就与坐骑同步了。</p>\n<p>早期版本骑上就不要再下去刷新，因为后来改过计算公式，不适合骑乘的生物会有巨额减益，几千速度亏成几百；那么跟真神拥有一样的速度是什么体验？差不多相当于整个世界被按下了慢放键，角色和神宠可以正常移动，而其他生物很久才能行动一轮。</p>\n<p>身上的挂件不嫌多，骑都骑了，自然不介意怀中再多抱（寄生）一位，不过这次不再是为了宠物背包无限负重，而是为了白嫖女神的DV（闪避值），以及一个外置血条；寄生宠物死亡前，宿主不会受到任何外伤，只有饥饿或者自己作死才可能直接扣血；此外这堆挂件都有自动回击能力，无需亲自动手，敌人一旦凑近就会被附身的神明瞬间斩杀。</p>\n<p><img src=\"files/Elin_OK/carry_me.png\" alt=\"下方蓝条为寄生的外置血条\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/sleep.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/hug.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>骑乘着风之璐璐薇，寄生着调和之艾琳，身后跟着朱亚与艾赫卡托尔，简直是神生巅峰；祂们武器都是我配的对应黑星，例如朱亚使用★圣枪，喵咪咪因为★幸运短剑缺货，给予了★切鱼刀。</p>\n<p>换装纯属个人癖好，毕竟这帮真神赤手空拳也能杀穿提里斯；从开局挣扎求生到现在享受着每天和女神抢床睡的美好生活，真是令人唏嘘。</p>\n<p>！字面意思上的会抢你床位<br>\n字面意思上的抢角色床位</p>\n<h2 id=\"#速通\">#速通<a title=\"##速通\" href=\"##速通\"></a></h2>\n<p>【Elin】妖精观光客9分23秒速通神明Glitch Any%<br>\n<a href=\"http://www.bilibili.com/video/BV1gK4y167b2/\">www.bilibili.com/video/BV1gK4y167b2/</a></p>\n<p>这是早期闲来无事时，自己进行的一项挑战，尝试从开局到击杀护剑者（Lv1200）最短可以用时多久。</p>\n<p><img src=\"files/Elin_OK/speedrun.png\" alt=\"9min23s\" loading=\"lazy\" class=\"φbp\"></p>\n<p>当时已经发现了蓝图复制，卷轴锻刀之类的漏洞，然而打算弄一件黑星（无法许愿）再加重到弑神的话，那估计得挂机至少半小时，另外买翅膀卷轴也还肯定要roll上好一阵子。</p>\n<p>所以我最终决定转向使用本家就存在的一项古老技术——咒酒，这是利用诅咒食物+呕吐机制快清空饱腹值，导致对方饿死的击杀方案；与本家略有不同的是，此次速通不会刻意利用厌食症，等boss把自己吃死实在不可控且慢，既然已能复制道具，不如加大剂量灌到吐死。</p>\n<p>非常巧的是这名boss没有任何抗性与免疫，我们可以轻松将其强控，睡眠尽管生效时间更长，但似乎会阻碍呕吐，所以转而采用了麻痹药剂。</p>\n<p>起初我将药剂扔在身前，等对方冲到面前时自己踩到，瞬间制动停“龙”车，然后我再趁机后撤并不断循环；可某次扔完身前的麻痹后忘记切换成咒酒，继续拿着麻痹药水往boss身上砸，就是那一趟，我意识到了<strong>药水效果为叠加而非刷新</strong>，正是前文喝药飞升的核心原理。</p>\n<p><img src=\"files/Elin_OK/block.png\" alt=\"停 神 车！\" loading=\"lazy\" class=\"φbp\"></p>\n<p>原定目标是比卷轴锻刀快就行，最好能在半小时内解决，没想到初次尝试的结果就为32分34秒，非常之接近；随后优化流程与操作再快了几分钟，本已相当满意，但发现药效叠加后，省去四处拉扯牵制，直接将时间压缩至了10分钟以内。</p>\n<p>接下来请看时间轴解析：</p>\n<ul>\n<li>0s角色创建完成，选择妖精自带偷窃，其他种族选择盗墓贼即可</li>\n<li>12s离开自家</li>\n<li>33s抵达大使馆</li>\n<li>51s无视重量偷窃成功，起初这一步是去帕罗米亚偷国王床，后来发现大使馆这台家具扭蛋机也比较值钱，流程优化</li>\n<li>1m01s购入2张蓝图</li>\n<li>1m08s吃点莓果防止饿死</li>\n<li>1m20s抵达休战地四喷泉</li>\n<li>1m30s喝出许愿，快得离离原上谱，要一根许愿杖用于复制</li>\n<li>1m39s自杀回家</li>\n<li>1m42s拆礼物，必定获得一瓶库莱姆酒</li>\n<li>1m52s增加蓝图数量</li>\n<li>2m02s利用重生成机制复制许愿杖</li>\n<li>2m08s许愿麻痹药剂+普通的水</li>\n<li>2m22s少量倍增三种液体</li>\n<li>2m55s已有两瓶咒水，大规模复制另外两种液体</li>\n<li>3m55s拾取完成，混合出诅咒的麻痹药剂与咒酒</li>\n<li>4m18s复制几碗蔬菜粥作为食物</li>\n<li>4m30s启程出发</li>\n<li>5m00s至6m20s失误，基本是在浪费时间</li>\n<li>6m50s召唤完成</li>\n<li>7m03s轮流投掷药剂与咒酒</li>\n<li>9m19s目标死亡</li>\n</ul>\n<p>除了召唤时间卡歪，然后脑子一抽浪费一分多钟外，还是比较顺的，尤其许愿来得格外快，不过两者互相匀匀倒也符合平均预期。</p>\n<h2 id=\"#补遗\">#补遗<a title=\"##补遗\" href=\"##补遗\"></a></h2>\n<p>本文大体上按递进关系排序，而非发现时间的先后，由于临近Elin发售，还有很多没写没确认或者忘记了的bug，这里单独再挑几个比较有趣的提提。</p>\n<p><img src=\"files/Elin_OK/laugh.png\" alt=\"前倨而后恭，思之令人发笑\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/putit.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p><img src=\"files/Elin_OK/ton.png\" alt=\"大惊，遂发推\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/broom.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>**硌手刺猬，这个刺猬不是说我本人，而是指地上爬来爬去的那些普通同族；它们属性不高，基本也没有什么威胁，问题是杀死后会对玩家造成流血状态，为百分比真伤，无视闪避防御，可恢复值却跟HP上限无关。</p>\n<p>一般人通常无所谓，伤反正过一会儿也自然好得差不多了，但对于HP以万计的神来说就很头疼，流一次血亏起码亏大几千的HP，不养上几天根本回不满，防御明明高到可以无伤弑神，揍个刺猬反倒需要治疗杖。</p>\n<p>正确处理方案是什么呢，远程击杀即可，然而在刚更新投掷武器那阵子，开发者忘记添加豁免，导致角色隔着几十米砸死刺猬以后仍然会凭空大出血……</p>\n<p><img src=\"files/Elin_OK/bleed.png\" alt=\"没准多弄点宠物刺猬都能弑神\" loading=\"lazy\" class=\"φbp\"></p>\n<p>**征服异次元，月门是本家就存在的一种联网家具，可以让玩家访问其他人上传的建筑，刚加入时限制较少，有两种行为格外有趣。</p>\n<p>充满恶意的破坏狂想着怎么拆人房子获得资源，抢人地里的农作物，后面收割不掉植物又改成用镰刀偷种子，还通过占领别人家的祭坛刷恩惠值，甚至击杀别人家中的特殊npc以获取黑星道具，当时流传甚广的一句名梗为“家具，意思是从别人家里捡来的道具”。</p>\n<p>恰恰相反的是还有一帮乐善好施的玩家，专门为了方便其他人而上传地图，月门功能未实装就在考虑如何惠及拜访者；例如往家中摆放许多开锁箱子和训练假人，地里塞满成熟的农作物，还通过未放置容器的漏洞给人送高级装备与道具，甚至连培养的强力随从也乐意分享。</p>\n<p><img src=\"files/Elin_OK/moongate.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/moongate2.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>当然，上传的都是复制文件，即便破坏也不需要有心理负担，再次访问又将恢复如初；咱作为α测玩家，自然也将地图早早发布了，甚至是CN区首位，可惜月门漏洞基本在Alpha 20.68被修复殆尽，各位只要把语言切换成中文就有几率遇到，虽然没弄成本家那样的无限许愿房间，但万一还能从邪道宝库里带点伴手礼回去呢，欢迎来串门。</p>\n<p><img src=\"files/Elin_OK/moongate3.jpg\" alt=\"拜访Mofumatic\" loading=\"lazy\" class=\"φbp\"></p>\n<h2 id=\"#尾声\">#尾声<a title=\"##尾声\" href=\"##尾声\"></a></h2>\n<p>Noa的个人主页和本家源码里一直有这么张简易地图，这是20年前就存在的世界设定；时至今日，我们仍然能在Elin中见到它的高清细化版，内容上几乎分毫不差。</p>\n<p>真是不由得让人感慨一句初心未改，细水长流。</p>\n<p><img src=\"files/Elin_OK/map.png\" alt=\"Ylva资料馆上也有\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/map2.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>基于众筹性质，不同赞助档位的玩家可以许愿一些内容加入进游戏，支持了3500usd以上的共有七人，他们都能为游戏加入新的大型城市，另外金额稍低的则可选择小型村庄；即便考虑到有人更乐意添加特殊npc或是机制之类，我们仍然能够见到起码十余座，由玩家赞助出来的城镇据点。</p>\n<p>游戏自身肯定还有更多内容，从本家残缺的南提就可见一斑，北提已经快塞满了，所以开放新区域几乎是板上钉钉的事，甚至大胆一点，加入新大陆也不是没可能。</p>\n<p><img src=\"files/Elin_OK/backer.png\" alt=\"alt text\" loading=\"lazy\"><br>\n<img src=\"files/Elin_OK/backer_wish.png\" alt=\"alt text\" loading=\"lazy\"></p>\n<p>少数值得吐槽的地方在于，现在虽然更新频率不低，但大部分都是小修小改，新内容填得不够快，平衡性调整净逮着好用的削，尤其是玩家普遍开局困难的情况下，显得较为“阴间”。</p>\n<p>退一步讲，主线剧情什么的就算一时半会做不完，至少提供了创意工坊，期待在ea期间看到社区的优秀作品。</p>\n<p><s>你可千万不要像隔壁那样变成下一个紫色石头或者屎大棒.jpg</s></p>\n<p><img src=\"files/Elin_OK/dream2.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p>此处本来有段“怀古伤今”的唏嘘之词，涉及本家停更与Elin复出，但想了想还是算了。</p>\n<p>这一切，或许也只是死者之梦吧。</p>\n<p><img src=\"files/Elin_OK/dream.jpg\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n<p><em>欢迎各位冒险者在ea阶段来Ylva逛逛，遇到困难直接亮名片报我名号，有人试过了并不管用（划掉）</em></p>\n<p><img src=\"files/Elin_OK/final.png\" alt=\"alt text\" loading=\"lazy\" class=\"φbp\"></p>\n","prev":{"title":"Ephesus Roguelike Server 已上线！","link":"2025/server"},"next":{"title":"衰退之中","link":"2024/in_decline"},"plink":"http://www.ephesus.top/2025/Elin/","toc":[{"id":"elin-alpha阶段幽默漏洞的不完全摘录","title":"Elin alpha阶段幽默漏洞的不完全摘录","index":"1"},{"id":"#1-开局导师祭天","title":"#1 开局导师祭天","index":"2"},{"id":"#2-小水池钓鲸鱼","title":"#2 小水池钓鲸鱼","index":"3"},{"id":"#3-料理返鲜","title":"#3 料理返鲜","index":"4"},{"id":"#4-奥伦投掷者","title":"#4 奥伦投掷者","index":"5"},{"id":"#5-批量完成计数任务","title":"#5 批量完成计数任务","index":"6"},{"id":"#6-善恶与宠物","title":"#6 善恶与宠物","index":"7"},{"id":"#7-信仰与铁球","title":"#7 信仰与铁球","index":"8"},{"id":"#8-盗窃无前置判定","title":"#8 盗窃无前置判定","index":"9"},{"id":"#9-洗劫店主","title":"#9 洗劫店主","index":"10"},{"id":"#10-越级制作榨干潜力","title":"#10 越级制作榨干潜力","index":"11"},{"id":"#11-仙人掌与虚空产蜜","title":"#11 仙人掌与虚空产蜜","index":"12"},{"id":"#12-暗物质","title":"#12 暗物质","index":"13"},{"id":"#13-蓝图复制与无中生有","title":"#13 蓝图复制与无中生有","index":"14"},{"id":"#14-提里斯赌王","title":"#14 提里斯赌王","index":"15"},{"id":"#15-锻造弑神武器","title":"#15 锻造弑神武器","index":"16"},{"id":"#16-肉身成圣","title":"#16 肉身成圣","index":"17"},{"id":"#17-支配神明","title":"#17 支配神明","index":"18"},{"id":"#速通","title":"#速通","index":"19"},{"id":"#补遗","title":"#补遗","index":"20"},{"id":"#尾声","title":"#尾声","index":"21"}],"reward":true,"reading_time":"26345 words in 176 min"}